{"meta":{"title":"Pmlibrary","subtitle":null,"description":null,"author":"John Doe","url":"http://yoursite.com","root":"/"},"pages":[{"title":"About","date":"2019-05-11T13:46:39.308Z","updated":"2019-05-11T13:32:31.246Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":""},{"title":"Categories","date":"2019-05-11T13:46:45.748Z","updated":"2019-05-11T13:32:31.247Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2019-05-11T13:46:52.168Z","updated":"2019-05-11T13:32:31.247Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"NPDP考证专区","slug":"产品方法/NPDP考证专区","date":"2019-07-06T11:16:17.000Z","updated":"2019-07-06T12:03:15.524Z","comments":true,"path":"undefined/产品方法/NPDP考证专区/","link":"","permalink":"http://yoursite.com/undefined/产品方法/NPDP考证专区/","excerpt":"","text":"一、NPDP证书的价值 1.对于个人：﹡确保精通新产品开发的原理和最佳实务﹡提升工作表现﹡增大职业提升的机会﹡增加在同事、雇主和猎头中的辨识度﹡在你的领域里使你像专家和领袖一样鹤立鸡群﹡独特性：我们是新产品开发唯一的职业证书 2.对于管理者：﹡识别哪些人具备产品开发与管理足够的知识和能力以至于可以把他安排到领导者的位置；﹡区别求职的候选人，除了考虑这些人的工作经验，你还可以考察他们的产品开发知识以及他的职业发展兴趣。 3.对于组织：﹡为组织提供新产品开发的流程和原理，它提供一个基准和应该聚焦的领域﹡高绩效的公司理解，正确的培训员工能够带来直接的可衡量的效益 二、NPDP报考条件 三、NPDP认证流程NPDP国际产品经理认证是美国PDMA(国际产品开发与管理协会)于1979年发起的，是全球产品开发和管理领域最大的协会。其主旨为提升个人和组织在产品开发和管理领域的能力。NPDP认证流程如下： 四、NPDP考试时间考试时间一般于每年5月末和11月末进行NPDP全国统考。NPDP考试时间为3.5个小时。200道单选题，中英文对照，答对75%即可通过。 五、考试费用 五、考试题型 六、考试教材《产品经理认证（NPDP）知识体系指南》是NPDP认证考试用书，本书介绍了通过NPDP认证考试所需要具备的基本理论框架、知识体系及考试的要点等核心内容。本书内容包含新产品开发战略，组合管理，新产品流程， 文化、组织与团队，工具与绩效度量，市场研究，产品生命周期管理等七大知识领域，涵盖了从一个新产品的诞生到整体推广的整个流程，也是一套完整的产品开发管理知识体系。 本书阐述的产品开发和管理的基本原理，广泛适用于产品设计制造与服务行业，为个人和组织的不断学习与持续改进提供了基础知识与指导。 七、是否需要培训NPDP考试需要培训，培训费一般三五千不等，需擦亮双眼进行选择。 八、NPDP续证PDMA对于NPDP证书持有者有相应的续证政策和流程，证书更新的首要标准就是个人应积极获取其他新产品开发方面的知识，这将由个人所积累的职业发展单元（Professional Development Hour, PDH）来认定。NPDP证书三年有效，自证书颁发之日起，需在三年有效期内获得60个PDH，100%PDH可以通过参加研讨会或者其他有关的教育活动获取，50%PDH 可以通过参加志愿者活动获取。下表体现PDHs积累途径以及相应数量。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"PMP考试专区","slug":"产品方法/PMP考试专区","date":"2019-07-06T10:50:10.000Z","updated":"2019-07-06T12:03:15.525Z","comments":true,"path":"undefined/产品方法/PMP考试专区/","link":"","permalink":"http://yoursite.com/undefined/产品方法/PMP考试专区/","excerpt":"","text":"（文章内容来自PMP十万个为什么相关文章整理http://www.pmptuan.com/faq/8005.html，如有侵犯版权请联系xiong_cx@outlook.com删除，谢谢。） 考试简介PMP考试是由PMI( 美国项目管理协会 Project Management Institute)组织和出题,严格评估项目管理人员知识技能是否具有高 品质 的资格认证 考试 。1999年，PMP考试在所有认证考试中第一个获得ISO9001国际质量认证,从而成为全球最权威的认证考试之一。自从1984年以来，美国项目管理协会（PMI）就一直致力于全面发展，并保持一种 严格 的、以考试为 依据 的 专家 资质认证项目，以便推进项目管理行业和确认个人在项目管理方面所取得的 成就 。国内自1999年开始推行PMP认证，由国家外国专家局引进，由PMI授权REP机构负责培训， 国际 监考 机构 普尔文进行监考及考试组织。该认证的通过两种方式对报名申请者进行 考核 ，以决定是否颁发给PMP申请者PMP证书。 授权机构PMI(美国项目管理协会Project Management Institute) 证书用途根据美国IT培训公司Global Knowledge和杂志Windows IT Pro 2014年秋季对美国IT行业的调查，在最值钱的15种职业资格认证中，PMI（项目管理协会）主办的PMP认证（项目管理专业人士）资格排位第4。PMP认证也是非IT安全技术类认证中的第一位。排在PMP认证前面的3个认证均为IT安全技术类认证。以下是前5位资格认证及平均年薪：1、风险和信息系统控制（CRISC）：119227美元2、信息安全经理（CISM）：118348美元3、信息系统安全专家（CISSP）：110603美元4、项目管理专业人士（PMP）：109405美元5、信息系统审计师（CISA）：106181美元PMP资格认证是国际权威项目管理职业资格认证，自1984年第一次考试以来，发展迅速。目前，全球PMP人数已经超过64万人。中国已经成为仅次于美国的PMP人数最多的国家。PMP人数已经超过11万。 报名条件PMP考试报名条件如下： 一、报名考生必须具备35小时（即PDU）以上涵盖项目管理知识体系中10大知识领域的项目管理培训经历。二、参加PMP考试者必须具备以下两类情况之一：第一类：申请者需具备学士学位或以上者：要求申请者在申请之日前6年内，至少具有4500小时的项目管理经验，其包括五大项目管理过程组（启动过程、计划过程、实施过程、控制过程和收尾过程），累计参与项目管理月数至少达到36个月。第二类：申请者不具备学士学位或以下者：要求申请者在申请之日前8年内，至少具有7500小时的项目管理经验，其包括五大项目管理过程组（启动过程、计划过程、实施过程、控制过程和收尾过程），累计参与项目管理月数至少达到60个月。 报考时间PMP考试时间每年有四次，分别为3月、6月、9月和12月，一般为月末倒数第二周周末。 PMP报名时间一般需要比PMP考试时间提前2个月进行报考，报名周期大概半个月左右。 全国考点PMP考试城市已经涵盖了29个城市33家PMP考点，包括：重庆，济南，北京，上海，天津，广州，深圳，西安，武汉，成都，沈阳，杭州，厦门，福州，杭州，南京，昆明，宁波，乌鲁木齐，合肥，长沙，海南，珠海，东莞，无锡，河南，河北，大连，兰州。 报考流程PMP考试报名流程具体如下：1、获取35小时（PDU）以上涵盖美国项目管理知识体系中九大知识领域的培训证书；2、在网上提交英文申请材料；3、材料申报递交一周后会收到PMI回复的确认函，确认审核通过后，可以参加PMP认证考试，随后需进行中文报名；4、中文报名审核后，可以进行中国区安排的PMP认证考试；5、申请资料审查即复审（PMP认证部按一定比例抽查审核申请资料。提交给PMI证书部的任何虚假和错误信息将受到惩罚，包括中止或撤消考试资格或证书）；6、申请合格通知（如果考生的报名资料合格的话，在PMP考试前1-2周左右，PMI会将合格申请者的PMP认证考试资格信寄给PMI中国代表处，大陆各地考试报名点会通知考生）；7、收到PMI确认信（即准考证），表示已被允许考试；8、向考试中心核实考试时间、地点及其他安排；9、参加PMP考试；10、在考试后4—6周，您可以登陆PMI网站查看自己是否通过考试；11、在考后8—12周，PMI会将证书邮寄给PMI中国代表处，由PMI中国代表处发放通过学员的证书。 考试题型PMP考试题型只有单项选择题，四选一，没有多选题、简单题、判断题、问答题或论文等。 PMP考试语言是中英文对照，英文在上，中文在下。1、PMP试卷是200道单项选择题，中英文对照2、其中25道题目不计分，计分题答对106道就可以通过考试3、不计分的题是按照正确率最高和最低的来选择的4、包含5大过程组和10大知识领域的相关知识5、一般情况能做对130道左右就能通过考试 考试真题PMP考试真题分A、B卷，内容完全一样，但是题目顺序不一样，这样保证前后左右考生的题目顺序是不一样的，防止作弊。题目数量为200道，全部为单选题，答案选ABCD中的一个字母。 PMP考试试题样题：The benefits of a quality control program include: A. reduced short term costs B. increased long term costs C. able to make acceptance decisions D. a loss in competitiveness 质量控制系统的好处包括： A. 减少短期的成本B. 增加长期的成本C. 可以进行验收决策D. 失去竞争力 参考答案：C 考试费用自2018年3月起，PMI项目管理资格认证在中国大陆地区的PMP考试报名费将做出新的调整。调整后的PMP考试费收费标准如下：初考PMP考试费3900元；重考PMP考试费为2500元。特别说明，从2018年3月考试起，中国大陆地区PMI会员考试费价格将被取消。无论考生是否为PMI会员，中国大陆地区考试费收取均按照上述价格标准执行。 考试培训PMP考试时需要培训的，首先PMP考试费用在大陆地区是统一价格，3900RMB，也是公开透明的。那么PMP培训费用是多少呢?有没有准确的定义呢? 在2014年末PMI大会公布，自2015年起，所有PMP培训机构培训费用不能低于PMP考试费用。PMP培训内容一般包含PMP基础课（5天，PMBOK知识的讲解）+ 串讲冲刺（1天） + 模考（1-3天）。PMP培训资料主要包含以下几种：1、PMBOK（官方PMP教材，唯一一本PMI指定的教材）2、PMP培训讲义3、PMP参考书4、PMP模考试题 考试相关资源 1.《PMBOK》PMBOK是Project Management Body Of Knowledge的缩写， 指项目管理知识体系的意思，具体是美国项目管理协会（PMI）对项目管理所需的知识、技能和工具进行的概括性描述。：经PMI确认，自2018年6月项目管理考试起，中国大陆地区PMP考试参考教材统一使用《项目管理知识体系指南（PMBOKGuide）》第六版，2018年3月中国大陆地区PMP考试仍使用第五版教材。：《PMBOK第六版（中文）》下载地址如下：https://pan.baidu.com/s/1xAjgW0p05F4hU51OAhuAeQ 2.《PMP强化记忆手册》《PMP强化记忆手册》在百度文库可以下载，地址如下：http://wenku.baidu.com/view/3742b827ccbff121dd3683e2.html?re=view 3.汪博士解读PMP第六版的在线PDFhttps://max.book118.com/html/2018/1030/5132033344001323.shtm 4.其他问题可戳http://www.pmptuan.com/faq/8005.html","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"关于详情页对齐方式分析","slug":"产品方法/关于详情页对齐方式分析","date":"2019-07-06T10:49:26.000Z","updated":"2019-07-06T12:03:15.526Z","comments":true,"path":"undefined/产品方法/关于详情页对齐方式分析/","link":"","permalink":"http://yoursite.com/undefined/产品方法/关于详情页对齐方式分析/","excerpt":"","text":"原文链接：https://note.youdao.com/ynoteshare1/index.html?id=e25d4ec716a50e67a7a503597a15129d&amp;type=note 问题描述在类似这种原型的场景下,进行排版设计时,如何判断内容应该是左对齐还是右对齐 角度1:最优视觉扫描路径如图所示,从最优视觉扫描路径的角度,B方案左+左是相对最优的设计~因为B方案的扫描路径较短,信息内容获取速度相对A方案较快且准确度高;标题和内容的联系性也强于A方案.C方案因为视觉过于凌乱而不列入考虑~ 角度2:标题与内容的关联性在这个角度,依然是B方案优于A方案,更接近的距离更便于用户认知到标题和内容的联系.尤其是横屏场景下,右对齐认知难度会大幅度提升.但特殊情况下,用户对左边的标题已经很熟悉了,而且标题和内容的长短差异都很大,层次不齐,此时A方案也具有一定优势~ 角度3:视觉上的美观度在视觉美观这个角度,会因为审美差异造成不同意见,但是据粗略统计,较多人认为A方案优于B方案,因为左右对齐相比左左对齐看起来更有节奏和韵律感. 角度4:金额等内容的特殊性在存在特殊内容时,A方案优于B方案,典型的比如支付宝和微信的账单页面,右对齐可以很方便的对比金额的大小. 在金额和文字混排时,支付宝选择了右对齐,而微信选择了左对齐初步理解是因为支付宝的账单页面是有下一级页面的,所以作为下一级页面内容的说明,需要右对齐靠着箭头~而微信的账单页面是没有下一级页面的,所以可以选择左对齐的方式.","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"WEB表单设计-结构篇","slug":"产品方法/WEB表单设计-结构篇","date":"2019-07-06T10:48:28.000Z","updated":"2019-07-06T12:03:15.529Z","comments":true,"path":"undefined/产品方法/WEB表单设计-结构篇/","link":"","permalink":"http://yoursite.com/undefined/产品方法/WEB表单设计-结构篇/","excerpt":"","text":"下文《WEB表单设计》的学习总结，会分成结构、元素、交互三部分说明。—————————————————————————————–本文内容很棒，我提了部分建议希望能帮助学姐把文章优化得更好~ 文章编写内容结构可参考 表单很重要表单是人们上网完成务的重要方式，不管是网上购物、社交删除、还是各种生产力网站都必须填写各种各校的表单才能完成用户的目标。但是现在的很多表单并非“由外而内”设计，而是以“由内而外”的方式，通常是只是由系统人员根据计算机系统的需求设计，这就导致了表单可能有一堆的问题是系统需求而非用户需求，比如各种安全提问，用户用的非常痛苦。好的表单设计应该由人一样体贴。我们以购物为例，当我们去超市购物时，把商品从货架放到购物车，到收银员结账时，收银员会面带微笑的询问顾客，顾客也能立马从收银员那得到想要的答案，这一切都有良好的体验。但是这一旦从线下转为线上之后，就只剩下一张张冷冰冰的表单了，用户想完成结账就会遇到各种问题，这时就有用户就会觉得送钱都这么困难就干脆不买。 设计原则那么如何设计优秀的表单?这个问题其实不好回答，正确答案就是视情况而定，这看上去是一句正确的废话，但是确实没有太好的方式。不过下面几条原则还是能有一定的指导作用： 尽量减少痛苦：用户只想要完成表单后的结果，而非表单，这一过程应该尽量的简洁、容易； 说明填写完成路径：表单应该清晰的告诉用户如何完成表单； 考虑情境：表单不会单独存在，必然是在一个场景中，那么设计师就应该分析各种存在的场景而设计； 确保一致沟通：公司内部有各种不同的部门，虽然每个部门都有不同的需求，但是用户只是和一个网站或应用对话，要确保保持一致的服务。 表单的组织设计表单应该最先考虑表单的内容，因为用户最关心的是需要填写什么，然后是内容的组织方式，这就需要选择好的问题和有效组织内容。 选取问题最好的表单其实是没有表单，这也就是说需要分析每个问题，这个问题是否真的需要、能否自动获取、什么时候提问才适合。同时要注意纸质表单和电子表单，很多在纸质表单上必需回答的问题在电子表单上是可以不必提问的。用户关心的是问题内容和为何要问这些问题。有些设计师会注意类似要不要有冒号这类问题，但是用户真的不关心，用户只是想快速完成任务而已。先想想是否真的理解用户，是否了解公司业务。如果不了解则需要多调查。在确定了问题后再考虑问题的组织。可以问下面几个问题了解： 为什么用户会填写表单？ 用户和你的公司有什么关系？ 用户觉得这种关系好还是坏？ 表单能否进一步激发用户对产品、服务或其它一切东西的持续热情？ 表单只是阻碍用户实现目的的可怕障碍？在问了上述问题后，可以使用“保留、删减、延迟、解释”这几个策略对问题整理： 保留：你问的问题与用户渴望给出的答案一致，则保留，然后设计细节； 删减：你问的问题不需要真的马上得到答案，拿掉这个问题； 延迟：有些问题也可能不需要马上就问，延迟发问，起到问题不会让人感觉多余或者有侵略性； 解释：有些问题用户不想回答，但是对公司真的有价值，而且必须提前问，解释其理由并且简短说明。 最后，平衡用户需求与商业需求。 构建对话表单设计成人与人对话的有利于用户的思考，注意以下几点： 不要不停向用户问一连串的问题，而应该在问的过程中让用户了解网站是谁，为什么要问这问题； 构建有意义的自然对话，即网站的表单要向人一样与用户交流，如’发卡行‘改成’哪家银行签发此文件‘会让用户更舒服； 使用用户的语言，而非使用技术性的语言，上面的例子’签发‘改成’哪家银行给的文件‘更容易理解； 最后，并不一所有情况一定都要用句子的形式，当问题很清楚的时候可以使用短词作为描述，只有当问题不清晰的时候才能句子。组织内容如果表单内容较多，可以对其进行分组，可分为多页或一个页面多个部分。具体分几页则需要视情境而定，每页或每个模块视为一个主题，主题与主题之间需要形成有意义的对话。通常情况下主题之间形成一定的顺序。归纳区别为了显示内容组之间的区别，很多网站会用大量的视觉效果，但是其实只需要使用最小的视觉效果就可达到目的。同时这样有助于保持焦点在内容而非设计上。在设计时尽量使用信息本身产生的差异自然形成区别。完成之路没人会喜欢表单，人们完成表单只是为了要完成之后的东西：购物、使用服务等，那么说明完成表单的路径至关重要。表单的命名表单的名称需要解释人们在填什么表单，填完后能干什么。点击的链接名要和表单名称一致，这样人们能知道正确的位置。起始页正确的命名可以让人们从正确的位置开始，但往往还要额外的信息告诉人位如何开始。起始页说明用户需要填写的内容、时间、注意事项等。当然只有当表单过长才需要，如果表单能马上让人知道答案就显示累赘。清晰的浏览线如果用户的浏览路径是一条直线那么就能快速对问题做出答复，完成任务的时间最少。良好的设计应该满足标签/输入框之间的平衡，视觉能在表单间自然的移动。注意力分散最少剔除与表单填写没有直接关系的界面元素，有助于保持人们完成任务。即使像返回主页等在一般页面上属于重要元素，在表单页面也尽量减少以防止用户离开。进程指示如果表单是在多个页面那么显示完成进度会很有用。可以对主题编号显示完成的进度的。但是如果完成步骤并不是明确的，如在完成表单会多出一个步骤的情况则不用编号的方式，可以笼统的进程显示。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"设计搜索界面，你需要考虑这20个细节","slug":"产品方法/设计搜索界面，你需要考虑这20个细节","date":"2019-07-06T10:47:45.000Z","updated":"2019-07-06T12:03:15.529Z","comments":true,"path":"undefined/产品方法/设计搜索界面，你需要考虑这20个细节/","link":"","permalink":"http://yoursite.com/undefined/产品方法/设计搜索界面，你需要考虑这20个细节/","excerpt":"","text":"这篇文章是我们在设计解决方案以及我们在原型设计时应该考虑的元素清单之前，应该回答的问题集合。（文章内容来自人人都是产品经理SKYUI专栏网站http://www.woshipm.com/pd/1038062.html，如有侵犯版权请联系xiong_cx@outlook.com删除，谢谢。）问用户有哪些问题？原型开发时应该考虑什么？什么是界面搜索设计的最佳实践?根据不同项目，搜索可能是最复杂的功能之一。用户虽然仅看到一个盒子，但实际上在这个盒子背后有一个复杂的系统，设计师和开发人员有大量的工作。这篇文章是我们在设计解决方案以及我们在原型设计时应该考虑的元素清单之前，应该回答的问题集合。 一、观察并提出问题设计师在研究阶段需要回答8个问题，了解用户搜索的原因，他们何时以及如何形成搜索问题。 1. 你的用户的信息需求和意图是什么？他们是否搜索到： 导航，查找特定网页。 查找具体信息（“布拉格天气”，“澳大利亚首都”）。 寻求建议（“如何设计搜索界面”）。 查找资源、应用程序及文档。 查找事实，数据（“我们网站上有多少活跃用户？”）。 收集来自不同来源的信息。 数据分析。 2. 用户在什么时候点击搜索？ 他们在点击搜索之前做了什么？ 他们跟谁讨论过？ 在切换到搜索之前他们用了哪些应用程序？ 3. 用户如何形成搜索问题？搜索交互是一个对话过程。如果你知道用户如何开始对话，便可以给他们正确的答案。 4. 用户是否确切地知道他们所找的东西？或者他们仅是单纯地浏览？例如，研究关于友谊的课题，寻找任何相关的书籍，或者寻找一本特定的书籍。我希望这两个请求有不同的结果。 5. 用户期望找到什么？ 他们是否能描述期望的搜索结果是什么？ 他们还能找到这些信息吗？ 6. 接下来的步骤是什么？ 他们对结果会做什么？ 如果没有找到他们正在寻找的东西，用户会怎么做？ 如何让搜索适应他们的工作流程？7. 用户操作是否存在模式？用户行为中的模式描述了用户如何进行搜索交互，他们所期望的结果及他们接下来的步骤。在重新设计现有界面时，模式是非常重要的。在《搜索模式》和《用户界面搜索》中，作者描述了这些常见的搜索模式和模型：退出模式：用户输入查询&gt;查看结果&gt;退出狭窄的格局：用户输入查询&gt;查看结果&gt;将其缩小优先第一模式：用户输入查询&gt;查看结果&gt;打开第一个链接之一珍珠增长模式：用户输入查询&gt;打开其中一个结果&gt;打开文档中的相关链接或使用文档中的词汇查询在Searchpatterns.org或Medium的搜索模式（查找具有示例的常见模式列表）中查找更多模式。8. 他们会使用什么应用程序？如果你的产品是工作流程的一部分，其他工具可能会影响用户的习惯和对其用户体验的期望。详细了解他们这些工具中的搜索如何进行交互，以及最有效的交互方式。询问并了解他们的搜索交互方式询问用户是一种可以帮助你与用户建立联系，并在正确的时间直接向其提问的一种工具。二、检查列表：每部分的搜索考虑搜索有更多的组件不止满足视觉。这个检查列表帮助原型更快，不会让你忘记任何东西。*免责声明：此列表仅包含交互元素，不考虑算法、搜索行为、结果的速度或质量，仅考虑桌面搜索界面。移动搜索在许多方面有所不同，需要自己的博客文章。1.结果页面（1）结果类型 视频、事件、音频、位置、图表在你的网站上有哪些类型的信息是可用？哪些类型可以搜索？如何在结果页面上更好地显示不同的类型？（2）可视化结果1）表单或列表 Paper.dropbox.com2）卡片 Pinterest.com3）可调节视图 Bookmate.com4）分面导航基于信息架构将搜索结果划分为逻辑组，使浏览体验更加舒适。 “分面导航无疑是过去十年中最重要的搜索创新。”——Jeffery Callender，Peter Morville Spotify的： （3）页面上的项目数量用户一次能看到多少结果？我们能否通过提供替代视图和排序来让他们舒适地安排结果？1）查看设置 Ebay.com2）分类 Ikea.com3）分页4）加载 Asos.com5）无限滚动 无限滚动的Duckduckgo.com6）组合（4）预览这是一个经过深入研究的部分界面。最佳实践告诉我们在搜索结果中包含哪些内容？1）预览中要突出显示查询术语 iBooks2）帮助区分结果的文档总结 Ataccama.com3）页面预览 Youtube.com（5）可访问性确保每个用户都可以轻松地使用我们的产品是我们工作。搜索结果是否可通过文字转语音服务进阅读？字体大小和对比度是否可读？人们能否在一个晴朗天移动显示屏上进行阅读？所使用的颜色是否可以被所有人识别？（6）快捷键一些公司将结果预览展示给下一个可用性级别，在不离开结果页面的情况下向用户提供必需的最少量信息和功能。 &lt;br /&gt; &lt;br /&gt;Google&lt;br /&gt;**（7）可操作**&lt;br /&gt;我们如何帮助用户更便捷地完成工作？比如，让用户在不离开结果页面的情况下有机会开始处理他们正在查找的项目。 Spotify这些是一些常见的行为。它们在不同产品中可能会有很大差异： 分享 保存结果，书签，添加到愿望清单 添加到购物车 应用商店： 评论 预览图库 批量操作 Dropbox paper（8） 界面反馈1）加载图标或进度指示器 Skyscanner2）有关搜索过程的信息（结果，时间，应用过滤器） Fights.yandex.com 系统通知（例如，如果对搜索结果的时间敏感，用户需要重新刷新页面） 未找到页面 Skyscanner.net3）微交互（9）历史搜索记录 最近的查询 最受欢迎的查询 （10）过滤和分类过滤器有自己的博客文章。设计复杂的网站时，定义明确的过滤器非常重要。他们会让搜索体验更流畅。 Booking.com 类别及其间隔尺寸 标签 过滤器类型 布局 操作（保存并编辑自定义过滤器） 分类 （11）定制化服务如果搜索是应用程序中的关键功能，并且是用户工作流程中的重要组成部分，那定制对他们来说非常重要。可以允许用户调整结果页面布局，更改字体和颜色，定义页面上显示的结果数量，保存过滤器，自定义分类参数或添加行动号召。 谷歌搜索 Aliexpress.com（12） 个性化用户设置、之前的查询、偏好及其他有关用户的信息如何改善搜索体验。（13）快捷键一组键盘快捷键可以更轻松地浏览搜索结果。（14）相关指示器根据内容的类型，结果的精确程度及结果相关性的差距，相关性指标有助于加快决策速度。 2.搜索框检查列表（1）可视化 定位搜索框 行动号召 图标 单个或多个输入字段 Franzen和Karlgren在2000年发现：向研究参与者展示更广泛的报名表格，鼓励他们输入更长的查询。用户搜索界面。（2）输入类型你支持什么类型的搜索输入？ 文本 音频 图像 标签 （3）帮助1）搜索提示。向用户展示搜索的全部的可能性。 Stackoverflow.com2）输入字段中的默认文本 Imdb.com（4）自动完成自动完成功能可以成为快速高效地进行搜索互动的强大工具。 Fullstory.com 预先定义的自动填充会提示最近或当下流行的查询、过滤器、标签或播放导航角色。 结构化建议可帮助用户浏览复杂的网页。 Twitch.tv（5） 微交互 加载 错误消息 系统通知 快速清除查询的方法 Google驱动（6） 高级搜索如果有许多用于查找项目的参数，则可以考虑使用高级搜索选项和逻辑操作。例如：我想找到住在柏林的所有客户，并在上个月进行了购买，年龄在45-60岁之间。我们如何用界面支持这些类型的查询？1）逻辑运作 Confluence2）基于高级搜索的界面 Fullstory设计跨渠道搜索体验：设计多种设备是设计过程中至关重要的一部分。我不会在这里讨论这个话题，但你可以在Tony Russell-Rose和Tyler Tate的《设计搜索体验》中阅读更多内容。 三、小贴士搜索是一个复杂且昂贵的功能，技术限制在设计中发挥重要作用。这就是为什么一开始涉及研发团队（等同于研究阶段）是非常重要，该团队了解用户需求并帮助你寻找最佳解决方案。 搜索界面案例 Swiftype Algolia Jira Atlassian FullStory Mac OS finder YouTrack Skyscanner Google Drive Slack Spotify com Zillow LinkedIn VW Model Lineup com com Goodreads IMDb Yandex Flights Twitch 原文作者：Nadya Tsech原文地址：https://uxplanet.org/search-interface-20-things-to-consider-4b1466e98881","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"从”在看个人主页“来看社交推荐的发展","slug":"产品方法/从”在看个人主页“来看社交推荐的发展","date":"2019-07-06T10:46:28.000Z","updated":"2019-07-06T12:03:15.530Z","comments":true,"path":"undefined/产品方法/从”在看个人主页“来看社交推荐的发展/","link":"","permalink":"http://yoursite.com/undefined/产品方法/从”在看个人主页“来看社交推荐的发展/","excerpt":"","text":"微信近期推出“看一看”个人主页——“朋友在看列表轻触朋友昵称，可访问朋友在看个人主页”。 微信对“看一看”的更新，我觉得是对微信内容推荐逻辑的一次升级。 一、说说“看一看”的更新 1、“好看”与“在看“2018年12月，微信在7.0版本的大更新中，正式将文章底部的“点赞”改成了“好看”，”好看“的内容会在“看一看”中展示，并且可以评论。但这里有个问题，“好看”意味着表达了一种态度，是对文章观点的认同，但在社交推荐的场景下，推荐并不是。于是，在“好看”上线3个月后，微信用了产品经理解决问题最高境界——“改文案”来解决这个问题。把“好看”变为了“在看“之后，不涉及主观情绪，仅仅表达”这是我在看的文章，你怎么看？“，而要表达的观点以评论的方式展示，“君子合而不同” 2、“在看”个人主页5月28日，微信上线在看个人主页功能，通过点击昵称可以进入在看个人主页，可以看到微信好友近7天的“在看”。 通过查看朋友个人主页，把用户的活动路径立体化，看到更鲜活的朋友，基于好友在看内容做点赞、发表见解，甚至可以设置“不看某人”、“不让某人看”，妥妥“在看”版的微信朋友圈。 二、为什么是社交推荐从产品角度来看，有效的推荐机制应满足两点：1、准确。2、满意。 对于机器推荐来说，无论是基于内容分析还是基于协同过滤，更多解决的是准确度的问题。当用户对文章质量有要求时，推荐的内容就无法令用户满意了。比如，“某条的产品，我赞了几个漂亮小姐姐以后，随后所有推荐内容都是漂亮小姐姐。从准确上来看是正确的。但后续我已看腻你还不断给我看，这时我的满意度上就无法满足“ 而对于社交推荐来说，推荐好友推荐的内容，通过社交圈的“过滤”机制，会因某人“在看”，我也要看，由此而对本次推荐感到满意。比如，“一篇《2019年总监找工作更难么？》，如果是一位产品总监推荐的，我会阅读。但如果是楼下理发店设计总监推荐的，我会直接略过。“目前此时，在这个时候可以看出微信做出了与机器推荐截然相相反的另一条推荐方式——社交推荐。 2、为什么是微信头条系打击，看一看承担着微信信息流分发的重任。 微信目前在社交霸主的基础上想方设法意图进行着商业化，这种模式主要就是社交工具和信息流分发的结合。 微信从社交出发的信息流，目前的朋友圈是其一，但这个主要是用户自己创作或分享的内容，可以当作是UGC，但这个毕竟是需要用户主动来发送的。现在人越来越懒，对内容型消费的心理就是哦，看了；然后，没有了啊。真正原创产生的内容也是有活跃梯度的。留意一下，是不是有一种除了高频发圈用户外，其他好友的越来越少发朋友圈了，甚至有些直接就选择关闭了的感觉呢。再有，微信自己实施了半年、三个月、一周、三天等等的可见时效，以及各种不同分组的可见策略，让发个圈还要左右烧脑周折一通，大家是不是开始对朋友圈有些许淡漠了呢。分发的途径还有现在已经快被遗忘了的臃肿和低效的微信单聊和群途径，现在除了工作群，还有几个发鸡汤啥的了。。。。。在这种境况下或者没有这种境况下，怎么让人暴露得越多，或者说更加方便用户来了解对方，来增加PGC露出。增加个人主页，显示用户最近在看的内容好不好。好，那就来了，这又是个信息流分发。但是这个是干啥的？内容分发，已经有朋友圈和订阅号信息夹。我的猜测，如果不是手滑，个人主页增加PGC的分发和促进了对用户共同兴趣点的鉴别与筛选，是微信早已在做的用户画像策略之中，灰度测试这个来验证下现在实现的聚类效果？ 3、两个“朋友圈”头条系打击，看一看承担着微信信息流分发的重任。朋友圈承担用户分享生活的任务，那么看一看就是用户分享学习和阅读路径的场所。 三、下一步会变成什么 1、不敢点“在看”了当在看逐步变为资讯版的“朋友圈”后，不可避免的面临用户隐私问题，比如你看到一篇《性爱降级》觉得讲的深刻，敢点好看吗？好在微信已经逐渐推出，“设置谁可看”、“设置只看谁“这样的功能，后续会不会像朋友圈那样更灵活设置某次”在看“仅对某些人可看尚不可知。但从这次更新来看，微信已经开始尝试解决隐私问题了。 用户在遇到优秀的内容，会通过点击“在看”，让好友知道他所处的内容圈子，这其中也是满足用户获得认可的需求。举个例子，用户今天学习了一篇产品的深度好文，点个“在看”就可以让好友知道他在学习，塑造了刻苦努力的人设。 2、商业软文集中推广页基于微信的体量来讲，哪怕仅有极少一部分人使用看一看功能，绝对值上也是一个可怕数字。因此对于自媒体和微商来说，是一个全新的流量池。那么会不会想朋友圈那样，被各类商业软文、微商产品所占领，变成广告集中推广页。开个脑洞，也许微信原本就是想净化朋友圈，将朋友圈的各类软文、微商赶到“看一看”中，然后某天彻底关掉文章分享到朋友圈功能。 3、大众阅读产品如果能解决用户隐私顾虑和营销泛滥的问题，相信这个时候的“看一看”能成长为比机器推荐更受欢迎的资讯阅读产品。那么当“看一看”足够成熟的时候，会不会像QQ看点那样，将入口开到第一层级？也许不会，因为微信的有一点最重要产品观——克制。 4、将内容交流的需求从朋友圈剥离","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"引导工具箱","slug":"产品方法/引导工具箱","date":"2019-07-06T10:45:09.000Z","updated":"2019-07-06T12:03:15.531Z","comments":true,"path":"undefined/产品方法/引导工具箱/","link":"","permalink":"http://yoursite.com/undefined/产品方法/引导工具箱/","excerpt":"","text":"引导工具箱书籍一、原因：1.为自己打开了一个更全面的思考格局，对于之后的组织问题引导以及个人问题解决提供了非常棒的科学指导方法。2.对团体的整体管理从破冰形成到震荡管理以及表现激励有更细节化工具进行良性科学的推动，以人为本以尊重和理解为前提，加上一点点小的技巧就能更高效的解决问题促进交流破冰。 二、事例：同时我在读此书时发现我日常其实已经用过和接触过此书的很多工具比如我比较常用的停车场、共享目标、亲和图、检查法、帕累托、传球发言、回顾时间等接触到的：W/C表格、利益矩阵、曼陀罗思考法等以及其他大家熟知的方法：头脑风暴、目标树、鱼骨、决策树、力场分析、风险分析、PREP、SWTO、PPM等本书规范科学的对这些工具做了一个整理分析释义，给予读者直观简易的切入。 三、总结：此书给予了我一个很好的工具查找渠道，且书里针对各个工具的适用场景使用方法及结合具体实例进行分析，更易理解切入，结合项目管理书籍结合此书一起用于团队建设应该是非常好的搭配，用于日常问题解决也非常棒，值得一读。 四、分享：好书一起分享，最后附上书籍PDF地址：链接：https://pan.baidu.com/s/1laUZ8-Kf5XSzaz7Fnkz8BQ 提取码：G044","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"结网","slug":"产品方法/结网","date":"2019-07-06T10:44:40.000Z","updated":"2019-07-06T12:03:15.531Z","comments":true,"path":"undefined/产品方法/结网/","link":"","permalink":"http://yoursite.com/undefined/产品方法/结网/","excerpt":"","text":"推荐原因：产品入门的必读书籍。 简介：作者作为资深PM，以实际经历，深入浅出讲述了互联网产品的方方面面，包括用户分析、需求筛选、需求分析、项目管理等内容，并且精心拣选填充了众多的真实案例而不仅仅是空白的方法论，看完本书，一定可以帮你在不错的程度上了解产品，如果不够，此书还有众多补充推荐内容，可以一一去看，总之，你不会后悔阅读它。 总结：正如开篇所讲：“从广义上说，人人都是产品经理”，所以本书的受众不仅仅是产品经理这个岗位群体，而是每一个有心培养自身产品思维的人。于是从另一方面来看：本书的门槛很低！最强的功力就在于：将丰富专业的内容以每一个人能读懂的形式输出，你要做的，仅仅是翻开它并认真读下去。 附上链接：https://pan.baidu.com/s/1nMLFMUsDxtSK_AUhRFxSIQ，提取码：m0ap以下为本书结构图，可供参考","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"从点子到产品","slug":"产品方法/从点子到产品","date":"2019-07-06T10:44:13.000Z","updated":"2019-07-06T12:03:15.531Z","comments":true,"path":"undefined/产品方法/从点子到产品/","link":"","permalink":"http://yoursite.com/undefined/产品方法/从点子到产品/","excerpt":"","text":"推荐原因：一位拥有丰富经验产品人的诚恳分享 简介：这是一本讲述产品经理将点子实现为产品过程中，围绕着产品问题展开，论述了产品应该思考哪些问题，如何思考问题，以及如何解决问题。此外，作者还结合自己做的项目，传授了一些需求管理、工作流管理的经验。 总结：产品经理工作的方法论汇总，适合入门阅读，系统有目的去学习一些方法。 以下为本书结构图，可供参考","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"黑天鹅","slug":"产品方法/黑天鹅","date":"2019-07-06T10:43:19.000Z","updated":"2019-07-06T12:03:15.532Z","comments":true,"path":"undefined/产品方法/黑天鹅/","link":"","permalink":"http://yoursite.com/undefined/产品方法/黑天鹅/","excerpt":"","text":"推荐原因：读《黑天鹅》，也是对人生新的可能性的阅读 简介： 黑天鹅的存在，寓示不可预测的重大稀有事件，它们常常带来意料之外的重大冲击，但人们总是视而不见，并习惯于以自己有限的生活经验和不堪一击的信念来解释它们，最终被现实击溃。本书深入介绍了黑天鹅事件的本质和规律，发掘出我们所不知道的事情背后的真正价值，教会我们如何认识这个社会的运行方式，如何避免小概率事件带来的重大损失，如何在不确定的世界中占得先机。 总结：苏格拉底说，唯一真正的知识是知道自己的无知，虽然我们不一定要选择全部相信，但世界在快速变动中一次又一次打破了我们习以为常的认知。或许正如黑天鹅思维所阐释：“世界是由极端、未知和非常不可能发生的事物主导的”，当我们已知的不再具有其意义之时，如何去应对这一切？本书或许是唯一一本较为专业讲解应对智慧的书。 附上链接：https://pan.baidu.com/s/1v5lEaRS8uvrHqH7CR5ZZCQ 提取码：77te 《黑天鹅》书中内容极为丰富，除了众多已列明的大观点之外，还有大量值得深入挖掘的思想隐藏在文字之间，值得详细阅读。以下为本书结构图，拣选部分观点展示，可供参考。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"如何分析职场环境并破局——具体案例分析","slug":"产品方法/如何分析职场环境并破局——具体案例分析","date":"2019-07-06T10:38:42.000Z","updated":"2019-07-06T12:03:15.533Z","comments":true,"path":"undefined/产品方法/如何分析职场环境并破局——具体案例分析/","link":"","permalink":"http://yoursite.com/undefined/产品方法/如何分析职场环境并破局——具体案例分析/","excerpt":"","text":"一、写在前面：职场，一个非常微妙的环境，我们在其中可能会遇到各种各样的问题，碰壁、入坑、背锅很常见，那么，我们如何减少这种事件的发生呢，如果我们能做到准确的分析职场环境，清晰的认识后续的事态发展方向和可能的坑点，那么我们就能很好的应对相关的风险提前做好破局之策，化解风险甚至把逆风局走成顺风局。 本文整个案例事件来自产品经理A的亲身经历，分享出来，为大家提供一个破题的思路。在此非常感谢我的恩师M师傅在整个事件中对我的指导和帮助。没有M师傅，我没法能尝试分析职场环境及分析破局之道，也就不会有这篇文章，再次感谢。同时非常幸运能成为S全S美团队的一员与这么多优秀的小伙伴一起沟通成长，受益颇多。 那么接下来我们就来谈一谈我们如何去做职场环境分析及破局，我会结合以下这个事例进行职场环境分析： 二、案例分析： 1.问题产品经理A，目前新入职一家国企性质的公司，公司的业务是做传统行业的相关业务。目前公司有以下问题: 1.目前公司的产品管理流程相对互联网行业来说非常的不规范，设计、产品、研发、运维之间权责不清。2.最终造成产品经理不仅成背锅侠还有负责售前售后运维以及项目经理的所有细化工作。3.而且公司里的大部分人员的状态都是温水煮青蛙，团队积极性相对比较差。4.产品部的部门经理与产品总监也不专业，不懂项目管理和产品管理流程，管理标准经常性变动。5.公司的现状是大开发大运维大运营大设计小产品经理，产品经理实权太小（可能与A刚到公司也有关系），成员之间缺少尊重。6.公司自己的自研团队资源很少，基本开发资源和运维都是外包，产品研发推进很困难，三方沟通成本超级高。然后项目经理基本是摆设，只做商务对接，项目管理的活产品经理要全生命周期跟。7.产品验收:测试在公司只有一个，测试是抽测，产品经理需要对所有细节做全部的验收。8.这边公司的优势在于传统企业相对有保障，福利待遇还行，而且在这个混沌的局面产品经理A的晋升机会比较大。产品优势在于有基础用户数据量，有产品以及产品投入及规划。 产品经理A心里的疑问:1.产品经理如何在这个公司混沌的管理局面中破题，在该公司找到适合自己的生存之道,能有效的推进产品的进展。2.在个人职业发展角度，这一类公司是否适合长待，或者我现在需要不需要赶紧观望另谋高就？ 2.如何分析职场环境并破局那么在这种情况下那么如何进行环境分析及破局呢： 人在遇到疑惑的解决方法一直是自己想破题之道，但是一个人自己越想越容易陷入死胡同很难抽离出来站在全局的位置上去分析自己的处境。 1.这个时候我们需要从局中跳出来，理清相关思路，有条件的话可以找前辈沟通咨询。2.如果遇到疑惑和困境，通常伴随着个人的逻辑误区，在分析环境及局势的时候需要理清逻辑思维方面的一些误区，如对事情的看待不能只定性，还要定量看待（温水：是30度还是60度）；不要用常规的共性思想去定义每一个具象的事物；人之初性本恶，人都是懒惰的自私的，包括自己；以及其他的逻辑思想方面的其他偏执性的思想等，跳出局中再去看其他的人事物，能有效的缓解心理执念以及心理压力。有助于对于之后对于自己的认识和环境的分析更准确全面，也有助于你之后用更轻松舒适的心境去做实施工作。3.对于职场环境进行全局分析判断，针对以上的公司情况，第一，找领导给资源短时间内是行不通的；第二，指望其他部门支持暂时来看也达不到；唯有自立更生了，这时候可以采用“合纵连横”破题方法进行局面推进。 识清环境及人员，明白干系人的需求，摸清盘子； 合纵连横，找到能用的人往下一起使力，不能用的人也不要成敌人； 建立与其他部门的沟通规范，有风险提前进行事态预警，项目推进时让其他部门知道风险点，共同承担风险； 建立自己的工作规范与影响力，为事项推进建立影响力基础； 营养他人，让团队形成一个有机的想象的共同体，形成团队内的工作默契及共同的价值导向， 集中力量攻破一点，先做出一点成绩，或者展示出潜力面，使事态形成良性发展趋势； 再发声或者要资源就不一样了，事项推进也会更顺利。3.个人职场规划最后需要对自己的职场发展进行规划，明确自己的目标，不能陷入眼前具体的事项中无法拔出，理清了后续的1年短期计划以及5年内长期计划的相关规划，非常关键。 后续规划：1.工作质量与自我成长计划平衡，产出质量自己把控，不要质量过剩，把能力发挥得恰到好处。2.在这一年里提升自己后续想跳槽方向得产品方面得知识技能能力储备及跳槽相关知识，市场环境动态随时监控。1年后一定要具备下山能力。3.这一年可以在这个公司成长的:a.破局能力:这是一个太好的盘子做试验田，如何在逆风局里生存甚至发展成顺风局；b.C端产品相关东西以及会员商城这边的，业务流程，设计思路，产品场景熟悉；c.产品经理硬技能加强：相关工具的使用及产品微观体感的提升；d.运营相关知识及技能的提升：如运营数据分析，运营活动设计及开展，数据埋点。4.把大盘子每个人看清楚,其次对公司有长短期规划以及自己的规划5.做公司的事儿顺便把自己的目标完成，一箭多雕；6.做自己的事儿的同时也要考虑到别人的利益，双赢；7.建立对上对下的影响力；8.不要急于出头，帮助相关干系人如部门经理以及其他同事进行工作切入。三、结语思想的格局直接影响到之后的规划和行动，因为市场一直是在变化之中的，只有看清局势提前做好规划，早点做个明白人可能才能免于被动。而且引用艾琳的一句话:毕竟，这个世纪，思想才是最性感的，共勉。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"教你读懂机器学习","slug":"产品方法/教你读懂机器学习","date":"2019-07-06T10:38:00.000Z","updated":"2019-07-06T12:03:15.533Z","comments":true,"path":"undefined/产品方法/教你读懂机器学习/","link":"","permalink":"http://yoursite.com/undefined/产品方法/教你读懂机器学习/","excerpt":"","text":"前言从AlphaGo战胜李世石开始，AI迎来了新一轮爆发增长，2018年，全球人工智能市场规模达到了73.5亿美元，各个行业和领域几乎都被AI渗透，各国对AI人才的争夺也正愈演愈烈，《中国人工智能发展报告2018》显示，专利上，中国已经成为全球人工智能专利布局最多的国家，数量略微领先于美国和日本；产业上，中国的人工智能企业数量排在全球第二，北京是全球人工智能企业最集中的城市；全球知名创投研究机构CB Insights评选出了100家最有前途的AI公司，国内的商汤科技，旷视科技，第四范式等6家公司杀入到榜单中，同时各大互联网公司都在构建自己的AI实验室，一方面通过AI技术挖掘用户数据，通过+AI，优化现有业务，另一方面探索AI应用新场景，研发新产品，完成AI+，为企业寻找全新的增长引擎。 笔者有幸参与了一个机器学习建模实验室项目，项目的本质是抽象机器学习建模流程，将机器学习建模过程组件化，通过在画布上对组件（算子）灵活连接，让非专家用户（不会写代码，不熟悉算法模型和调参的产品经理，市场运营，行政财务等职场人）可以快速搭建机器学习模型，实现业务预测，极大降低机器学习应用门槛。通过近十个月的学习和实践，笔者对机器学习有了初步理解，本文将通过大量案例和通俗易懂的“人话”，讲述机器学习建模逻辑和使用场景，让非数据科学专业的职场人都可以快速了解机器学习是什么，能做什么，如何用！如果感觉文章对您有所帮助记得点赞哦~ 本文共分为四个部分第一部分、介绍关于AI的常见误区，回答机器学习是什么，可以用来做什么，怎么用；第二分部、介绍机器学习为业务赋能的6个步骤，及非专家用户的应用难点和解决方案；第三部分、通过案例介绍二分类，聚类和回归模型如何应用；第四部分、介绍机器学习模型的主要应用场景和立项模板。 一、关于AI的几个误区 1、只有那些科技公司才能应用AI技术？这一轮AI的火爆始于AlphaGo战胜李世石，随后，智慧城市，智慧生活，智慧办公和智慧医疗等概念可谓是铺天盖地，在各种媒体上能看到各种AI的高大上应用场景，如阿里的鹿班系统双十一时每秒设计8000张海报，无人驾驶汽车在部分城市指定路段上路测试，机器人索菲亚获得了沙特“公民”身份，滴滴利用AI模型预测城市不同位置用车需求，AI读片进入各大医院辅助医生判断癌症，各种报道 让一些非AI相关领域从业者感觉其过于高大上，似乎离自己很远。但笔者认为AI的价值不仅于此，各行各业其实都可以利用AI技术优化现有服务流程，提升效率。笔者结合自身理解，举一些机器学习在非互联网公司中的常见应用场景。会员智能化应用。基于历史数据对会员精准营销，挖掘用户潜在消费需求，个性化优惠券下发，流失预警，新会员转化路径个性化配置等商品智能化应用。预测未来X时间内销售量，库存量，订单量，关联销售，优化供应链，预测市场容量，新品定价，设定折扣策略和作弊检测。异常分析。订单异常分析，用户异常分析，机械故障预测，羊毛党分析，动态预警分析等。除了上述场景外，只要业务需求可以抽象成分类预测问题，数值预测问题，都可以考虑利用机器学习辅助决策。 2、使用AI技术必须掌握数学和python？DT(Data technology)时代到来，企业在互联网+的过程中积累了大量的数据，而AI技术就是帮助企业将这些数据有效利用起来的重要工具，《中国ICT人才生态白皮书》显示，到2018年底，我国人工智能人才缺口将突破100万，到2020年，这个数字将攀升到226万， 笔者认为，这个数字描述的是AI应用型人才，也就是知道如何利用AI技术优化现有业务的职场人，非人工智能从业者都会对其产生恐惧，当我提到AI一般人闹钟都会出现两幅画面，如下所示： 写代码和复杂的数学公式领AI看起来门槛高不可攀，但是为了降低建模门槛，国内外大量公司都推出了自己的组件建模平台，可以通过简单拖拽无需编写代码，而负责的数学公式被封装成算子组件，国外的亚马逊AWS，微软的AZURE，R2.ai，国内的阿里PI，第四范式的先知平台都是类似产品，现在深度学习建模过程也被封装成了组件化建模，国外的deepcognition，国内即将上线的阿里PI新版本也将支持深度学习组件化建模，联想的AI平台可以支持简单的图像分类识别。如果你感觉组件化还是麻烦，那么笔者要告诉你，现在自动化建模也是一大趋势，国外的datarobot就是其中的典型产品，只需要上传一份打好标签的csv数据，选择标签，点击开始，系统自动从数千开源模型中选择100个模型进行自动化调参训练，选出最优模型，并提易懂专业的数据和模型分析报告，指导非专家用户使用。所以不要因为惧怕写代码和数学而惧怕AI,其实他们没有必然联系，下文会介绍一些AI-机器学习的常用概念，进一步揭开AI的面纱。 3、AI相关的抽象概念太多，让人不明觉厉2018年罗胖的跨年演讲中提到了人类的一项重要能力：抽象能力，世界太复杂，为了便于理解和沟通协作，我们会将很多事物进行抽象，但是，当我们不具备对抽象概念的还原能力时，我们常会产生恐惧，敬畏或排斥的情绪，对我们这些非数据科学专业的人来说，初遇AI时就是如此，AI的底层是数学，而数学是对现实世界的高度抽象，当我们听到算法，模型，过拟合，召回率，auc，随机森林，朴素贝叶斯等高度抽象的词汇时，当我们看到几十行数学公式推导时，我们会本能的不明觉厉。举个例子，我这样介绍我的项目：“我们利用无监督学习Kmeans模型完成用户标签聚类，使用XGBOOST模型，SVM模型预测用户购买期望，进而实现精准推荐”，听完这句介绍你是什么感觉，如果一个完全没接触过机器学习的小白可能瞬间就懵逼了，原因很简单，简单一句话中包含了大量你无法理解的抽象概念，而事实可能并非如此，同样的介绍我换一种说法，“我们通过一些规则给用户打上标签，使用一套计算规则预测用户希望购买哪些商品，然后给他们做相应推荐”，是不是瞬间感觉没那么高大上了。下文尝试用简单类比对这些抽象概念进行说明，但前提是读者需要先摒弃掉那种对抽象概念的恐惧，我相信，看完本文后，当你听到这些抽象概念时可以淡然一笑，既不恐惧也不敬畏，并且理解其本质。网上有一张图，很有意思，生动的表明了不同的人对机器学习的理解： 别人眼中的机器学习先来看一些基础概念，这些概念会在后面的数据预处理，特征工程，模型调参和评估中用到，现在这里做简要类比和举例说明。 4、机器学习常用抽象概念梳理ai，机器学习和深度学习。这三个概念是包含关系，ai&gt;机器学习&gt;深度学习。我们耳熟能详的深度学习实际上是机器学习大家族中的一个分支，如下图所示，本文主要讨论传统机器学习（浅层学习）部分内容，深度学习还在学习当中，也在抽象其建模过程，感兴趣的朋友可以加好友共同学习。 监督学习和无监督学习。监督学习就是模型学习的数据需要有标签，非监督学习就是模型学习的数据无需有标签，那么什么是标签呢？举个例子，下图是心脏数据，其中ihealth特征含有两个值，1代表患有心脏病，0代表没有心脏病，当我们需要预测用户是否患有心脏病时，因为有两个结果，那就是一个二分类问题，ihealth就这个数据集的标签特征。每一列代表一个特征，每一行数据代表一个样本，进入模型的数据需要保证主键唯一，主键通常是用户的身份证号码，编号或者手机号等唯一标识。 训练集，验证集和预测集。通常情况下，会将完成特征工程和标签工程的数据拆成三份，一份训练数据，一份验证数据，一份预测数据，其比例大概可以设为数据集的60%，20%和20%。训练集用于训练模型，验证集用于验证训练集训练模型效果，通过调参逐步提高验证集上模型的预测效果，预测集用于判断模型对于新数据是否有效，是否存在过拟合。大概流程如下图所示： 欠拟合和过拟合。欠拟合是在验证集上预测的效果不好，也就是没有将我们希望分类的两组数据分开。过拟合就是在验证集上效果很好，但是预测真实数据时效果很不好，如下图所示。左一图属于欠拟合，因为并没有将目标数据按照结果标签很好的完成分类，彼此掺杂在一起；右一就是过拟合，为了把所有数据都分开，出现了一份非常复杂的曲线，因为太复杂，应用于新的数据时往往预测效果不好，当数据量很小时容易出现过拟合。 算法模型的本质。算法的本质是一个函数，我们可以将模型想象成一个盒子，这个盒子有输入和输出，还有一些可以设置数值的面板，我们把数据扔入其中，通过不断调整数值（模型参数），提升这个盒子预测结果的准确性，入下图所示： 树模型和线性模型。线性模型是为所有进入模型的特征赋予权重，并相加出来一个新的值，树模型是一个一个特征进行处理，常用的线性模型有逻辑回归，SVM，常用的树模型有XGBOOST，LIGHTGBM，随机森林和GBDT。线性模型相对来说具有更好的解释性，而且处理小数据量时效果较好，树模型做大数据量训练速度快，模型预测效果较好，可解释性不如线性模型，需要通过可视化的数据分树来对模型解释。以逻辑回归为例来简单说明线性模型，其将所有特征赋予权重后加和变换为概率，这个这个概率通常称为阈值，比如模型预测得到阈值是0.6，通过数据分布我们设定阈值大于0.5为1，小于等于0.5为0，因为数值为0.6，顾我们判定预测结果为1；以决策树为例来说明树模型，决策时类似于流程图的树形结构，树内的每个节点代表对一个特征的分类预测，树的每一叶子节点代表一个类别，为了训练决策树，我们需要使用训练数据集并找出那个属性对目标最有用。模型结果评估方法。因为二分类在应用中比较常见，我们以二分类为例来说明二分类的常用评估指标。评估二分类模型的最重要指标为auc，auc值越接近1模型的效果越好,auc为ROC曲线下的区域面积 。 精确率（precision）是精确性的度量，表示被分为正例的示例中实际为正例的比例，precision=TP/（TP+FP）召回率（recall）是覆盖面的度量，度量有多个正例被分为正例，recall=TP/(TP+FN)=TP/P=sensitive，可以看到召回率与灵敏度是一样的。正确率（accuracy）是我们最常见的评价指标，accuracy = （TP+TN）/(P+N)，这个很容易理解，就是被分对的样本数除以所有的样本数，通常来说，正确率越高，分类器越好。f1：是统计学中用来衡量二分类模型精确度的一种指标。它同时兼顾了分类模型的准确率和召回率。f1分数可以看作是模型准确率和召回率的一种加权平均，它的最大值是1，最小值是0。f1=2precisionrecall/（precision+recall）根据模型效果可以将模型分成二分类模型，多分类模型，回归模型，时间序列模型，聚类模型，推荐模型，笔者尝试通过案例一句话介绍常用模型应用场景，并附上通俗易懂的拓展阅读材料，帮助大家更深刻的理解这些模型可以如何应用。二分类：可以把预测目标抽象成两类，如预测是否患有心脏病，预测用户对某个产品是否感兴趣，可以将预测结果抽象成0和1。阿里PI平台提供了心脏病预测案例https://help.aliyun.com/knowledge_detail/34929.html多分类：可以把预测目标抽象成多个类别，如预测用户年龄段等，一般情况会将多分类问题转化成二分类处理。回归：预测某个时间点数值的模型，如预测房价，预测产品价格等。典型案例是预测波士顿房价。https://blog.csdn.net/Teresa_Xin/article/details/79204769时间序列：预测某一段时间多个数值的模型，如预测未来一周每天股票价格，预测未来一段时间最高气温。聚类：无监督学习，数据无需标签，根据设定分组数自动进行分组，通过观察分组数据特征给用户分群打标，常用于用户分群。案例青少年市场细分。http://cookdata.cn/note/view_static_note/201ad8d4a6c12768f7f79754a45e1b77/推荐模型：经典推荐模型是协同过滤，协同过滤分为两类，基于产品的协同过滤和基于用户的协同过滤。基于产品的协同过滤是用户A喜欢苹果，然后通过算法计算出其他水果与苹果的相似度，然后进行推荐给A；基于用户的协同过滤是用户A喜欢苹果，将同样喜欢苹果的用户B喜欢的额其他产品推荐给A。推荐阅读文章https://www.jianshu.com/p/e56665c54df8不同类模型的常用算法如下图所示，希望读者们再看到这些抽象模型名字后莫慌，可以思考他们处理哪类，一步步思考如何应用。 二、机器学习项目流程本章节分为两部分，第一部分介绍机器学习为业务赋能类项目的常规流程，第二部分介绍常规的建模流程。 1、机器学习为业务赋能流程1.1、商业理解明确商业问题和数据挖掘目标，需要通过与一线业务和运营人员沟通，深入理解商业问题的背景，同时对项目所需资源进行评估，这个阶段就需要明确项目商业目标和成功的评估标准。实施要点，充分沟通调研，设定适合的机器学习应用场景。常见的场景有提升用户复购，优化用户推荐，预测用户流失实施召回。本质来说商业的核心问题就是增加收入、减少流失和人员提效。注：机器学习类项目一定要与业务方或运营方深度合作，彼此参与，共同推进项目，因为业务的优化常常伴随着KPI提高，人效提高常伴随着裁员等业务担心问题，可能面对很大阻碍。1.2、数据理解根据商业痛点和目标，梳理企业内部外数据，探索建模索要的目标变量，确定建模需要的数据，确定取数口径，明确数据业务指标业务含义和指标使用规则，这个过程中算法同学需要深入介入业务中，理解各项业务指标含义，并根据业务的理解完成后续数据预处理和特征工程等操作。注：必备的内外部数据获取，需要保证许菊的一致性，完整性和准确性，数据理解阶段触目确定目标因子。1.3、数据准备将数据集合成大宽表或创建数据集市，对数据进行清洗，转换，校验数据质量，对数据进行标准化操作，需要使用科学的编码规范指导编码。该阶段需要对数据缺失值，异常值进行处理。同时需要完成特征工程，特征工程是耗费时间最多的过程，一般情况，建模中花费特征工程耗费整个项目近80%的时间。1.4、数据建模选择合适的模型算法技术，实现数据挖掘目标，通过样本选取，确定训练集，验证集和预测集数据，该阶段需要完成特征筛选，模型训练和调参，模型预测评估，是否满足目标。注：特征数据决定了模型的上限效果，模型调参只是让模型的效果趋向这个上限。二分类模型评估指标auc可以调优范围很小，优化0.01都非常困难，在一些建模比赛中可能auc差异可能只有0.00011.5、模型评估全面应用模型进行预测，判断是否实现商业目标，通过科学的A/B测试，对目标场景进行模型应用，收集反馈效果，对预测效果进行评估分析，确定其统计有效性和真实有效性，判断是否满足商业目标。1.6、模型部署将验证有效的模型应用于商业环境，并监控与维护模型，实时跟踪模型效果，验证商业目标达成情况，总结报告，积累经验。 2、常规建模流程从业务系统或日志系统进行数据提取，数据预处理，特征工程，模型训练和调优，预测和评估，如下图所示。我们还是以心脏病的数据为例，我们从系统中导出历史数据作为训练数据，因为医疗数据很多都已经有标签的，无需再次打标，后面会讲解数据没有标签如何处理。拿到数据后，第一步，进行预处理。处理缺失值和异常值问题，缺失值很容易理解，就是给那些没数据特征填一个数值，简单方法可以填充固定值（如-999），平均值，众数或中位数等，复杂的方法可以利用XXX，填充相似数据特征的缺失值。异常值是指将一些不靠谱的值提出，比如年龄数据，理论上是0-120，当年龄字段出现309时我们就需要将其调整到正常范围，简单的方法可以将其调整到上限，众数或中位数等。第二步，进行特征工程，因为算法模型本质就是数学，所以要把类别特征转换成数值，比如原始数据中性别那一列中是男，女，那么我们就需要将其变成数值0,1，其中0代表男，1代表女。one-hot特征编码也是一种常见的处理特征的方法，如一个特征包含0,1,2三个数值，那么可以一特征拆成三个，分别用0,0,1代表0，用0,1,0代表1，用户1,0,0代表2，也就是把不同的类别特征都用0和1去表示，还有很多其他方式，如结合业务规则构建特征，特征多项式交叉相乘，PCA降维等。特征工程可以说是建模过程中最耗时的部分，算法工程师实际建模工作中将会有80-90%的时间花在特征工程阶段。第三步，模型训练和调参。也就是将完成预处理和特征工程的数据接入模型，找到相对最优的模型参数，并基于训练数据训练处最优模型。第四步，模型预测和评估。使用训练好的模型跑验证数据，查看预测效果，并根据模型效果继续调参，经过更多轮循环找到最有模型参数。第五步，模型应用和效果评估。使用历史数据完成模型训练和调优后我们需要应用到真实业务中，通过A/B测试查看模型的真实效果。第六步，模型优化，随着业务拓展和环境变化，可能产生新的特征，所以模型要进行持续调优。 注：应用不同类模型特征工程方法不同，如使用线性模型需要对数据做标准化或归一化，统一不同特征量纲，而树模型则无需进行这类操作。 三、模型应用实例概述本章节通过三个典型案例介绍三类常用模型，同时介绍非专家用户应用机器学习建模的难点，同时尝试提供解决方案。现在很多同类文章都包含了大量python实现代码和数学模型分析，对于非专家用户不太友好，笔者尝试用流程介绍告知模型是如何应用，其中提到了如何进行简单的特征工程操作。 1、模型应用实例1.1、二分类模型（逻辑回归-泰坦尼克号预测生还概率）泰坦尼克号生还实验可谓是一个经典二分类预测，在kaggle平台上一直开放，截止到2019年5月2日，共有11374个队伍参加预测学习，训练数据和预测数据为泰坦尼克号上的所有乘客基础数据，训练集包含819条数据，11个特征和1个标签列，标签列告知用户是否生还，生还为1，去世了为0，预测数据包含了418条数据，11个特征，需要预测这418个人是否生还。笔者尝试使用组件化建模工具开始建模，过程如下，首先进行训练数据全表分析，查看缺失值情况，各特征的统计信息，其中cabin缺失率近80%删除该特征，年龄特征也包含一定缺失值我们选择填充年龄中位数。对数值型特征进行异常特征平滑和归一化，异常特征平滑就是将异常值填充固定值，所谓归一化就是将数值型数据归一到[0,1]中间，转换函数为:x = (x-min)/(max-min) 。对类别特征进行类别特征编码，对客舱等级，船票等级等类别特征进行onehot操作，并将处理完成后的数据分成训练集，验证集和预测集，使用逻辑回归模型，进行自动调参运算，选择最优参数后保存模型，将官方提供预测数据经过上述特征工程后接入最优模型，预测用户是否生还，得到的结果是一个概率，也称为阈值，当阈值大于0.5的则判定为1（生还），小于0.5判定为0（遇难），预测结果准确率为0.7799，结果如下图所示，结果表示再给我一条新的样本，有78%概率可以准确预测用户是生还还是遇难。 1.2、回归模型（XGBOOST-预测波士顿房价）前文中提到预测具体数值的模型可以称为回归预测，本案例也是经典回归预测案例，数据集大家可以到UCI机器学习知识库下载，波士顿房屋这些数据于1978年开始统计，共506个数据点，涵盖了麻省波士顿不同郊区房屋14种特征的信息。包含城市人均犯罪率，住在用地所占比例，城镇中非商业用地所占比例，CHAS查尔斯河虚拟变量，环保指数，没懂住在的房间数等特征，标签特征为自住房屋价格的中位数。数据预处理和特征工程与二分类相似，回归模型评估模型效果的指标有几个，SSE,MSE,RMSE,R-square，这个案例中我们通过运算决定系数R-square来量化模型的表现，决定系数是回归分析中十分常用的统计信息，经常被当作衡量模型预测能力好坏的标准。R-square数值范围从0至1，表示目标变量的预测值和实际值之间的相关程度平方的百分比。一个模型的R-square 值为0还不如直接用平均值来预测效果好；而一个R-square 值为1的模型则可以对目标变量进行完美的预测。从0至1之间的数值，则表示该模型中目标变量中有百分之多少能够用特征来解释。1.3、聚类模型（Kmeans-聚类高中生分群）聚类模型是无监督模型，我们以前文中提到青少年市场细分为例，通过对30000个美国高中生社交网络信息数据集聚类，实现用户分群聚类，按照前文中所使用的异常特征平滑，归一化，类别特征编码，onehot等步骤，完成数据预处理和特征工程，模型我们选用常用聚类模型K-means，我们选择将数据聚成5类，从结果来看我们将数据聚成了5组，如下图所示， 因为没有标签，我们需要查看每一个聚类中心的变量取值从大到小进行排序。 通过观察每个聚类前10个变量来分析聚类所代表的群体，所以我们需要通过分析聚类结果来确定分群用户有哪些类似爱好和特点。通常情况下用户分群可以基于规则认为设定，而聚类模型的聚类特征可以作为分类模型和回归模型的特征接入模型。举例来说，当我们要基于用户活跃度指标进行用户分群时，我们可以考虑将所有跟活跃相关的特征作为训练特征，然后设定分群数，通过聚类模型完成分群后分析分群数据特征，进而实现用户打标。 2、非专家用户的门槛在哪里2.1、不会写代码。写代码可以说是很多非程序员眼中巨大的门槛，其实python相比于大学时普遍学习的C或java简单很多，大量的服务和实现已经封装成包，通过import引用即可应用，现在很多小学都开始普及编程，很多少儿编程辅导机构可以让孩子快速使用python完成深度学习，甚至实现玩具汽车的无人驾驶。而且前文中提到，大量的可视化建模工具和自动化建模工具出现，这将极大降低AI技术应用的门槛，其实从前文中的建模流程不难看出，算法工程师也需要先熟悉业务才能开始建模，这部分来看，如果有工具可以解决建模过程那么业务人员对业务的理解将更加深刻。所以还是建议对这方面感兴趣的同学可以打破心理枷锁，咬牙学一下python，前10个小时可能很痛苦，但是掌握了后续就非常简单了。注：并不是算法同学不重要，真正高级的建模一定是结合业务理解和统计学知识的特征构建，而不是简单聚合和转换，组件化和自动学习可以让企业快速应用模型，实现一定程度的提升，但是进一步的模型优化一定需要专业经验的算法同学介入。2.2、不会调参。模型有很多参数，如树模型的树的棵树，树的最大深度，学习率，随机种子等，非数据学相关专业的同学看到可能直接懵逼，但是现在主流的建模平台都提供了自动调参功能，自动学习工具甚至提供了根据上游数据结构进行自动调参，所以这部分不用恐惧，跟着样例做几次就知道了。2.3、不会做特征工程。所谓特征工程是将特征日志或多系统数据“拍平”成模型可用的特征，并对特征进行各种变化拓展，通常算法工程师会将几个业务特征拓展成几百个特征，下面笔者简单介绍一下特征如何“拍平”和拓展。日志数据和业务数据通常是根据时间维度，多个主键列表，如电商订单数据，用户A可能有几十条购买订单记录，建模的预测是对单个主键进行预测，所以需要将多条订单“拍平”，也就是用户A的手机号或者系统ID合成一条记录，那么多条记录如何合并呢？这就是设计到特征拓展，比如可以设定一个时间段内用户A的订单数，购买总金额，购买A产品的数量，购买B产品的数量，单笔订单最大支付金额，单笔订单最小支付金额，订单平均间隔，订单最大间隔等，将单挑记录通过最小，最大，平均等维度拍平后，需要对类别特征变换，常用的特征工程方法有类别特征编码，onehot，离散化等操作。类别特征编码是指将业务类别特征变成数值，如使用优惠券满减，直降和未使用可以标记为0,1,2；onehot编码是将类别特征变成使用0和1表示的特征，如将上述优惠券一个特征变成了0，0，1和0,1,0，和1,0,0三个特征；离散化是指将连续的特征变成类别特征，如对年龄分段，0-10岁定为0,11-20定为1，以此类推，就可以对年龄特征变成一个类别特征，然后再做onebot。注：数据拍平对于非专家用户很难处理，但是我参与的项目已经找到了解决方案，可以将多张表根据关联关系和数据类型自动化拍平成为模型可用特征，相信其他平台也会提供这项服务，笔者认为，这是制约非专家用户应用机器学习模型的一大门槛，和下文中提到的标签工程类似。2.4、不会做标签工程。前文中提到的心脏病预测，泰坦尼克号生还预测，房价预测都是自带标签，但很多时候，数据中没有办法直接拥有这种分类或者数值属性的标签，通常使用滑窗法制作标签，如下图所示，我们要预测7月份用户是否有购买商品A的欲望，我们可以使用2,3,4月三个月的数据作为训练数据，5月的数据作为标签数据制作训练集，因为5月份我们知道用户是否购买了A产品，然后再用3,4,5三个月的数据作为训练数据，通过6月份用户是否购买A产品作为标签，这样我们可以用历史数据完成模型训练，然后应用于对用户7月份是否购买某商品的预测。 四、AI项目立项模板1、商业痛点分析及目标分解如前文所述，在启动AI项目之前，要梳理商业逻辑，分析现有的痛点，将痛点拆解为目标，模型围绕目标去构建。常见的目标有提升营销效率，实现精准化营销，减少用户干扰，减少用户流失，提升转化率，提升ROI等。笔者发现所有的AI项目都会涉及到用户或客户画像，因为构建模型的特征一版包含三部分，一部分是用户的静态信息，一部分是用户的行为和交易信息，一部分是用户应用的场景信息，而用户的景泰信息和一些行为信息都可以抽象为用户画像，所以很多AI项目的目标还包括为用户或客户构建画像，便于产品和运营方更加理解自己的服务对象。 2、项目架构利用机器学习的项目架构类似，大家可以参考CDP系统项架构来完成项目的整体架构设计，笔者简单结合自己的理解简单搭建一个项目架构作为参考。 3、技术架构笔者与工程同学和算法同学沟通，了解到一些建模平台的底层技术，构架如下图所示，图中，Hadoop实现了一个分布式文件系统（Hadoop Distributed File System），简称HDFS。Hadoop实质上更多是一个分布式数据基础设施: 它将巨大的数据集分派到一个由普通计算机组成的集群中的多个节点进行存储，意味着您不需要购买和维护昂贵的服务器硬件。Apache Hadoop YARN （Yet Another Resource Negotiator，另一种资源协调者）是一种新的 Hadoop 资源管理器，它是一个通用资源管理系统，可为上层应用提供统一的资源管理和调度，Spark，是一个专门用来对分布式存储的大数据进行处理的工具，它并不会进行分布式数据的存储。Hbase是Hadoop database，即Hadoop数据库。它是一个适合于非结构化数据存储的数据库，HBase基于列的而不是基于行的模式。Hive基于数据仓库，提供静态数据的动态查询。其使用类SQL语言，底层经过编译转为MapReduce程序，在Hadoop上运行，数据存储在HDFS上。 4、项目规划通常来说机器学习类项目一期多为构建用户画像，二期结合画像和用户标签体系构建模型，设计试运行策略，根据实际效果对模型进行调优。可以根据不同的业务痛点构建多个模型，逐步构建起一整套模型体系，辅助决策。 5、应用场景结合具体应用场景，描述如何将模型嵌入到现有业务流程当中。 6、模型效果评估方法模型的实际效果可以通过A/B测试进行验证，选择两组用户，一组保持原有运营或产品策略，一组使用机器学习模型推荐策略，通过一个业务周期的观察，对比两组用户的效果评估指标变化。 因为部分内容涉及公司业务，不便于举例说明，文中多数案例均为初学者常见案例，大家可以搜索到相关内容，本文仅将笔者近一年的收获和思考进行梳理总结，希望对各位读者有所帮助。笔者还在学习深度学习，NLP，推荐系统等相关AI知识，AI产品经理当下来看属于产品经理全新的一个细分门类，希望可以与同行们多多交流学习~文章转载自田宇洲文章链接为https://coffee.pmcaff.com/articl","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品经理养成计划","slug":"产品方法/产品经理养成计划","date":"2019-07-06T10:33:46.000Z","updated":"2019-07-06T12:03:15.534Z","comments":true,"path":"undefined/产品方法/产品经理养成计划/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品经理养成计划/","excerpt":"","text":"资料来源：冯驰师兄 说到产品经理的养成计划，大家可能都会有些迷茫，这里给大家指一条“明路”~首先，建立产品感~1.打开Applestore或者应用商店，把排行榜top100全部下载下来，花一周的时间全部熟悉一遍，目的是包罗万象，O(∩_∩)O哈哈~然后找到自己最有感觉并且感兴趣的一个分类。2.把感兴趣的分类top20安装完毕，每天两款，细细的体验流程，感受没一个个步骤和细节设置背后的原因，是否合理？可以怎么做的更好？（这些在我看来最重要的是思考，形成只要使用产品就能知道这个地方为什么这么做，或者说这么做哪里不好）。3.尝试把你发现的问题和你认为下一个版本需要改进的地方写下来，等版本更新之后去验证！第二，正儿八经的学习~1.看书，《结网》《简约至上》《人人都是产品经理》，我认为这个阶段看书主要是要接产品经理的职能。具体是谁？具体是干什么的？他的工作流程是什么？你会在脑子里形成概念。2.听线上技能课程，这网站很多，不列举。目的是学技能。Axure、Visio、mind***，这些还是有必要会的。重点学习axure课程。3.练习，选择一个相对简单的线上产品，用axure画出来，这些case对学过Java来说小问题啦~4.如果自己有一个产品的想法，用axure画出来，你会知道你对产品的业务流程的了解状况，也会发现产品真的不是凭空想出来那么简单的~第三，思考和表达：1.当你基本具有一定产品的素质之后，你就可以重点研究某一个行业的产品，然后写出产品分析文档了，虽然写的东西在大牛看来很浅，但是真的是对思维逻辑和产品逻辑最有用的。2.找人交流，找到相同兴趣的人交流都一款产品可以改进的地方，梳理自己的想法，要知道很多东西想到和说出来完全不一样哦~最好在整理成内容发布出来哦！3.尝试写一篇新的或者正式的产品分析文档发到人人都是产品经理社区~看一看评价和反响。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"半路子出家的产品经理，如何做项目管理","slug":"产品方法/半路子出家的产品经理，如何做项目管理","date":"2019-07-06T10:33:04.000Z","updated":"2019-07-06T12:03:15.534Z","comments":true,"path":"undefined/产品方法/半路子出家的产品经理，如何做项目管理/","link":"","permalink":"http://yoursite.com/undefined/产品方法/半路子出家的产品经理，如何做项目管理/","excerpt":"","text":"如果说做产品经理要抗压强，把坑挖深，填起来才更完美（对结果负责）。那么做项目管理就要心态好，把锅擦亮，背起来才更漂亮（对过程负责）！ 作为一个产品经理，需要懂项目管理吗？这估计是很多产品经理比较困惑的问题。 比如项目管理到底怎么管理？如何修订不合理的项目目标？如何处理项目中的突发问题？如何处理用户强烈坚持需要的需求？如何处理来自用户的需求变更？如何调动团队积极性？如何面对项目工期延误？如何按预期的项目计划交付产品？ 产品经理作为产品的负责人，必须要懂项目管理。它是产品经理在进阶路上，必须要掌握项目管理、产品运营和数据分析的三门技能之一。 项目管理就是在产品生命周期中，通过运用管理的知识、技能、工具和方法，来解决项目问题和完成项目需求的过程。即从项目的决策开始到项目的交付结束的全过程，进行计划、组织、指挥、协调、控制和评价，以实现项目的目标。 在传统项目管理过程中，我们需要协调时间、成本、质量三个关键元素，并在三者之间寻找到一个合适的平衡点，以便更好的推进项目。 但在敏捷项目管理过程中，我们需要考虑价值、质量、约束三个限制元素。团队一般采用敏捷开发的形式，实现版本快速迭代，侧重点会放在可发布的产品上。 在人力资源有限的初创公司，或没有专门项目经理的团队，一般都是产品经理兼做项目管理，但管理上一般都是不规范，或不清楚每个阶段是如何做项目管理的。 针对这种情况，我从项目管理的五个过程：启动、计划、实施、执行和收尾，给半路子出家的产品经理，说一下项目管理过程中的工作内容和流程规范。 启动过程 启动过程就是一个新项目核准与开始的过程。启动过程要做的工作是对项目目标、项目干系人和项目立项进行可行性研究与分析。重视项目启动过程，是保证项目成功的首要步骤。 项目目标就是实施项目所要达到的期望结果。以定位战略目标为核心，以实现商业利润为重点，并提供行之有效的评估方法。简单的说，项目目标就是了解真实的需求，解决核心的问题。 项目目标的标准要遵循SMART原则，即Specific(具体的)、Measurable(可衡量的)、 Attainable(可实现的)、Relevant(相关的)、Time-based(有时限的)。 项目干系人是参与该项目工作的个体和组织，也泛指利益相关者，其行为影响项目的计划与实施。 干系人分析就是系统地收集和分析相关信息，借助权力利益方格模型，去识别出干系人的利益、期望和影响，并把它们与项目的目标联系起来。分析过程主要包括识别关键干系人、分类关键干系人、设计干系人映射图。 项目立项指成立项目，执行实施。申请项目的立项时，一般会输出《项目立项决议》、《项目立项报告》、《项目立项效用情况说明》等文档，其中《项目立项决议》是立项必备文档。 比如我之前负责某跨境电商平台的《项目立项决议》，就包括项目背景、项目目标、项目里程碑和任命负责人。 计划过程 计划过程主要是确定和细化目标，并为实现项目目标和解决项目问题，而规划行动路线。 计划过程包括：建立WBS计划、确认项目流程、确认项目计划、评审计划、批准项目计划等。 在计划过程管理中，我们一般会对项目范围、任务分解、资源分析、成本预算、风险评估等，制定一个科学的项目计划。使团队的工作有序的开展，使项目的资源有效的配置，使时间的节点合理的分配。 实施过程 实施过程主要是选择方案，确定范围，协调团队与其他资源，并对工作进行分解。在具体实施过程中，工作内容侧重于范围管理、时间管理、沟通管理、进度管理。 范围管理就是要明确项目范围，明确项目实施，明确项目组成员的工作责任，并分解项目范围。一般借助工作分解结构（Work Breakdown Structure），把项目按阶段或结果分解成较小的项目任务包，主要是便于管理。 以PMLink产品经理社区线下沙龙为例：在确定线下沙龙的计划和内容后，我会借助工作分解结构方式，把活动分解成任务，任务再分解成具体的工作子集。从而将活动范围缩小、并降低任务完成的要求。 时间管理就是确保项目按期完成。在项目跟踪过程中，我们要懂得协调资源，实时了解项目完成情况，并在对应的时间节点制定项目里程碑。 沟通管理对项目经理而言，是非常重要的。所有的项目管理过程中都是围绕沟通而展开的。沟通可以将复杂的问题简单化，并及时获取反馈。 对团队而言，可行性评审例会、进度评审例会、每日站立会、迭代总结例会和需求评审会都是有效的沟通方式。 进度管理需要调整进度计划，压缩关键路径，及时提交项目进展信息，以邮件报告的形式定期汇报项目进度。当进度偏差比较大时，需要针对出现的偏差，寻求最佳解决方案。 以公众号网友反馈的问题为例，他说：“项目某成员因为不熟悉字段传输规则，让项目延期了两天，之后又出现了返工的情况。” 作为项目负责人，项目成员不熟悉字段传输，一方面是他没有理解需求，还是你没有讲清楚需求；另一方面若他能力欠缺，为何不资源协调或换人。项目延期为何没有项目进度管控？若因客户需求变更导致的，可以事先请客户了解变更对项目的真实影响；若因计划排期不合理或资源不足导致的，可以对项目风险日志进行全程跟踪。 执行过程 执行过程是项目管理中最为重要的环节，它可以使实际进展符合计划，也可以使项目进展朝向目标方向。在执行过程中，工作内容侧重于变更管理、质量管理和风险管理。 变更管理就是控制需求变更，尤其是项目范围的变更。它包括变更的提出、受理、评估、审核、实施、测试、回顾和汇报等。 质量管理需要制订质量计划，并运用相关工具确保质量计划的实施。在质量控制的过程中，有许多质量保证工具与方法，如帕累托分析、统计抽样和标 准差等。 风险管理就是在项目进行过程中，有效避免风险的发生，且能在风险发生时，有行之有效的应对策略。一般采用头脑风暴法、经验法则等方法识别风险因子，并制作一套项目风险防范体系。 收尾过程收尾过程就是完结所有项目过程。在收尾过程中，主要工作包括对最终产品进行验收，验证产品功能是否符合预期，并把验收结果形成项目文档，记录经验教训，并组织项目复盘等。 在敏捷开发和版本迭代中，做项目管理的根本目的是提升团队工作效率。在项目管理过程中，我们可以借助Scrumworks、腾讯TAPD、Project、Worktile、EVM、看板、甘特图等项目管理工具。 做项目管理，既要会管项目，也要管理人。对于产品经理而言，项目管理其实就是项目推进，核心就是沟通管理，它是项目顺利进行和按时上线的关键因素。 做好项目管理，需具备项目管理能力和经验。比如熟悉项目管理方法，能及时有效地解决项目突发问题，并对业务提出合理的优化建议。 对于半路子出家的产品经理，不能纯粹靠考PMP给自己镀金，一定要让自己保持一个持续学习的状态。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品经理三大文档","slug":"产品方法/产品经理三大文档","date":"2019-07-06T10:30:35.000Z","updated":"2019-07-06T12:03:15.535Z","comments":true,"path":"undefined/产品方法/产品经理三大文档/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品经理三大文档/","excerpt":"","text":"做产品经理总会听到三个文档。可这三大文档到底是做什么的呢？它们的目的有什么呢？你真的能搞得清楚吗？即时你每天工作中都在写其中一个文档，可你真的了解这个文档吗？按照模板写的文档真的有用吗？会有什么弊端？这篇文章来娓娓道来，带你领略三大文档的真正魅力。 三大文档是什么？BRD(Business requirement document)商业需求文档MRD(Market Requirement Document)市场需求文档PRD(Product requirement document)产品需求文档 一、BRD商业需求文档 针对对象/目的文档都是针对某特定目标对象，趋于某种目的而写的。BRD从英文字面看，它侧重在Business，更多的是商业目的。例如，公司向投资人展现自己公司愿景，得到更多的融资；向公司CEO 和COO展示，分析产品的swot，得到更多战略支持；向运营人员，营销人员展示，让他们了解公司产品，宣传推广产品，技术只是制作，产品真正使用，发展，推广和宣传还是要靠运营和营销人员；还有向技术总监CTO汇报，得到更多技术支持，产品经理再强大也得有人员支持干活。强调一点，跟领导汇报，用PPT图文交互展示，更容易打动他们。 文档结构打电话时，第一句都会说:你好，我是**，…文档这是这样，先介绍自己，包括产品定义，产品新奇点，创意点在哪；然后分析现在市场是什么情况，市场规模，展现产品的潜在愿景。分析其他已有类似产品的竞争优势。再展现产品商业模式，就是能给公司带来多少利润。以上是对产品的张望。有了美好铺垫，后面的终极目的就会更容易达成。规划产品进度，告诉领导我们有备而来，但是我们需要的人员资源、物资资源来支持，希望你们给予。 BRD导图 二、MRD市场需求文档 目的市场需求文档，相比较BRD目的就比较单纯些，主要是针对产品的功能和特点的描述，展示产品如何根据这些优势成功取得成功。 文档结构产品名称，这个万年不变的规则，再继续的是老生常谈的产品需求名称和版本历史。重要的部分是对当前市场、用户和竞品的分析，告诉阅读者，当前我们的产品处在什么情况下，我们会遇到什么风险，我们的前景是怎样的。最后详细阐述我们的产品细节，会怎么面临这些风险，怎么规划与实现。 MRD导图 三、PRD产品需求文档 目的PRD是现在产品经理最熟悉的文档，相较前两个文档，PRD几乎入行必备技能。在岗的产品经理更是对他爱恨交织。为什么呢？因为这是个给自己挖坑的事儿。产品需求文档，顾名思义是对产品定位，对需求说明的文档，可产品经理又是对产品实行的实施者。也就是说，要自己写个规则，自己首先遵守，不能随便修改需求。不能头脑一热冒出一想法就要技术去实现，技术人员的代码不是草原上的马说掉头就掉头。PRD是对产品的详细描述，是产品的文字格式。除了要求产品经理前期对产品深思熟虑，也是想公司领导叙述产品，让新加入团队的人员了解产品的媒介，更是为测试人员写测试用的靶向目标。最重要是一点是，也是你入职下个公司的敲门砖。你的文案能力强不强就看文档的编写，文字表达能力。 文档结构文档名称和版本历史这是文案的常规必备结构。之后介绍产品的整体概况，全局的说明。重点描写产品的结构和详细的各个功能说明。另外文档还会要写产品实现需要的物资（包括人员、物资、财力等方面），这可能会涉及到被要求提供更详细的支持文档，文档后要附上相关的文档附件。钱人物不是随便提供的，要求详细说明用在哪，打算怎么用，使用支出回报率等等。每个公司对产品的需求文档都是不同的，不是导图里的每项都要写，但从0到1的产品基本都要详细描写。另外强调一点，PRD要有目录，方便不同的阅读者更快找到自己想要的内容。而前两个文档更多的是汇报使用，更多使用PPT格式展示。 PRD导图 本文引用来源于简书作者：JERRYluan链接：https://www.jianshu.com/p/9d21aaf29492","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品经理三大报告","slug":"产品方法/产品经理三大报告","date":"2019-07-06T10:29:52.000Z","updated":"2019-07-06T12:03:15.535Z","comments":true,"path":"undefined/产品方法/产品经理三大报告/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品经理三大报告/","excerpt":"","text":"产品经理就是和各种文稿，文档，报告，ppt打交道的岗位。接下来来介绍下产品经理要掌握的三大报告。产品市场调研报告、竞品分析报告、产品体验报告。这个三个是针对不同的问题、为达到不同的目的要给不同的阅读者看的。第一个产品市场调研报告，给刚入行业的创业者或者投资人熟悉了解行业情况的报告。第二个竞品分析报告，针对自己品牌产品，分析与自己产品有竞争关系，或潜在竞争关系的产品的报告，阅读者就很广，从公司领导，到ue、ui、运营都会阅读。第三个是产品体验报告，对某个产品更深层次的探索、挖掘，来提升优化自由产品。阅读者包括产品经理、ue、ui。产品体验报告是竖向深入挖掘分析行业的最优产品，竞品分析报告是横向广面的分析行业内的相关产品。 产品经理要掌握的三大报告 一、产品市场调研报告运用互联网思维来对行业做详细解析。报告要包括分析市场情况、该行业的用户规模、盈利模式、增长态势、列举行业内典型的产品，并对这个产品的公司情况、业务情况、硬性情况、增长趋势、产品的swto和产品间的关系分析。根据上述分析，找到该行业的新机会，分析这个机会会有的风险情况。 市场调研报告 二、竞品分析报告竞品分析报告，产品经理最经常打交道的报告。有时不是报告的形式出现在面前。这个着重说写如何写竞品分析吧。内容不可少的要有铺垫，市场趋势，行业现状这些内容。再对产品的抽象元素定位、趋势、盈利模式、目标用户进行分析。这些数据从行业的报告中都可以找到。也可以针对，身边人对该产品的评价给出自己的看法定位。抽象分析后，就是具象的进行功能、交互设计、视觉界面分析。真正全面的竞品分析，还要分析产品的运营策略，产品优劣势。最后给出产品总结，产品哪值得学习、借鉴，哪里需要避免。如何优化、更新自己产品。 竞品分析报告 三、产品体验报告产品体验报告是对某产品的竖向的深入细节分析。细致到体验的环境中的机型、系统、网络及版本，所面临的市场、行业状况分析。重要的是，从产品体验五要素，战略层、范围层、架构层、结构层和表现层具象分析。战略层是抽象的估算推断产品的定位、用户画像和盈利模式。范围层是概要产品的基本功能和特色功能——就是产品是干啥用的。结构层是细化到产品的每个功能——产品里都有啥。架构层分析产品的每个界面见的交互——产品和用户间怎么互动的。表现层分析产品的每个界面——产品怎么表现自己的。最后，根据上述分析，给出自己的想法建议。这个建议可以从五要素的任何角度或者全部提出，你认为产品怎么更优，更便利，更容易获利等等，任何的建议。 产品体验报告 本文引用来源于简书作者：JERRYluan链接：https://www.jianshu.com/p/9d54851e1c27","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"软硬产品如何设计","slug":"产品方法/软硬产品如何设计","date":"2019-07-06T10:28:57.000Z","updated":"2019-07-06T12:03:15.536Z","comments":true,"path":"undefined/产品方法/软硬产品如何设计/","link":"","permalink":"http://yoursite.com/undefined/产品方法/软硬产品如何设计/","excerpt":"","text":"前言硬件设备的寿命一般都超过了消费电子产品，手机可能2-3年内就会大量更换，但是硬件设备的寿命可能5年甚至更长时间。我就见到过一个客户用着我们5年前的产品，甚至还有7年前用的扫描仪。尽管传统的硬件产品数量或热门程度虽不及智能硬件火爆，但一样值得关注。传统硬件更多是B端或者行业专用产品，智能硬件更多是C端。 一、市场调研与需求管理市场调研和需求管理是在软硬件产品设计之前需要完成的，这部分工作需要产品经理、市场和销售团队共同完成，可以是产品经理独自或者主导。开完需求评审会之后，由产品经理产出需求文档给硬件团队和软件团队。如果新产品是原有产品的延续，那么通过销售、客户、技术支持、售后的反馈就能够获取到足够多的需求，但这时候也不要忽视对竞争对手的关注。如果是要做一个从0-1的产品，市场调研将会特别重要，这直接决定产品的成与败。 二、产品开发流程–硬件部分硬件部分包含id设计，模具设计，结构设计，电子设计，固件设计，手板制作及验证，小批量试产，批量生产等环节。一般来说，硬件团队都是公司现有的，不会轻易重组。这一点跟软件不一样，软件可能会牵涉到团队打散重建。 ID设计由于我负责的并非是0-1的产品，故不存在完全重新设计ID。我负责的阅读器是非常成熟的产品，市面上可见得阅读器外观功能结构都大同小异，这一点一方面是行业发展需要，一方面是大家相互借鉴。故对ID设计只输出若干参数，比如大致尺寸要求（宽度、高度、深度），必要的部件或组件（比如采集图像窗口、挡板等等）。然后提供竞争对手产品图，并讲解现有产品和竞争对手使用或设计点，帮助设计师理解。最终设计师会产出几种不同类型的ID进行评审。 结构设计和电子设计这两部分的结合是非常密切的，做结构设计时要给电子器件留有足够的空间，并且要考虑到整体硬件，电子器件的组装拆卸维修。在这个环节中，结构设计工程师要与电子设计工程师密切沟通。电子设计特制一些电子器件的选型PCB，电路设计这部分，相对的固件设计是另外一些人来做。电子设计涵盖了电源设计，通讯接口设计（蓝牙，usb，wifi，wlan）及后续的PCBA。电子设计师需要对工厂打样回来的PCBA进行测试和验证。在我们公司，结构设计师和电子设计师在一个团队中，他们会频繁地沟通以确能够产出合格产品。 固件设计固件设计可能是最早开始工作的团队之一，他们承担着硬件程序开发(即固件），并且为应用层提供相关的DLL接口以便应用层能够调用到相关的模块。此外，他们还要负责部分电子器件的选项。需要某些功能可能只有特定的一些组件，常见的比如大量开发版可能只支持几个不同类型的摄像头，那么可选范围就非常窄。经过功能验证之后，他们需要考虑硬件方案。对于智能硬件或者硬件厂商，通常有两种做法，一种是购买现成的核心板后设计周边模块，一种是只购买芯片自行设计核心板和周边模块。对于硬件团队能力雄厚的可能采用方案二，对于普通的硬件团队采用方案一更为合适，因为初创团队不见得有那么充足的资金和时间完成所有事情。这样的好处是短平快。这个阶段的产物是固件和模块形态，最终与结构电子设计师共同确认。现在市面上有很多开发板，比如RK3288开发板、智能音响开发板。固件设计团队在早期功能验证时可以直接使用现成的开发板。待功能验证过后，再与电子设计团队制作核心板。 模具设计和试模模具设计可以和手板制作同步进行（一般开模需要2个月左右的时间）。我们目前还是采用标准的模具设计方式，模具设计完成之后会进行试模，试模的目的是初步确认模具本身是否有问题。试模常遇到的问题： 脱模困难 缩水 模具刮伤产品 气泡 塑件翘曲和变形 这些问题仅适用于注塑模具 手板制作验证结构设计完成之后，就可以手板制作。其实现在可以通过3D打印的方式去制作手板，但是目前我负责的这个硬件还是通过加工完成的。手板必须要按照真实产品进行制作，包括外观、颜色、材质。一般一周到2周就能完成手板的制作。手板完成之后安装相关的电子器件，最终交付给软件团队进行软硬件联调。手板验证可以分为3个步骤： 外观、结构等确认，产品经理负责组织会议确认 软硬件联调 内部及种子客户试用 对于一个新研发的硬件产品，越早进行内部和种子客户测试越好，如果能够及早发现硬件存在的问题，那么将节省大量的时间、物力和财力。 小批量试产试产的目标主要有下列几个： 验证模具，在试产中可能存在模具损坏的问题（需要及时修复），如果模具本身有一定问题，可以小范围更改。如果改动较大，不仅需要支付费用，还耽误时间 生产流程和工艺。由于工人对新产品的生产工艺和生产路程不熟悉，需要对产线工人进行相关培训，并且通过试产的方式帮助他们掌握相关流程和工艺。这个阶段需要生产负责人（比如生产经理）撰写相关的说明文档和操作流程 质检和复检 其它测评，比如跌落试验、震荡试验等等，模拟运输途中的各种测试；相关认证，比如过3C认证、公安部产品验证、FCC等等 电子器件备货 试产的数量不宜太多或过少，一般可以设定50、100个。数量太少，内部测试都不够用；数量太多，如果有问题，则会导致浪费。故设定在50或100。 批量生产产品进入批量生产时，说明产品本身已经没有问题，生产的各个环节都已经非常明了，故可以正式生产。这个阶段主要是帮助公司掌握大致的生产周期，比如从下单生产到备料完成、到入库的所有时长。批量生产之后多数情况下是没有大问题的，但是也有例外。比如我负责的这个产品在生产了2个批次之后，发现了使用上的遗憾（缺陷）。在前代产品中我们发现了光线会干扰到图像采集，为此增加了遮光罩的长度使其超过了整个采集区域。但是在某个大客户反馈，这个遮光罩影响操作且遮光罩的边缘内存有一定的锋利度，导致会划伤操作人员的皮肤。为此重新修改了整个遮光罩的设计（缩短、并且做成可以拆卸式的），但是付出了不小的代价（半年内都没有生成该类产品，后续的畅销导致了断货，最终让竞争对手占据了一些份额） 三、产品开发–软件部分软件部分是整个产品中最为灵活的，但是由于硬件的寿命过于长，导致软件必须做到向下兼容，这也导致了SDK体积越来越庞大。随着新需求不断加入，软件开发的难度相对而言也越来越大，幸好公司有非常厉害的研发人员，才力保软件尽可能的灵活以适应新细分市场、新客户的需求。软件部分就跟大部分的传统软件产品经理（有别与互联网产品经理）差不多了，对于一个存在多年的产品，产品经理日常工作中更多的是收集客户、销售反馈的需要（通用的和定制化的）和问题。在进行行业调研、分析的同时，支持协助销售进入一些细分市场领域，并为细分领域定制相关的软件或硬件。硬件无法变动，那么能够定制的也就是只有软件。绝大部分定制的都是根据对方的API接口进行封装，以适应对方的调用。少数情况下需要我方根据客户的定制化需求，制作相关的软件（比如托盘程序）。由于公司产品是以SDK的方式提供给下游的集成商进行集成，故软件部分特制SDK的开发。一般公司都会分为应用开发（SDK）、核心、算法引擎3部分，如果硬件产品本身没有造成核心功能的变动，那么只需要应用开发层做好设备挂接即可。如果牵涉到核心，那么需要核心做好适配后再提供给应用开发团队进行挂接。整体而言，软件部分的挂接在手板做好后正式进入开发。前期主要是配合固件团队做一些工作，并提前做好软硬件的对接工作。待软件部分完成之后，需要将软硬件都提供给测试团队进行测试，确认无误后再公司内部和种子客户中进行测试。 四、产品营销和销售产品正式上市或者销售之前，需要对销售渠道进行预热。预热的时候需要有产品介绍、产品彩页、宣传视频等等。这些工作都需要有一定的事情，比如我曾经协助市场经理做一个产品宣传视频，前前后后改了5版，从前期准备到最后完工，用时近2月。因此在试产之后并确定需要进行批量生产后，就要马上进入到此环节。针对营销和推广部门，不仅需要提供产品照片、产品使用手册等素材便于他们制作产品彩页、宣传册、视频，还需要将产品的卖点、针对的行业告知营销和推广部门，以便他们针对性的线上或者线下推广（比如参加展会）。在宣传册、视频等制作阶段，产品经理要及时与相关工作负责人沟通，避免出现牛头不对马嘴的现象。针对销售部门，同样告知产品的特点、针对的行业、产品卖点，并对他们培训产品的使用。如果可以，产品经理可以和销售人员一块制定整理产品的销售方案（比如行业解决方案），并且随同销售人员一块前往种子客户、潜在客户处做好产品推介。 五、技术支持和售后智能硬件产品不会单独设立技术支持团队（一般技术支持的也少），往往售后承担了技术支持的工作。由于我负责的是B端产品，且以SDK的方式提供给客户。故技术支持和售后团队是分开的，技术支持主要是协助客户完成SDK挂接，售后团队主要对硬件进行维护/维修。如果技术支持团队不向产品经理汇报工作，那么建议产品经理定期与技术支持团队沟通，以掌握客户在集成、使用过程中遇到的问题或需求。针对售后团队，需要做的工作有（主要由硬件部门进行培训和指导）： 硬件团队（比如电子设计、结构设计）需要向售后团队提供交底书 硬件团队针对售后团队提供培训，并提供指导手册和相关视频 针对硬件中的关键部件、易损部件，硬件团队要指导售后团队完成硬件的维修 软件团队要给售后团队提供相应的软件支持，比如设备检测软件等等 售后团队能够掌握到硬件产品存在的问题，需要定期关注，比如按月与售后团队了解产品维修、维护情况（如果是新产品，可以先按周、半月，生产5-6批次之后，可以改为月）。 对于产品质量问题，需要产经理协助相关团队完成质量改进 如果是易耗品，那么需要考虑备货（各地的客服中心均需有一定量的备货） 对于产品缺陷问题，则需要考虑怎么弥补修复。对于普通缺陷，一般尽可能通过软件解决，其次通过其它硬件解决（采用工程方法来解决），最终在下一版产品中彻底解决掉。对于严重的缺陷，可能需要从根上解决，无论花多大代价（这也是为什么要尽早让种子客户使用的缘故） 针对技术支持团队（产品经理或软件团队）： 培训产品的使用（硬件和配套软件的操作） 介绍硬件产品各系别的功能差异 培训新产品相关的SDK …… 技术支持和售后部分是产品用户体验两个非常明显的点，产品经理要时刻关注这两点，避免这两点造成产品体验性不好。 产品升级如果该产品能够持续不断的盈利（增长的），那么该产品还是有可能进入到升级阶段。一般来说，伴随着市场的细分、市场环境的变化、竞争对手产品更新，势必要对产品进行更新以获取对竞争对手的优势或更好满足不同市场的需求。这样就该进入一轮新的循环。新产品升级时务必要总结当前硬件存在的缺陷，避免重蹈覆辙。 六、后记对于B端产品，除了上述要做的事情外，还需要注意点–用户体验性。与互联网产品不一样，B端产品的用户体验性要远复杂。如果互联网产品的用户体验性是几个点，那么B短产品就是一个面。B端产品的用户体验包括但不限于： 软件部分的用户体验 硬件部分的人机设计 产品借用、购买体验（包含了商务、财务、销售） SDK挂接（技术支持） 售后（售后） 需求或定制化 客服 生产部门 …… 重点：B端产品的用户体验绝不是某个、某几个部门的事情，是公司全体部门的事情，只有各个部门都以客户为中心，才能将产品的用户体验做到极致。下面是一个甘特图，该甘特图只是用于展示各团队的进入产品开发的先后关系，长度不代表所需时间。0-1的产品，市场调研在所有阶段之前。1-n的产品，在新产品诞生之后就一直需要持续不断地做市场调研并且整理需求。 文章转载自wweiru链接地址为：https://coffee.p","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品分析方法论","slug":"产品方法/产品分析方法论","date":"2019-07-06T10:25:08.000Z","updated":"2019-07-06T12:03:15.537Z","comments":true,"path":"undefined/产品方法/产品分析方法论/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品分析方法论/","excerpt":"","text":"简介本方法论源自孔师兄的分享资料，我自己做了整理之后进行文章的编写介绍。通过此方法论模板，使用者可以对产品全生命周期进行一个多维度全方面的分析，帮助使用者理清思路发散思维，科学规范的进行产品分析。 使用场景产品从0-1的分析以及产品迭代规划：包括产品原始需求的收集、干系人管理、目标用户分析、竞品分析（竞品收集、竞品选择）、功能分析（竞品功能拆解、竞品功能整合）、情景罗列+情景描述、功能列表以及产品迭代规划。 第一章 原始需求原始需求：未经加工处理的下单方的需求或要求 制作目的：如实记录下单方的需求及对产品设计的要求 制作步骤： 沟通：与下单方多次需求沟通，如实体现在模板中 记录：记录下单方有提到的目标用户或使用情景 附件：有会议录音或其他相关材料，列出需求材料清单作为文件附件 确认：与需求方进行原始需求确认 提炼：提炼本产品的主题关键字和目的性 第二章 干系人 一﹑干系人：又叫 利益相关者，就是指 积极参与项目，或 其利益会受到项目执行或完成情况影响的个人或组织。 二﹑分析目的：找出对产品有重要影响的人，获得他们的需求； 分析结果可以做为判断需求优先级的依据之一。 三﹑步骤：①分类穷举：分类穷举定义干系人，写出“干系人名称”和“项目中的角色” 。l 干系人名称：可以是个人、组织或者某个软件/系统，个人的说明其部门/职位/姓名，或其中之一。l 项目中的角色：定义干系人在项目中扮演什么样的角色？如决策者、验收方、施工方等。 项目中的角色指在项目中的干系人都有其特定的人物身份，并对项目造成特定的影响。 ②判断重要度：根据干系人对项目产品设计成败影响的重要性判断。l 干系人重要度：通过分析干系人对产品需求和设计的影响程度。 ③分析： ⑴干系人在项目中的利益：通过该产品，干系人可以获得什么利益。⑵项目对干系人的负面影响：指干系人可能被项目损害的利益或可能产生的负面影响，如可能给干系人造成收入减少、额外投入、隐私泄露等等。 ⑶干系人对产品的期望/要求：干系人为了获得在项目中的利益，会对项目提出要求或需求，可能包括对产品需求、期望或个人价值观（通常是干系人对项目的审美、收费/免费、公平性等的看法）。(p.s描述干系人的期望时，请尽量分析出干系人内心深处的需求，而不是表面上的需求) ④提炼：提炼功能需求或情景(从干系人的利益、负面影响、期望要求中提炼)l 提炼功能/情景：通过对干系人在项目的利益、要求和负面影响的分析，了解干系人的痛点和快点， 产品应设计什么功能来迎合干系人的痛点和快点，也可以简要描述干系人可能的情景。 四﹑干系人分类①出资方：就是以现金、实物、技术等形式，为项目提供资源的人或组织。(出资方是为产品成本付费) ②客户：采购项目产品/为项目产品买单的人或组织，同时可能也是用户。（客户为产品功能或服务付费） ③目标用户：指产品或服务的使用人，通常包含目标用户，而且很多时候我们还要将用户细分成更多类，以便更好的分析不同用户的需求。 ④权力部门：由于自身在消费者组织或项目执行组织中的位置，可以对项目进程或产品设计施加积极或消极影响的个人或组织（一般情况下为组织）。 ⑤合作方：公司外部和项目有合作关系的渠道商、销售商、供应商和分包商等个人或组织。 ⑥项目团队：执行产品设计开发运营的项目团队（如策划、程序、美术、产品测试、项目管理、产品运营部门等）。 ⑦其它感兴趣的人或组织：就是对项目感兴趣的，可能包括核心团队成员家属、政府机构、媒体渠道、 行业协会、临时或永久的游说团体，甚至整个社会。 第三章 目标用户 一﹑目标用户：就是指企业决定以相应产品去满足其需求，并为其服务的用户群体。 二﹑分析目的：明确产品是为一部分特定的人设计，获得他们的需求，用户特征的分析结果可以做为判断需求优先级的依据之一（这种用户对什么更在意）。 三﹑目标用户定位描述：根据用户的主要群体特征，对目标用户进行初步定位和描述，必须说明目标用户是一个什么样的群体。(用一句话描述目标用户) ①描述的是一个群体，而不是其特征的罗列(e.g……人/群体/组织/….) ②要突出目标用户群体的主要特征(e.g. 什么样的…..) 四﹑目标用户特征描述：①从所提供的用户群体特征Checklist中挑选对设计有影响的目标用户特征标签项，并对标签进行总结描述。（定位与特征，特征与特征之间，不能出现矛盾） ②除了所提供Checklist中的标签，设计师可以根据产品用户群体特征，增加相应的标签进行描述。 五﹑属性分类①基础属性：指目标用户的基本信息，包括性别，年龄，文化程度，地域，行业等属性。 ②经济属性：指目标用户的经济情况以及消费观念，包括经济收入，可支配收入，付费敏感度等属性。l 经济收入：指用户的各类收入总和，包括劳动收入、租金收入、利息/股息收入等。l 可支配收入：指用户可以用于任意支配的款项，考虑时往往须扣除各类税务收入和固定性开支。l 付费敏感度：指用户对产品服务或产品功能收费项接受的程度，付费敏感度越高，用户越排斥付费。 ③文化属性：指目标用户受教育程度及正常生活的习惯爱好，包括智力水平，所处文化圈，喜好文化，个性化需求等属性。 ④社群属性：指目标用户在社会关系上的诉求，包括交友需求，把妹/泡仔需求，归属需求,领导需求，合作需求等属性。l 归属需求：指人因兴趣、固有特点、职业等因素而对一个特定团体情感上归属的需求l 领导需求：即有领导别人的需求。l 合作需求：即有与其他人进行合作的需求。 ⑤硬件属性：指目标用户所拥有设备及相关条件，包括拥有设备，网络情况。 ⑥软件属性：指目标用户对网络及软件的熟悉度，包括网络熟悉度和软件熟悉度。 ⑦其他属性：指目标用户所具有的对设计产生影响的其他属性，如隐私等。 第四章 竞品分析 1.竞品收集 一﹑竞品：竞争对手的产品及所有值得参照借鉴的产品 。 二﹑收集目的：获得尽可能多的可以借鉴的产品 。 三﹑收集步骤：①在应用市场、专业网站、行业调查报告寻找竞品 l APP应用市场、软件市场：在Google paly、App Store、豌豆荚、91市场、华军软件园、百度软件中，心等应用市场或者软件市场搜索收集相关竞品l 专业网站：在最美应用、36Kr、知乎、小众软件等专业网站搜索收集竞品l 行业调查报告：在艾瑞网、百度数据等行业调查报告内收集相关竞品 ②使用搜索引擎寻找竞品 （如baidu、google、360搜索) ③用户访谈：可以通过访谈产品的潜在目标用户寻找竞品。 ④核心功能还有其他实现方式吗：可以自问核心功能还能有其他方式实现吗？（比如软件产品的相似品、实物、服务…） ⑤部分功能扩大：可以适当的将范围放开，部分功能扩大。（如：“买电影票”到“买票”）。 ⑥其他行业是如何做到的：可以分析其他行业是如何做到的？（如在做教育行业计算器时考虑在其他行业如金融行业是怎么做到的） ⑦其它：可以通过其它如过程的碎片化、操作相关的…任何方法寻找竞品 。 ⑧搜索关键字：在搜集竞品时使用应用市场或者搜索引擎所使用的搜索关键词，一般从原始需求中分析提炼得到。(p.s.关键字要合理，不能过于单一，除了产品名称字面拆解词语，还需考虑同义词、近义词等。) ⑨用这个方法做了什么：记录每种方式收集竞品的具体做法或步骤。 2.竞品选择 一﹑选择目的：选择相对具有参考价值的竞品，在后续进行拆解，以便快速获得尽可能多的产品功能列表。 二﹑竞品选择原则：优先选择匹配度高的竞品，在匹配度相当情况下优先挑选热门、出名、用户量大、下载量较大的竞品 。 三﹑竞品分类：①功能完全相同：与目标产品预期望达成功能完全相同的竞品，一般而言是指和原始需求吻合度较高且与我们所设计软件同平台(Web、桌面、移动端)的竞品⑴同平台（移动端/PC/WEB） ⑵同类目标用户 ⑶满足原始需求的产品目的性 ②核心功能相似：指主要功能与目标产品相同或相近的竞品 ，一般而言是指部分功能符合需求或者与我们所设计软件不同平台(Web、桌面、移动端)的竞品。 ③功能本质相同：指实现途径或达成形式与目标产品不同，但最终达成的功能效用与目标产品相同的竞品，一般而言此类竞品大多为有思考借鉴价值的实物或服务。 四﹑竞品介绍：指对该竞品主要功能特质及相关信息的描述，可以引用产品官网或应用市场的描述，也可以自行总结。 五﹑选择原因：选择竞品的原因，需体现以下维度：①功能匹配度②功能亮点③用户群情况④热门程度⑤下载量 3.竞品拆解 一﹑竞品拆解：就是用碎片化方法对竞品功能进行拆解。 二﹑目的：获取竞争产品的功能。 三﹑步骤： ①从竞品选择表中选择要拆解的竞品，功能完全相同的拆解一个，核心功能相似的拆2个; ②对竞品进行功能拆解。第一个竞品需要完整拆解，后续竞品如果碰到功能相同部分，可以跳过，只要补充拆解不同的部分，可以跳过; ③标记拆解方式和添加功能备注。 四﹑拆解方式：⑴使用功能菜单：从界面上相关按钮或选项去拆解功能。如微信主界面tab栏的四个功能选项，可以拆解四个一级功能。 ⑵体验使用流程：从对软件的具体操作去发现功能。这个方式可以发现界面上没有相关按钮或选项可以直接进行操作交互，但切实存在的功能。如“登陆密码验证”，往往是软件后台处理的一过程，需要在使用过程中发现相关功能。 ⑶检查重要操作：通过从《重要操作checklist》中的交互方式去发现功能。重要操作包括双击、长按、拖动等。 ⑷看官网/说明书：从竞品的官网/说明书中发现功能，往往是产品的卖点、亮点或重点功能。 (P.S.用不同的拆解方式可以得到相同功能的情况，可以选择勾选。) 五﹑备注内容：可以是对功能的说明或内容、交互、流程的说明。 ①功能：解决某一需求的具体方式。 ②交互：功能的具体实现方式。如刷新，交互可以设置点击，下拉，长按等。 ③内容：指具体的展现内容，如信息、资料、文章等。内容往往需要功能去承载和体现。 ④流程：指软件的逻辑流程，在拆解中可以在备注中体现。 第五章 情景要素 一﹑情景罗列：用穷举法找到尽量多的重要（①常见、②用户体验影响大）情景的一个过程。(P.S.情景罗列阶段并不需要详细描述情景的过程，情景描述才需要 ) 罗列构成情景的要素，如时间、地点、人物、起因和经过等。 ①人物：指构成情景的某种特征的人物。根据产品需要，可以从使用者年龄、使用者学历、使用者身份、使用者习惯、个人属性、比如 性别、等级、职位、角色等角度罗列。 ②时间：指情景发生的时间。 根据产品需要，可以罗列相关的情景时间，比如节日、假日、纪念日、特殊日期；上班途中、上班休息时、上班时、开会时、独立工作时、午睡、下班前、下班途中；白天、夜晚… ③地点：指情景发生的地点。 根据产品需要，可以罗列相关的情景地点，如公司、家里、商场、机场、车上… ④起因：指情景发生的原因，往往是用户的的情绪、心理诉求、环境状态、事情进展等。 ⑤经过：指情景发生的经过，往往是一个动作，解决方案。 起因和经过的正确描述方式：①起因：描述一种状态，如生病、塞车等；描述一种情感，如开心、郁闷等。 ②经过：做了什么事 在情景罗列中起因和经过描述格式则为： 起因“要/不要/想/不想/因为/由于/希望/不希望/……”+ 经过“做什么事”； ⑥道具：指情景中用户所使用的事物，如移动设备，软件，APP，常见物品等。 ⑦使用条件：指情景中用户所处的环境或其他制约条件。如天气，人的身体情况，流量情况，网络情况等（可能同时属于起因要素）。 二﹑目的：通过列出足够多的情景，发现尽可能多的需求。(P.S.找到尽量多重要的情景是手段，目的是①发现功能需求和②改善交互设计。) 三﹑步骤：通常情景罗列可以有两种方式： 第一种：就是用穷举法，先罗列情景要素，再逐个组合成情景标题。可以多个要素组合成一个情景，也可以单个要素做为一个情景。①用穷举法罗列情景要素②并逐个组合描述情景 第二种：先罗列情景标题，再拆解得到新情景要素。①先描述情景，②再分解穷举情景要素后，组合新的情景的一个过程。(P.S.此两种方法可以迭代进行，不分先后，直到获得足够多的情景。) 主要步骤是：①穷举情景要素 ②组合情景要素 ③描述情景标题 四﹑罗列情景标题：根据已经罗列的情景要素，逐个组合要素，描述情景标题的一个过程。 ①情景：指具体场合的情形，往往包括人物、时间、地点、起因和经过等要素。 ②虚构情景：指罗列情景假定我们所设计产品已经存在的情况。（P.S.“虚拟情景”属于中级内容，在初级方法论里面不应该出现。） ③重要情景：指目标用户经常会遇到的情景，或者涉及到用户的重要需求的情景。在进行情景描述时应优先描述重要情景。 (P.S.体现用户有XX需求，与XX产品关联紧密，并且描述了常见的现有解决方案，为重要情景) 五﹑情景描述：通过清晰、详尽、细致的流程描述，展现用户的行为过程。获得情景的途径有三种：①观察他人、②自己体验、③假想。 目的：通过描述用户当前的具体操作流程，洞察用户情感体验及心理活动，从而发现用户的痛点和快点，提炼功能需求。 步骤： ①碎片化行为过程：将用户或干系人的行为过程碎片化。情景描述就是讲一个故事，故事应该要有基本情节： ⑴用户 ⑵产品 ⑶流程：用户为了达成需求而做的一系列动作（与产品的各个功能点的交互） ⑷其它：流程中的各种要素（环境、需要、困难、操作、感受等等） ②详细描述每个过程：根据设计目的，详细描述过程行为，包括使用过程⑴遇到的问题和使用者的⑵心理感受。⑴情景描述中，要突出用户对产品的使用流程。⑵在描述的流程环节中，要体现产品功能与人的交互。情景描述过程要抓住用户的每一次心理反应，且不能出现虚构情景和虚构功能。 ③提炼功能需求：分析用户使用过程的痛点和快点，提炼功能需求。 第六章 功能列表 一﹑功能列表：以竞品功能整合结果为基础，结合原始需求、干系人分析、情景描述等其他节点中分析得到的功能形成的产品功能列表。 二﹑制作目的：整合之前节点分析所得到的功能，形成功能列表并作出重要性判断。 三﹑步骤：①以竞品功能整合结果为基础，建立产品功能框架，先整理出初步的功能清单。②把原始需求、干系人分析、情景描述等其他节点中分析得到的功能整合到功能列表中。③根据功能在不同设计环节中有体现的，在对应的节点上打勾。(五﹑功能来源)④对难以理解或容易造成歧义的功能，进行必要的说明。(备注说明)⑤对每个功能点进行重要度判断。(四﹑重要性) 重要方法论使用模板&amp;案例https://shimo.im/sheets/gvVqRVemWwpUjqyP/ 《方法论使用模板&amp;案例（请勿外传）》，可复制链接后用石墨文档 App 或小程序打开","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"如何准备pecha kucha","slug":"产品方法/如何准备pecha kucha","date":"2019-07-06T10:24:11.000Z","updated":"2019-07-06T12:03:15.538Z","comments":true,"path":"undefined/产品方法/如何准备pecha kucha/","link":"","permalink":"http://yoursite.com/undefined/产品方法/如何准备pecha kucha/","excerpt":"","text":"（转自http://dy.163.com/v2/article/detail/DK4QOEGP0516CNRF.html）注：本文还未整理完成 ———这是一篇从准备到做ppt到演讲的一个介绍 我是 2018 届燎原学员 Salome，也是孤阅第一届劈叉大会（Pecha Kucha展示大会）的优秀学员之一。之前虽然一直听人说「输出倒逼输入」，但是自己没有真实的感触。直到亲自参与 Pecha Kucha，我才强烈地体会到这「六字箴言」的威力所在，所以我非常想要高举「劈叉」大旗，让大家都参与进来。 之前船长从他的角度给大家展示了「劈叉的正确姿势」，这次我作为一个和大家从一样的起点开始的学员，谈谈我的经验以及我准备 Pecha Kucha 时的基本步骤。 第一步 确定主题 确认主题时需要遵守两个原则：一是话题要合适；二是要结合自己的兴趣。 · 合适：以点带面 一个 Pecha Kucha 不到 7 分钟，因此我们最好选择一个点来作为我们要展示的话题，在真正开始准备后，你就会发现，从这个点可以带出来很多知识点。 比如我在准备第一个 Pecha Kucha 的时候，一开始想讲整个中世纪的脉络，后来发现根本不能实现，于是就把我的主题定为「十字军东征」，但其实这个点也是比较大的。 · 兴趣 一个感兴趣的话题会带着自己不断深入挖掘。 我自己就非常喜欢像「十字军东征」这种体现了人性复杂的历史事件，由多方利益纠葛而成的一个出乎意料的结果。而且遥远的事件都有很多传奇色彩，在讲的时候也会非常有趣。 第二步 搜索资料并整理-Narrow down 确定完主题，我们其实就确定了用于搜索的关键词。在搜索资料阶段，可以从不同渠道得到不同形式、不同视角的信息。而在资料的整理阶段，就涉及到不同工具的使用，擅于利用工具的特点可以使资料更加清晰直观，也能帮助我们进行资料的筛选和重新整合。 · 维基百科 初期的资料搜集是一个很庞杂的过程，我几乎准备了整整一周。首先浏览完整个「十字军东征」的维基页面，因为那个时候自己对十字军东征并不熟悉（所以大家也千万不要因为觉得自己的知识储备不够而不敢做 Pecha Kucha），但是如果我想把事情生动地、重点突出地讲出来，就必须先对整个事件详细了解。之后，我再分别浏览了第一次、第三次和第四次十字军东征的相关页面。 · Crash Course Crash Course 里有很多兼备学术与趣味的视频，涵盖科目很广。可以在浏览完维基的基本信息后看看 Crash Course 的视频，看看别人是怎么讲述同样的内容。Crash Course 用漫画展示历史事件的方式以及幽默的口吻对我就很有启发，所以我在稿子里也会抖个机灵，还专门找了事件相关的漫画。 · 思维导图 我会在一边搜集信息的同时一边制作导图，这样方便我快速浏览事件，判断这个事件是否值得纳入演示，以及安排多少时间给它。比如我首先从背景、经过、影响三个方面来整理「十字军东征」，然后从维基对事件的详略描述里，推测出一个事件的重要程度。这么整理下来，我会发现哪些资料需要进一步补，哪些其实可以删掉。 · 时间轴 时间轴是一个能将看似独立的历史事件进行关联的工具。从时间轴里，我不仅知道了十字军东征的起止点和重要事件，我还能观察到战争发生的背景，以及战争的结果对未来某个事件的影响。 比如下图就是我在演示过程中展示的十字军东征的背景。 第三步 确定呈现形式 在演讲中尤其不能忽视「结构」的作用。一个清晰、完整、协调的结构能够让听众迅速地从庞杂的信息中提取出重点，这样他们在跟随你的脚步前进的时候就不会「丢」。 · 总—分—总 我一般会选择「总—分—总」的呈现形式，即先给大家展示我要讲的主题和 outline；然后再分层阐述各个部分；最后在进行总结，带着大家进行简单的回顾。 我的经验是，开头不需要花太长时间讲述细节，因为演示的时长很短。但是要进行简单的解释，不要让大家看一眼就过了。最后结尾的时候可以给出更详细的总结，比如我这里不仅给出了论述中提到的各个点，还有逻辑思路。 · 各部分比例 比例的确定，即每个部分占多少时长，需要依据演示主题和知识量来定。以我的主题为例，背景、过程和感悟（这一部分包括了影响）三块的比例大约是 2：2：1，因为背景比较复杂，而十字军东征包含了多个事件，数量比较多，最后一个部分由于参杂了我自己的想法，所以占比较小。 · 事件重点 选取最能凸显事件特征以及与主题关联最近的内容为重点。即使是单独的一次十字军东征，也有大量细节可以写，那么选取哪些细节进行表达就很重要了。比如，第三次十字军东征体是关于「王的战争」，背后体现的是当时欧洲强大国家之间的角力。 第四步 写逐字稿 对于像我这样的 Pecha Kucha 初级选手来说，可能还做不到看到 PPT 就马上能在固定的时间内用非母语来有逻辑地表达自己的内容，所以，我会准备好逐字稿，并进行多次演练。准备逐字稿的时候，我会注意以下几点： · 句子长短合适 由于这是一次话题比较严肃的 presentation，所以我在选词造句上会保证学术性，但同时我不能刻意炫技，让我的听众听不懂我在说什么。所以，我会长短句搭配。短句作为提示或提问，唤起听众的注意力，比如在开篇介绍全文结构的时候会说「then we have some questions」。长句作为对一个「点」的完整阐述，如果要套从句一定是因为它比单句的表意更完整和易于理解。 · 手动 variation 很多时候听众听不下去，其实是因为演讲者的声音太平了。我的稿子除了是一篇文章，还自带音效。在下面这个截图里，/ 表示停顿，加粗表示重读，斜体表示慢读，[换] 提醒自己翻页，波浪线表示需要用鼠标在 PPT 上指示。这些地方都不是随意加的，需要重读、停顿、慢读的地方，都是你想让听众注意到的地方。 此外，我的 PPT 里有很多地图，我嘴里说一个地方，但是大家可能没法很快找到，所以我就用鼠标告诉大家它在哪。 · 增加小结部分 小结是为了能让听众听得更顺畅，听众经常「走丢」就是因为不知道现在讲的这个东西在整个事件中扮演什么角色。 比如我在讲述第一次十字军东征的背景时就做了这么一个框架，左半边是对之前有关拜占庭的总结，然后自然地过渡到右边与教皇有关的部分，最后回到了标志着十字军东征开始的事件 Council of Clermont 上，引出接下来关于几次运动的讲述。 第五步 制作 PPT PPT 是我们在进行任何 Presentation 时的一种有效的形式，能够让我们的表达更为直观生动，便于理解。 · 图多文少 按照经验来讲，PPT 上成句的文字不仅不会帮助听众理解，反而会让他们无法专注在你的口头表达里，尤其是在 Pecha Kucha 里每页 PPT 只有 20 秒的时间，所以文字越少越好。 当然，文字确实有辅助作用，所以我也会在必要的时候总结几个单词，而我讲的内容就是这一两个单词的拓展，比如下图，人名、地名我也会写上，因为我除了要让听众把注意力放在我的话语上，还得让听众听得懂。 · Google 图片 这个就不用详说了，想搜什么图在 Google 里找就可以。 · 注意排版 排版越简洁统一越好，这样能突出重点，减少位移引起的注意力转移。我通常把图片都放在同一侧，下方在相同的位置写标题，而且字号统一。 如果需要在颜色比较鲜艳的图片上加文字，我会给文字加一个透明度 70% 左右的白色背景，这样既凸显文字，又不会完全遮盖住图片。 第六步 反复练习 在正式上麦前，我用了整个周六周日来练习，精修逐字稿，尤其是「手动 variation」的部分，在实际演示的时候会发现有很多需要改进的地方。演示的时间紧，我准备的内容又比较满，所以如果不是非常熟悉稿子的话，说不定会有看串行的问题出现，那就很糗了，而且对我的听众也是不尊重的。 希望我的分享能够对大家有所帮助。 视频作者：燎原学员Salome 演讲主题：The Crusades - End - 本文部分图片源于网络","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"GAP模型","slug":"产品方法/GAP模型","date":"2019-07-06T10:23:15.000Z","updated":"2019-07-06T12:03:15.538Z","comments":true,"path":"undefined/产品方法/GAP模型/","link":"","permalink":"http://yoursite.com/undefined/产品方法/GAP模型/","excerpt":"","text":"方法名称5GAP（服务质量差距模型） 方法介绍服务质量差距模型是20世纪80年代中期到90年代初，美国营销学家帕拉休拉曼（A.Parasuraman）,赞瑟姆（ Valarie A Zeithamal）和贝利（Leonard L. Berry）等人提出的,5GAP模型是专门用来分析质量问题的根源。顾客差距（差距5）即顾客期望与顾客感知的服务之间的差距——这是差距模型的核心。要弥合这一差距，就要对以下四个差距进行弥合：差距1 ——不了解顾客的期望；差距2——未选择正确的服务设计和标准；差距3——未按标准提供服务；差距4——服务传递与对外承诺不相匹配。 将这个模型套用在产品设计领域中，则可将其引申为了解用户流失的原因，如下图所示 认知缺口 产品经理不知道用户想要的是什么。若出现了认知缺口，则首先是让产品经理清楚知道用户流失的真正原因。 执行缺口 产品经理知道用户想要什么，但实际做出来的产品与设计中的不一致。若出现了执行缺口，则要了解具体哪个执行步骤出现问题，是资源的欠缺还是技术难以实现。 传递缺口 产品的宣传和指引不能让用户对产品真正认知了解若出现了传递缺口则要了解用户现在的感知是怎么样的，在哪些宣传和指引上出现了问题。 流失缺口 用户体验到的产品和期望的不一样。 产品阶段产品规划、产品设计、产品运营 产品层面战略层、范围层、结构层、框架层、表现层 适用市场现有市场、垂直市场、全新市场 方法目的 调研目前产品与用户认知之前的差距，并进行优化改进方法渠道5WHY、对比相关产品、行为分析方法类型 使用步骤 确定调研目的 确认调研路径 设计调研路径 找出原因 深入追问 了解用户认知与实际的差距 设计改善措施 实践案例 参考文献[1]用户流失原因调研四步经[2]服务质量差距模型- MBA智库百科","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"如何撰写一份接地气的PRD文档","slug":"产品方法/如何撰写一份接地气的PRD文档","date":"2019-07-06T10:22:34.000Z","updated":"2019-07-06T12:03:15.539Z","comments":true,"path":"undefined/产品方法/如何撰写一份接地气的PRD文档/","link":"","permalink":"http://yoursite.com/undefined/产品方法/如何撰写一份接地气的PRD文档/","excerpt":"","text":"文章来自【原创： 朱学敏 产品经理朱学敏】链接地址为：https://mp.weixin.qq.com/s/X7gaJEVHIE2PgUdpk_y3kA 1什么是PRD文档 PRD是产品由立项阶段进入到需求阶段的最重要的一个文档。 简而言之，PRD就是将宏观抽象化的业务，拆分成具体化的功能需求，并通过文字或图像等方式呈现出来。 PRD文档主要使用对象有：产品、设计、项目、开发、测试。产品经理可以根据PRD进行功能自查，从而更加完整的梳理产品；设计师可以通过PRD来设计交互细节，并改善用户体验；项目经理可以根据PRD拆分工作任务，并分配开发人员；开发人员可以根据PRD获知整个产品的逻辑；测试人员可以根据PRD建用例，并进行可用性测试。 传统的PRD文档冗长而复杂，一方面不方便产品经理清楚且全面的表达产品设计的相关细节，另一方面不方便产品经理将需求简单且清晰地传达给PRD阅读者。 2PRD文档的目的 PRD文档是产品新人入门的一门必修课，是进入职场的敲门砖，也是产品经理基本功的体现，更是衡量产品经理整体思维的一个标准。 PRD文档是每个产品经理打交道最多的文档。也是项目启动之前，必须要通过项目组评审，并确定最终需求范围的重要文档。 PRD文档在项目立项阶段，可评估产品机会。在需求阶段，可定义产品功能范围。 PRD文档可以梳理产品业务逻辑，记录需求变更内容，管理产品迭代过程，便于部门需求沟通。PRD文档的好坏直接影响到开发进度、测试质量以及最终的实现效果。 PRD文档是产品经理和开发人员沟通需求的重要工具，产品经理一般用它做需求管理和版本管理。PRD文档首先应该展示的内容是需求，如果一份PRD文档能够充分的表达用户需求，那么它就可以作为需求验收的标准。 3如何写PRD文档 之前有些想转行和刚入门不久的产品朋友，在产品经理朱学敏公众号留言问我怎么写PRD文档。借着这个机会，给大家分享一下我自己的一点产品经验。 撰写PRD文档的方式有多种，常见的有Word、PPT、Wiki或Axure等，但我个人更倾向于直接在Axure中撰写PRD。此外，描述需求或业务规则，我侧重于用视化的结构图、流程图和原型表示，文字只是作为补充说明。 PRD文档内容结构包括：文档概述、产品说明、全局说明、功能需求、非功能需求、改进建议等。基于以上几个方面，从理论角度阐述，结合案例做分析。 一、文档概述 1.1 修订记录主要包括版本、时间、内容、备注等，方便沟通和记录产品成长路径，为规划未来产品迭代提供参考。以下是PMLink产品迭代的一个简化修订记录。 1.2 项目背景简单描述项目的背景、目标、定位和用户等，让成员对项目有整体的认知以及明确方向。 1.3 阅读对象文档的主要阅读对象和使用者，一般包括产品、设计、项目、开发、测试和甲方负责人。 1.4 专业术语对文档中会出现一些专业名词做解释，方便项目成员理解业务并统一名称。 二、产品说明 从产品生命周期了解各个阶段的运营活动，比如产品路线图、功能清单、产品结构设计、用例图、业务流程图、需求列表、产品进度、开发进度等。 2.1 产品路线图 2.2 功能清单 2.3 产品结构设计 2.4 用例图 2.5 业务流程图 2.6 需求列表 2.7 产品进度 2.8 开发进度 三、全局说明 对产品设定的一些行为准则，按照既定标准、规范的要求进行操作。比如页面设计规范、产品状态规范、操作提示规范、数据加载规范、消息通知规范等。 3.1 页面设计规范 3.2 产品状态规范 3.3 操作提示规范 3.4 数据加载规范 3.5 消息通知规范 四、功能需求 功能需求一般是由四部分组成，功能总览、页面原型、用例描述、业务规则。主要是对所有的产品功能的描述和规划。其实就是通过场景模拟，告诉用户此功能主要干什么的，并了解产品在哪种情况下会被用户使用。 4.1 原型页面常见的原型设计方式有手绘原型、灰模原型、交互原型。产品经理一般是画低保真的手绘原型或灰模原型，而高保真的交互原型更多是让UI去实现，但我们要在软件需求中，说明所有页面的展示及每个功能的状态。 4.2 用例描述用例描述文档是用文本方式来表述的，为了更加清晰地描述用例，也可以选择用例图或流程图来辅助说明。用例名称：该用例的名称；用例编号：该用例的编号，一般定义到功能Uc级；操作角色：参与或执行该用例的用户。优先级：功能优先级排序；功能目标：功能要实现的预期效果；前置条件：参与或执行该用例的前提条件，或者所处的状态；后置条件：执行完毕后的结果或者状态。 4.3 业务规则业务规则是指对业务定义和约束的描述，用于维持业务结构或控制和影响业务的行为。即告诉我们此功能在操作时有哪些约束条件。 以PMLink快捷登录为例，会对操作、输入框、内容格式、长度、点亮、控件、数据之间的关联性做出说明。产品在使用时要有相应的业务规则，且业务规则必需是完整的、准确的、易懂的。 业务规则将系统处理的业务逻辑从程序代码中抽取出来，将其转变为简单的业务规则，以结构化的业务规则数据来表示业务行为。这样用户无需找程序员帮忙，就可以更改业务规则。 最典型的就是CRM客户关系管理系统，其复杂且多变的的业务规则，就需要一套业务规则引擎的架构设计。 五、非功能需求 非功能性需求是指软件产品为满足用户业务需求而必须具有且除功能需求以外的特性。一般会涉及到的有：性能需求、安全需求、可靠性需求、数据监控需求、系统需求、运行环境需求、外部接口需求等。 以性能需求为例，我们会关注每秒处理的事务,功能操作的响应时间,页面刷新时间。以系统需求为例，我们会关注服务器连接失败后的重启次数.时间引起失败的比例 失败时数据崩溃的可能性。 六、改进建议 改进建议实际就是基于用户体验区优化产品路径。 网上有太多的PRD文档，可以作为参考，但不是标准规范。最忌讳的就是把BAT大公司的文档规范标准，按部就班的套用过来。要结合公司的实际需求，去撰写适合自己产品团队的PRD文档。 写好PRD不是一蹴而就的，除了基本的专业能力和逻辑思维，还得此外，要常收集、常反馈、常总结。 写PRD文档不能为了面子工程或个人绩效，写一堆无关痛痒的废话。这样只会导致需求评审时，产品经理说的天花乱坠，开发人员看得眼花缭乱。需求最后最后要回归到时效性，在业务逻辑清晰的前提下，尽量用精简的语言，把需求快速传递给开发。 一份接地气的PRD文档，一定是遵循整体逻辑清晰，语言简洁易懂，信息实时共享，明确功能范围，并快速需求落地的原则。总而言之，PRD文档最重要的就是把需求表述清楚。-END-","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"卡牌模板及示例","slug":"产品方法/卡牌模板及示例","date":"2019-07-06T10:21:46.000Z","updated":"2019-07-06T12:03:15.540Z","comments":true,"path":"undefined/产品方法/卡牌模板及示例/","link":"","permalink":"http://yoursite.com/undefined/产品方法/卡牌模板及示例/","excerpt":"","text":"写在最前本卡牌参考自《设计方法卡牌》并根据产品经理工作做了一定梳理和规整。目的是通过归纳产品经理工作过程中，用到的方法论及工具，形成卡牌，帮助产品经理工作中辅助。每张卡牌包含 方法名称、介绍、适用阶段、方法目的、适用层面、适用市场、使用步骤、实践案例等内容。大纲如下所示 卡牌属性说明 方法目的 该方法卡片的为了解决什么目的，如下所示 研究用户行为习惯，理解用户心理，发掘产品问题和产品机会点 面向阶段 产品适用于哪个产品阶段，有以下几种阶段可供选择 产品战略、产品需求、产品规划、产品设计、产品开发、产品运营、产品退市 适用市场 产品适用于哪个市场，其中现有市场和全新市场是互斥关系 现有市场、全新市场、垂直市场 产品层面 借助交互设计五要素的产品层面的划分方法 战略层、范围层、结构层、框架层、表现层 人力成本 该方法的人力成本，N天/M人 7天/2人力(测试用户8-10人) 方法属性 方法的属性 定性、行为 方法渠道 田野调查、方法评估、用户访谈 方法类型创新方法 举例说明 方法名称用户体验地图 方法介绍用户体验地图是一个以可视化图形描述用户使用产品或接受服务的体验情况，以此发现用户在整个使用过程中的问题点和满意点，并从中提炼出产品或服务中的改进点和机会点。可采用专家评估判断或用户定性打分判断两种方式。 方法目的 用户全流程体验的可视化 研究用户行为习惯，理解用户心理，发掘产品问题和产品机会点产品阶段产品需求、产品规划、产品设计、产品运营产品层面战略层、范围层、结构层、框架层、表现层适用市场现有市场、垂直市场、全新市场人力成本（待定）7天/2人力(测试用户8-10人)方法属性（待定）定性、行为方法渠道（待定）田野调查、方法评估、用户访谈方法类型（待定）创新方法使用步骤 [设定场景任务，邀约用户] 根据需求或问题设定场景任务 邀约8- 10名用户，全新市场产品可邀请竞品用户 [观察与测试用户] 用户进行任务测试，设计师从一旁跟踪观察 分析用户在相应场景中的态度或观点，寻找接触点，定义他们的感情是正面的还是负面 可同时对比产品与竞品在接触点处的情绪差异 [用户满意度打分] 测试任务结束后，针对核心接触点，用户进行颗粒度从1-5的满意度打分 访谈用户打分背后的原因，提取使用过程中的“兴趣点”或痛点” [绘制情绪曲线图] 划分功能阶段:确定任务流程中各个功能阶段。按照-定的逻辑， 将体验拆分为几块 统计用户每一接触点打分的平均值， 体现在体验地图上,并给出相应的解释 参考模板 实践案例咸鱼购买二手商品用户体验地图砍价活动用户体验地图","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"移情图","slug":"产品方法/移情图","date":"2019-07-06T10:20:55.000Z","updated":"2019-07-06T12:03:15.540Z","comments":true,"path":"undefined/产品方法/移情图/","link":"","permalink":"http://yoursite.com/undefined/产品方法/移情图/","excerpt":"","text":"“作为一个用户，我不会这么做。”“我们的用户不会为此担心。”“这是我的项目，我知道用户是怎么想的。”我们常听到这样的言论，而UX专业人士绝不会说这些话。作为设计者，我们不是用户，并不知道他们会怎么做、怎么想，再多的培训或专业知识都无法告知我们用户的想法。只有通过研究、观察、询问和推断，花时间去更好地理解用户，才能产生同理心。同理心是以人为中心设计的关键部分，但少有人告诉设计者如何实现它。作为研究人员，我们亲身体验用户的挣扎、感受到他们的失望、倾听并产生共鸣。但在用户研人员身后的团队、客户或者公司CEO，他们并不了解用户需求。那么，用研人员要如何帮助他们理解用户需求呢？试试移情图！用研人员经常面临挑战：同事和利益相关者默认其观点和感受是正确的，而忽略了目标受众。虽然移情图的应用难以改变不重视用户研究的公司文化，但它可以帮助团队在设计产品或服务时设身处地为他们考虑。 WHAT：什么是移情图？移情图是一种将用户行为和态度进行剖析、呈现的直观视觉形式，它帮助设计团队更好地了解用户。创建移情图是一项简单的工作坊，由利益相关者、市场和销售人员、产品开发人员或创意团队共同完成，以培养各方对终端用户的同理心，让他们“深入用户的头脑”。 WHY：为什么要创建移情图？探寻有效的解决方案需要了解问题的本质所在，以及实际遇到这些问题的用户是谁。创建移情图能帮助团队从用户视角出发，带着目标和疑问思考问题。 WHEN：什么时候适合创建移情图？移情图在设计项目的起始阶段作用最大（已进行一些用户研究，但需求和概念设计尚未完成前）。绘制地图的过程可以帮助团队总结研究结果，深入挖掘用户需求。基于研究数据而不仅是已有的人物角色时，移情图是最有效的。它可以帮助引导人物角色的构建并在人物角色和设计理念间起到连接纽带的作用。在项目前期，移情图可以帮助团队进入用户的世界。它有如下6个好处： 更好地了解用户 直观地呈现信息 突出关键研究结果 方便快捷 根据不同数据和目标轻松定制 达成团队共识 当然，移情图还可贯穿于整个设计过程，在获得新数据后加以修订。 HOW：如何创建移情图？ 1. 元素要创建移情图，需要收集好所有定性研究数据、人物角色，并拉齐团队成员。所需的材料是大张纸或白板、彩色便利贴和记号笔。你可以参考移情图模版来手绘草图或线上绘制后打印出来。 移情图模版 2. 过程移情图的形式各不相同，但它们具备共同的核心要素。将一张大纸（或白板草图）分成多个部分，用户放在中心，通常是一个很大的无填充头像。（Dave Gray，Xplaner创始人和移情图创建者，最初称之为“大头练习”。）在用户周围，纸张按部分或象限划分。每部分代表一个类别，用于探索用户的外部环境和内在思维：用户正在做什么、看什么、听什么、思考什么和感受什么（包括付出和收获）。团队成员基于对用户的了解和研究数据共同填充信息。 更新的移情图版本©2017 David Grey1）建立焦点和目标 地图中的人物是谁：他应该是那些你希望理解和共情的用户，总结他的个人情况和角色。如果你有多个用户画像，则需要为每个人物角色分别创建地图。 期望得到什么结果：即你希望这些用户做什么？比如他会以不同的方式去做出哪些决定或行为？这项练习主要是为了建立同理心而不是设计或推销产品，回答这一问题有助于聚焦用户并为移情图设定好背景。 2）记录用户的外部世界每一部分不必按照特定顺序去完成，但从了解用户可观察的行为开始更有效率。相比内在思维，外在行为更易获得。首先探查用户的体验，并想象为他本人。将这些记录在移情图相应位置：用户看了什么、说了什么、做了什么以及听了什么。他看到了什么？他每天的日常生活中遇到了什么？可能是人，也可能是一些活动或事物。他周围的人都在做什么？他在看什么、读什么，在他所处的生活环境或能影响他的商业环境中都接触了些什么？多想想替代产品、服务或竞争对手在做什么。记住，这是他的世界，不是你的，所以不要以为你的公司或产品一定会吸引他的注意。哪怕你的邮件写得再出色，也别忘了他收件箱里还有另外20封一样出色的。他做了什么，说了什么？他的行为是怎样的，他如何表现自己？他的态度是怎样的，他说了些什么？这些都会随着他周围的环境与他人而改变。如果可行，记录下他最近的行为变化，包括在公开场合和私下的行为变化。比如：他以前经常发微博，直到有一天他觉得这非常糟糕。现在他只偷偷地使用，再也不发东西了。他听到了什么？他听到了什么，这些东西是如何影他的？主要考虑各种人际关系，如家人、朋友、同事，以及来自社交媒体或各领域的专家意见。聚焦于那些影响用户行为的因素，如人、事物、地点，其他闲聊可以忽略。3）探索内在思想在完成外部元素的探究后，焦点转移至用户的思想，以探索用户的内心感受。这些感受可以通过推断、猜测验证或从用户调研中直接获取，核心思想是揣摩出用户脑中在想什么。他到底在想什么，有什么感受？用户会考虑哪些内容？这些想法的积极面和消极面有哪些？什么让他感觉良好或很糟糕？他在担心什么？当他考虑或尝试做某事时，他的思考路径和方式是怎样的？他现在的感受是什么？恐惧？兴奋？紧张？接下来，深入探索用户的付出和收获。他经历了哪些成功和失败？构建出用户在通往成功路上遇到的挫折和挑战，以及用户的目标和梦想。 传统移情图的四个象限©NNGroup4）总结和分享完成以上步骤后，请花一点时间反思，让参与者分享他们的经历和想法，询问他们为什么改变了观点或产生了新见解。把团队得出的结论和想法用照片、文档记录下来分享给大家，还可以将原始的移情图或做一个海报挂在公共区域。这是让团队其他成员走进用户角色、与用户产生共情的好方法。但请记住：移情图只是一种UX工具，很难转变组织思想。如果企业文化不改变，移情图无法让员工突然就对用户关注。练习移情图的目的是让参与者建立以用户为中心的服务意识，如果练习对参与者产生了持续影响力，那我们就成功了。 TIPS 几点提示 1. 不要纠结信息填在哪一部分一些参与者可能会担心是否将卡片放在了 “正确” 的象限中。（例如：这是付出还是感受？这是他看到的还是听到的？）如果有多个成员在为同一用户构建地图，不同的人对事物的分类必然会有细微差别，这是可以接受的。制作移情图的目的不是准确对信息进行分类，而是认清用户。 2. 只探索和项目目标有关的用户感知移情图不是记录用户情绪和行为的每一方面，它关注的是目标受众，并了解他与项目有关的世界。过于宽泛会使事情偏离轨道。 3. 根据具体情况和需求调整地图根据项目目标、人物角色及可用数据，灵活更改或简化象限的类别。例如：如果人物角色是B2B公司的采购经理，产品的焦点是业务本身和工作效率，研究用户的感受可能就没那么重要。进行必要的更改，能够确保移情图制作的高效率与结果的有用性。 原文作者：Jennifer Leigh Brown发布日期：Jun 06, 2018原文标题：Empathy Mapping: A Guide to Getting Inside a User’s Head原文链接：http://www.uxbooth.com/articles/empathy-mapping-a-guide-to-getting-inside-a-users-head/","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品经理常用工具清单","slug":"产品方法/产品经理常用工具清单","date":"2019-07-06T10:19:56.000Z","updated":"2019-07-06T12:03:15.541Z","comments":true,"path":"undefined/产品方法/产品经理常用工具清单/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品经理常用工具清单/","excerpt":"","text":"工欲善其事，必先利其器。产品经理要做好工作，必须先掌握基本工具。对于工具，我一直强调宁缺毋滥，精益求精，可根据工作需要选择合适的工具。有些产品发烧者，把工具当爱好，将产品做到极致。 当我们成为产品经理后，需要对产品进行分析、设计、管理和运营等，为了把产品各方面都做好，会使用一些辅助工具。比如原型制作工具、流程设计工具、思维导图工具、数据分析工具、项目管理工具、文档协作工具等。 1 原型制作工具 Axure RP：用来创建应用软件和基于Web的的流程图、原型页面、交互页面和规格说明文档。 作为一个专业的快速原型设计工具，它能快速、高效的创建原型，同时支持团队协作设计和版本控制管理。此外，能够撰写和输出规范的业务需求PRD文档，了解产品生命周期全流程。 摹客(Mockplus)：是更快更简单的产品设计协作平台，为产品团队提供更全新的设计解决方案。 作为一款简洁快速的原型图设计工具，它封装的组件即可实现交互，且交互设计完全可视化。支持快速原型设计、高效设计协同、设计规范管理，并能够很好地表达产品设计概念、理念和基本布局。 墨刀(MockingBot)：用来设计APP产品原型，上手简单，制作快速，浏览文件比较方便。 作为一款在线原型设计与协同工具，能够让产品团队快速高效地完成产品原型和交互设计。同时也支持实时预览，多人协作功能。不管是收集产品反馈，还是进行Demo展示，或是团队协作、项目管理，都可以提升工作效率。 Pencil：能够快速的把界面原型画出来，方便和客户沟通需求，表格工具特别好用。 作为一个免费的开源的GUI原型设计工具，它可以用来绘制各种架构图和流程图。内置多种原型设计模版，多页背景文档，跨页超链接，富文本编辑支持，可导出HTML、PNG、Openoffice、org，Word和PDF等形式的文件。 2 流程设计工具 Visio：用来完成各类流程图、结构图和网络图的制作，本身有很多的组件库，能快速地把业务流程、系统实现流程画出来。 作为一款便于IT和商务人员就复杂信息、系统和流程进行可视化处理、分析和交流的软件。 Visio 可以促进对系统和流程的了解，深入了解复杂信息并利用这些知识做出更好的业务决策。 ProcessOn：提供基于云服务的免费流程梳理、创作协作工具，与同事和客户协同设计，实时创建和编辑文件，并可以实现更改的及时合并与同步。 作为一个在线协作绘图平台,为用户提供最强大、易用的作图工具!支持在线创作流程图、思维导图、结构图、UML图等多种类型图。非常方便制作，然后把制作好的图形按照自行所需要的文件格式进行导出，这样再把制作好的各类图形应用到其他软件中。 3思维导图工具 MindManager：能够帮助你将想法和灵感以清晰的思维导图的形式记录下来，对产品经理梳理产品规划非常有帮助。 作为一款思维导图软件，运用图文并重的技巧，把各级主题的关系用相互隶属与相关的层级图表现出来，把主题关键词与图像、颜色等建立记忆链接。帮助用户组织项目、从项目各分支分配任务给不同的人、将所需单独的待做事项和工作完整规划从而保证项目成功。 XMind：能够绘制思维导图，还可以绘制鱼骨图、二维图、树形图、逻辑图和组织结构图，还可以很方便地在这些展示形式之间进行转换。 作为一款商业思维导图软件，协助用户快速捕捉创意与灵感，通过直观、友好的图形化操作界面，将思想、策略及商务信息转化为行动蓝图，全面提升企业办公效能。 4数据分析工具 GrowingIO：依托于快速部署无埋点技术，实时采集全量行为数据，通过搭建完整的数据监控体系，高效管控核心业务指标，帮助企业用数据驱动业务增长，挖掘更多商业价值。 作为一款基于用户行为的数据分析产品，提供全球领先的数据采集和分析技术。企业无需在网站或app中埋点，即可获取并分析全面、实时的用户行为数据，以优化产品体验，实现精益化运营，用数据驱动用户和营收的增长。 百度指数（Baidu Index）：可以研究关键词关注趋势、洞察网民需求变化、监测媒体舆情趋势、定位数字消费者特征。还可以从行业视角，分析市场特点、洞悉品牌表现。 作为一个以百度海量网民行为数据为基础的数据分享平台。可统计某个关键词在百度的搜索规模有多大，一段时间内的涨跌态势以及相关的新闻舆论变化，关注这些词的网民是什么样的，分布在哪里，同时还搜了哪些相关的词，帮助用户优化数字营销活动方案。 酷传：提供方便快速的免费上传服务，一键发布到几十家应用商店，自动区分渠道包，快捷查询渠道数据，一站监控APP在多家主流应用商店的下载量、排名、评分、评论等数据。 作为国内最大的APP发布与监控平台，传致力于通过大数据和技术手段为企业解决手机端获客问题。为中国开发者提供专业的移动应用分发工具、实用组件以及平台式推广服务，积极的帮助开发者推广他们的产品。目前有应用发布、应用监控和酷传推广手册三个产品。 5 项目管理工具 ScrumWorks Pro：在版本迭代或敏捷开发中，能够帮助团队管理Scrum的项目、跟踪每次迭代与整个版本发布的过程。 作为一个敏捷项目管理工具，提供了桌面客户端和Web客户端——桌面客户端具有全部特性，而Web客户端则提供了Spring的一个视图，用于更新任务状态和任务估算。 Worktile：致力于解决企业员工工作效率，加强团队成员之间协作与沟通，进而提升企业核心竞争力。 作为一款团队协作的项目管理工具，以项目应用为核心，连接IM、日历、网盘、审批、简报等应用，打通企业内部所有沟通渠道，简化工作流程、提高企业整体工作效率。 腾讯TAPD：贯穿敏捷研发生命周期，提供敏捷协作解决方案，满足不同客户场景需要。 作为敏捷产品研发协作平台,提供看板、在线文档、敏捷需求规划、迭代计划&amp;跟踪、任务工时管理、缺陷跟踪管理、测试计划&amp;用例、持续集成、持续交付&amp;部署等可配置功能，帮助团队可视化工作进展、沉淀分享项目知识、提升团队协作效率。 6 文档协作工具 石墨文档：能够撰写产品需求文档，整理用户反馈，更新bug修复与新功能实现情况等，还可与团队在线协作。 作为一款在线协作文档工具,Web 端和移动端全覆盖,支持多人同时对文档编辑和评论,让你与他人轻松完成协作撰稿、方案讨论、会议记录和资料共享等。 有道云笔记：高效文档管理，OCR扫描，多端同步，解决了个人资料和信息跨平台跨地点的管理问题。 作为一款云笔记软件，操作简单，可以帮助你自动同步笔记、添加多格式的附件、分享到任意平台等。为用户提供高效便捷的使用体验，可以随时随地对线上资料进行编辑。-END-","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"实例解析：怎么撰写一份产品数据报告","slug":"产品方法/实例解析：怎么撰写一份产品数据报告","date":"2019-07-06T10:19:11.000Z","updated":"2019-07-06T12:03:15.542Z","comments":true,"path":"undefined/产品方法/实例解析：怎么撰写一份产品数据报告/","link":"","permalink":"http://yoursite.com/undefined/产品方法/实例解析：怎么撰写一份产品数据报告/","excerpt":"","text":"产品数据报告是产品和运营人必不可少的工作，无论是周报、月报，还是新版本表现的分析报告，都需要在围绕报告目标的基础上，对数据进行整理、分析并提炼要点，最后形成一份有指导意义、易读且美观的数据报告。本文从撰写步骤的角度，总结如何从0开始撰写一份产品数据报告。 文章纲要如下： 报告就是向某一人群进行汇报，那么首先就要明确报告的对象，从报告对象的角度组织内容、结构，以及报告里各个模块的侧重点。 举例来说，如果报告是面向公司领导层的，例如：公司业务线的例行汇报，或是向产品线leader汇报新产品或新版本的表现，这时候报告要突出的就是关键指标有没有达到预期，各个关键指标为什么是这个表现，需要通过拆解成细化的指标来简要说清楚问题出在哪里，或是优秀表现的原因是什么，最后总结团队下一步的改进计划。 如果是面向团队的业务同事的，那报告的侧重点就在于挖掘问题点，并提出改进方案或建议，要起到的是用数据驱（che）动（pi）团队的作用。 如果是对外公开的报告，则一般侧重的是结果和趋势，而不是过程。这一类就是咨询机构们公开发布的那些报告的范式了。 明确了报告的定位之后，那么就可以结合报告定位和产品目标、活动运营目标等指标，对核心指标进行拆解，形成报告的数据模型。 例如：如果是电商类产品，并向领导汇报，那么可能核心指标就是GMV，GMV是用户数乘以客单价，那么我们一步步进行拆解就如下图所示：需要指出的是，报告的核心指标和拆解是动态的，在产品的不同阶段，数据模型也需要进行调整。例如：一个产品中前期阶段关注的可能是用户规模，到达一定用户规模之后，就需要开始重点关注用户价值了，而数据模型也就需要随之调整。 数据的整理和分析 1. 数据的获取数据的来源比较多，需要根据不同指标的需要，选取稳定可靠的数据来源。常见的数据来源包括： 公司自有数据统计系统； 第三方数据统计平台，例如：友盟、百度等； 第三方业务平台，例如：广告联盟等； 公开的数据源。 其中有很多数据是有多个来源的，例如：用户的基础数据一般公司自行统计和第三方平台都有，而对外合作的数据则是自行统计和第三方业务平台都有。对于和钱有关的数据，例如：订单数、金额明细等，一般来说必须要有严格的对账系统来核对和平账。但对于用户数据出现差异，一般需要对统计口径和统计方案进行分析，如果是统计手段层面造成的差异则可以忽略。这里需要注意的是，如果一个数据来源出现大幅异常波动，往往可以借助另一个数据来源进行对比分析，如果两边是同方向、同幅度的波动，则要从业务角度去分析，如果两边差异很大，则很可能是数据统计源头出了问题。 2. 数据的整理、清洗数据的整理和清洗主要是排除脏数据和统计异常的数据、对数据进行结构化处理等等，这里就不展开了。 3. 分析数据：重要的是思维对于数据分析，思维比工具和手段重要，首先要明确想找到什么问题，再提出假说然后依据假说去排查，而不是在海量数据中无目的查找问题。分析的步骤，我认为个家的总结已经非常到位，这里罗列如下，有兴趣的可以读下《数据分析能力的核心是思维》一文详细了解： 感知问题； 提出假说； 选择表征； 收集数据； 分析验证。4. 分析数据的方法 法：对一个大问题拆分为更小粒度的指标，如果没有发现问题则继续往下拆解，直到发现问题所在为止，从而寻找到对应的解决方案。 BCG矩阵：根据不同业务场景，选取两个坐标作为坐标轴，从而把业务或用户划分为不同的类型进行分析。 同比分析法：将各个业务相同类型的数据放在一起比较。 用户分析：用户分析包括了使用广度、使用深度、使用粘性等指标，这些指标一般是若干用户指标的组合，例如：使用广度就包含了总用户数和MAU等，使用深度就包含了使用时常、停留时间等。 分析数据的方法有很多种，需要根据报告定位和目标的需要适当选取。 实例解析：一份产品月报的撰写我这里以一份产品月报的撰写为例，供大家参考数据报告的撰写。首先这是一份面向领导汇报的产品运营月报，因此需要突出核心指标的完成情况，以及拆解的二级、三级指标的情况，从而从上到下分析本月指标的完成情况。其次，这是一个电商导购类的产品，因此在报告的第一项，就是依据产品特性，对数据指标进行拆解和建立数据模型，从而让读者一目了然知道报告的内容框架，以及各项数据的完成情况，之后才是逐步展开进行汇报，便于说清楚具体情况、问题点、改进计划。 指标拆解示例 目前MAU量级数百万，因此产品阶段还侧重在用户增长，其次才是收入； 监控指标根据实际情况可以随时调整，以便说明问题。 数据总表示例拆解完数据指标，建立模型之后，就是要展示出重点的数据、形成数据总表，从而让报告的阅读者一目了然知道核心指标完成情况，以及哪些数据超出预期、哪些数据出现问题。如下表所示，未达预期部分的目标完成度加黑，引导大家聚焦在问题的分析上： 核心指标示例指标的展示有以下几点需要注意： 图形样式需要根据报告的汇报侧重点来选取，例如展示体量变化可以用柱状图、展示趋势可以用折线图、展示不同业务同一指标的对比可以用簇状柱图等等； 一个表格最多展示一个主要数据和一个次要数据，例如：MAU+环比增长率； 数据情况的原因说明最好不超过2个，切忌罗列一堆原因，让阅读者找不到重点。 核心指标拆解分析如上例核心指标为MAU，则需要对当月活跃用户的构成进行分析，并可以顺便带出月留存率。 渠道分析示例这里以渠道新增分析示例，适合于对比多个同类数据的情况，例如同时查看免费渠道和付费渠道的新增用户情况。且由于更关注免费自然流量新增，因此还可以再带上免费新增的增长折线便于解释说明。由于重点是免费渠道，因此可以继续对免费渠道进行详细分析： 留存用户分析示例留存用户的分析，除了分析总留存人数之外，还常用如下的梯形表格分析动态时间周期内的留存率变化情况： 人均活跃天数示例人均活跃天数是考察用户活跃情况的重要指标，一般用折线图来展示变化趋势： 人均活跃天数同样可以根据业务需要，继续细化分析不同渠道、不同机型、不同操作系统等等的详细数据。 收入统计示例收入类型的统计，比较适合先用一个总表展示出整体的情况，然后再细分不同的收入指标，选择合适的图表进行展示： 总结产品数据报告的撰写，首先要基于阅读者和产品核心指标的分析，对指标进行拆解和建模、确定整个报告的内容框架和侧重点，然后对数据进行整理、分析和制表，最后的工作才是对报告进行美化。 本文由 @ Alex 原创发布于人人都是产品经理。题图来自Unsplash，基于CC0协议","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"怎样才算写了一份好的产品说明书？","slug":"产品方法/怎样才算写了一份好的产品说明书？","date":"2019-07-06T10:18:04.000Z","updated":"2019-07-06T12:03:15.542Z","comments":true,"path":"undefined/产品方法/怎样才算写了一份好的产品说明书？/","link":"","permalink":"http://yoursite.com/undefined/产品方法/怎样才算写了一份好的产品说明书？/","excerpt":"","text":"你生活的方方面面，背后都有本说明书。你可能觉得，说明书不过是包装袋里调出来的一本小册子而已。其实不然，说明书不仅形式多样，甚至它还不是现代产物，它们已经存在了至少两个世纪。说明书不仅是本实用的指导手册，它还能披露当时的时代和社会面貌，说明书的演变过程也揭示了消费者的演变轨迹。手册借助用户的能力来弥补机器的不足，因此它可反映出当时机器和人的情况。 一、基本原则工业时代最早的一份使用说明是工程师瓦特（James Watt）制造的一部机器的说明，但不是蒸汽机，而是办公用复印机。瓦特发现他经常需要制作信件副本，于是发明了一部机器，将墨迹还未干的信纸复印到另一张纸上，制成一个副本。产品说明简单明了：取一张纸，放到另一张纸上，将原稿放在上面，通过滚筒。2009 年 BBC 的一部纪录片《如何撰写说明书》里就提到：瓦特非常务实，所以使用说明不是本小册子，而是贴在机器上的一张纸，这样你就不会弄丢了，现在的制造商也该好好效仿。这个小故事其实已经体现了一本好的说明书的基本原则： 首先是「好找」，方便用户找到所需信息，以及内容能为用户设身处地，预见用户可能遇到的问题和处理方法。 其次是通俗易懂，语言和设计都要简单明了。 最后是「开门见山」，这是说要确保用户在问题解决之后知道下一步要做什么，无论是发现其他问题或是继续使用产品。重要贴士不过并非所有说明书都是瓦特的这种形式。现在的制造商们开始将使用说明附着在产品上，譬如：在发电机侧面贴上写有使用说明的大标签，或是在发电机的控制板上设置一个弹出式的帮助文件。另一个早期说明书的范例属于一款早期相机，柯达 Box Brownie。除了详细介绍相机操作方法外，这本说明书还讲解了如何拍摄优秀照片，包括如何捕捉最佳人像、如何考虑天气因素影响（艳阳天、阴云天），甚至室内墙壁颜色的明暗等。现代品牌哈里剃须刀也采用了同样方法，不止告诉顾客如何使用产品，还说明了如何获得最佳效果——对哈里剃须刀而言是完美剃须的小秘方。 ![](https://cdn.nlark.com/yuque/0/2019/jpeg/350999/1562408318308-0396c42c-3713-4eec-b7ad-af3679093352.jpeg#align=left&amp;display=inline&amp;height=405&amp;originHeight=405&amp;originWidth=720&amp;size=0&amp;status=done&amp;width=720) &lt;br /&gt;**通过说明书建立更个人化的联系很有商业意义。**消费者如果对产品感觉良好，日后对该品牌会更有购买倾向。 视觉阅读有些说明书完全摒弃了文字，譬如：瑞典家具巨头宜家。有些人认为宜家这种无文字说明令组装家具非常简单，有些则被那些象形图搞得晕头转向。但至少，图片说明帮公司节省了文字翻译成本。宜家的说明书获得了国际认可，2015 年赢得保罗•米森纳设计功能组别大奖 （Paul Mijksenaar Design for Function Award）。该奖项的策划人视觉设计专家米森纳（Paul Mijksenaar）这样评价： 宜家创造了一套无与伦比、风格一致、精美绝伦的说明书作品集，不仅辨识度高，而且 30多年来都证明实用有效。 那我们为何有时看不明白宜家说明书呢？并不是因为说明书不好，而是产品设计得太复杂。宜家的说明书都是以产品为基础，最不受欢迎的说明书是因为该产品本身设计有不足。宜家说明书采用黑白平面插图的做法也促使产品本身提升设计质量，务求能简便组装。 宜家获奖的说明书完全不使用文字不过现在，机器的能力已经大大提升，用户不太需要说明也能使用，而且很多说明也能在真正使用时由机器提供。很多产品没有说明书，有些是因为设计优良完全不需要，有些则是因为不允许。譬如 iPhone 就专门设计得难以维修。说明书短期内不会消失的一个原因是它目前必须包含健康及安全指引，有些用户觉得这些指引非常多余，但它们体现了制造商对用户使用产品时的安全负责。另一个影响说明书演变的因素是全球化，公司需要将产品运送至世界各地，有时需要将说明翻译成几十种语言，稍有不慎就会给用户造成疑惑和困扰，有损品牌形象。消费者使用说明书的方式也发生了改变，过往说明书只是依附于产品的参考指南，但现在人们会在购买前阅读说明书了解产品的技术性能，因此说明书进入到购买的环节。 说明书的形式也在变化 它可以是介绍越野车各项性能的一段YouTube视频； 也可以是一个专门网站，帮助企业了解新出的复杂电话系统； 还可以是用户在网上发布的指南，用来解决智能手机问题。 近年来网站科技还让用户可以自行创建并分享使用说明，譬如：Ifixit.com 就是个“任何人都可以参与编写维修任何东西的免费指南”。 未来发展数据库和 XML 标记语言（可由人自定义并被计算机理解的标记符号）已经广泛用于说明书的模块式编写和管理当中，也可以使用二维码来快速获取相关说明。AI、AR、VR 等技术也开始被采用，AI 可以预测用户遇到的问题，更快找到相关信息。随着人工智能逐步理解用户行为，它很可能会广泛取代计算机元数据和卷标。AR、VR 可以将说明层次化，用户可以在学习使用产品的同时与它互动。无论使用说明未来是什么样子，它应该都不会消失，人们在购买复杂产品时的基本需求没有改变，产品本身与用户预期也总会有差别，需要说明填补。作者：Aceyclee链接：https://zhuanlan.zhihu.com/p/36213733本文由 @Aceyclee 授权发布于人人都是产品经理题图来自Unsplash，基于CC0协议","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"用户认知地图","slug":"产品方法/用户认知地图","date":"2019-07-06T10:17:12.000Z","updated":"2019-07-06T12:03:15.543Z","comments":true,"path":"undefined/产品方法/用户认知地图/","link":"","permalink":"http://yoursite.com/undefined/产品方法/用户认知地图/","excerpt":"","text":"什么是认知地图？认知地图是指不断地强化对某个事物的认识，可以在人的脑子里形成一张认知地图。 所谓“认知地图”，就是一个人看问题的价值框架。 比如两小儿辩日中，因双方看问题的价值框架不同，分别以“大小”和“冷热”来评判太阳远近，这就是典型的不同认知地图而获得不同答案。 当然，有时候不同的认知地图，也可能获得相同答案，比如“如果摸到滚烫的东西，我们就想到可能会被烧伤”。 每个人的认知地图都独一无二，基于个人独特的生活经历而形成，我们靠自己特有的认知地图来获得事物结论。 那么，在你的认知地图中，你认为：「小红和小刚，谁更可能喜欢变形金刚？」 用户对产品是如何认知的？在产品到达用户的过程中，作为产品设计者，是最清楚自己的产品，然后通过产品设计、研发上线后传达给用户，用户拿到产品后再进行理解。在这个过程中，你所设计的“产品”是通过你的认知地图，用户理解你的产品是通过用户的认知地图，而在这个过程中，受限于各自的认知地图不同，这个过程中必然会存在“失真”。 对产品设计的启发既然如此，我们在思考产品方案的时候是不是就可以通过两个角度考虑： 1、减少产品失真减少产品到用户时的失真，最有效的一个方法是，将已有的事物认知迁移到你的产品之中中。举例说明：这里提一个比较经典的案例，苹果的窗口设计按钮，对于一个不怎么使用电脑的人也能很快的理解并记住 这三个按钮代表的是什么。其奥秘在于，红黄绿三个颜色迁移至大家对红绿灯的认知。红-禁止-退出（停止运行）黄-暂停-最小化（稍后继续）绿-通行-最大化（集中工作） 通过用户对红绿灯的及通用认知，将这种认知迁移到mac的窗口设计中。 2、统一产品理解了解到用户存在不同认知，我们就可以通过产品设计，将用户在心理的不同认知进行“强制”统一。举例说明：这个最典型的例子就是APP的新手引导，通常我们在使用一个APP，如果是新用户，我们会提供一个简短的新手引导，来引导其与老用户的心里认知一致。 参考文献[1]Cognitive map-wikipedia[2]认知地图效应 -MBAlib","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"ORID读书模型","slug":"产品方法/ORID读书模型","date":"2019-07-06T10:14:32.000Z","updated":"2019-07-06T12:03:15.543Z","comments":true,"path":"undefined/产品方法/ORID读书模型/","link":"","permalink":"http://yoursite.com/undefined/产品方法/ORID读书模型/","excerpt":"","text":"ORID是一种思维套路，它也叫《焦点讨论法》（The Focused Conversation Method），它可以：把工作生活中的问题想明白的最简洁有效的方法，并产生有效的行动指南。我们看看几个关键词：把问题想明白；最简洁有效，据说可以节省三分之一的时间；得出结论，并产生行动指南。ORID聚焦讨论法可以用于很多领域，比如你每天的反思回顾，一场培训的回顾，一个方案的评估，甚至用于面试应试人员，讨论工作标准等等。有一本书《The Art of Focused : Conversation 100 Ways to Access Group Wisdom in the Workplace》，详细讲述了这种方法在100种场景的应用。这种套路，是目前国外最流行的”引导方式“，就是通过引导师的问题，让团队或个人理清自己的思路，把存在的问题想清楚，并得出正确的行动指南。ORID 是四个英文单词的缩写： O:Objective（客观）R:Reflective（反映）I:Interpretive（诠释）D:Decisional（决定） ORID的流程实际上完全是根据我们人类正常的思维模式来进行：O：对客观事物的感受。通过用我们的五官，来感受到客观事物的视觉形象、味觉感觉、触觉感觉、听觉感觉、嗅觉感觉。实际上就是感受我们以为的客观世界的样子。比如你看到的大海，听到的音乐，读过的书的章节，你的手机，等等。R：就是我们对客观事物的直接的感受，这个感受，上升到了大脑层面，而不是感官层面。大脑层面就包括了我们的心理感受，我们的印象，我们的情感反应等等这些大脑的初级印象。比如我们看到一头大象，我们的感受是很大，鼻子很长，等等。I：通过我们的感受，再经过大脑的思考，对客观的事物进行自己的分析，解释，阐述，形成我们自己的观念；D：通过我们的分析诠释，阐述得出的观点，结论，来指导我们的行动。所以，我们看到，ORID的过程就是我们的正常的思维过程。那么它为什么有效呢？不同在哪里呢？有经验的引导师，会作出有效的问题模型，在O、R、I、D这四个阶段，深入解决问题，让你达到深入思考，得出正确有价值的结论的效果来。我们用具体的例子来说明一下这种方法等有效性。著名的编程大咖，获得过facebook编程大赛一等奖的xdite，在她的全栈课上，为学员制定了这样一个ORID的套路：O：客观 关于今天的课程，你记得什么？ 完成了什么？ R：反映 你要如何形容今天的情绪 今天的情绪高峰是什么? 今天的低点是什么? I：诠释 我们今天学到了什么? 今天一个重要的领悟是什么? D：决定 我们会如何用一句话形容今天的工作 有哪些工作需要明天继续努力? 我们先看看O。首先，回顾当天学习的内容，这些学习的课程，作用于你的各种感觉器官，让你产生了对学习内容的初步概念。再看看R：这是对当天学习的内容，给予你感官刺激的回顾。这个回顾的价值，是让你对所学内容产生正反馈，就是让你兴奋起来。再看I，这个部分，就是让你理性地思考学到的内容，而不是仅仅停留在感性的兴奋。通过这个部分的思考，把学习的东西，跟你大脑已有的知识进行整合，能够使学到的技能知识进入到你的永久记忆，是让你真正学到，而不是学过。我们很多人学习的时候，只是处在学过的阶段而不是学到。如果在每天的回顾中，没有了I这个环节，也就是没有达到学到的效果，那么到最后的结果就是，一场培训下来，犹如熊瞎子掰苞米。再看看D。这个部分，是对今天学到的内容的最终总结，同时，给自己提出一个问题，根据今天学到的，或者说学过而没有学会的东西来提出问题，我们明天该怎么做？所以，我们看到，ORID过程，就是对客观学习的内容，进行感性的感知，然后再上升到理性的分析，最后，得出结论以后，确定了下一步的行动方向跟计划。为什么说，ORID简洁有效呢？简洁有效，是通过提出正确的问题来实现的。我们通常对客观事物的认知过程，基本都是自动完成，各个阶段的问题也都是我们自己自发的提出，然后解决，或产生新的问题。而ORID则是有专家根据你的实际情况，为你设计一套有效的问题，然后用你自己的思维模式，通过对问题的解答，获得正确的结论，和有效的行动指南。而正确的提问，源自引导师的设计。当然，你也可以通过自己的努力，给自己提出有效的问题，来完成ORID循环。ORID可以用在哪些领域？在《100种提问力创造200倍企业力》这本书中，提供了100个场景，进行ORID的提问引导操作。下面列举几个例子供大家参考： A1回顾过去的一年 A2回顾一场工作坊 A3回顾一场由顾问做的演示 A4回顾一场规划会议 A5回顾当日的工作 A7评估一个研修班 B3准备产品简介 B10策划员工聚会 C5讨论一系列的工作标准 C10化解长久以来的误解 D2分享文章 E1帮助一位同事思考以做出决定 E2在团队中分配任务 F3面试应聘者 G1对今天的省思 G9为同事庆生 ORID有什么用？ ORID 以前主要用于会议讨论、培训。通过四个层次循序渐进的提问，引导回答者从事情的表象进行深层次的思考，并最终作出行为的决策。 Xdite老师说，自从使用了ORID进行每日反思，自己再也不会犯以前那些一犯再犯的错误了，进步神速。 如何用ORID，进行每日学习反思？xdite 老师给出了模板：Objective 客观： 关于今天的课程, 你记得什么? 完成了什么? Reflective 感受 你要如何形容今天的情绪 今天的高峰是什么? 今天的低点是什么? Interpretive 解释反思 我们今天学到了什么? 今天一个重要的领悟是什么? Decisional 决定行动 我们会如何用一句话形容今天的工作 有哪些工作需要明天继续努力? 四个层次，层层递进，条理层次。 总的来说，就是描述：今天学习的状况，分享你的感受，接着反思，解释你学习的内容意义，最后做出决定，明天该如何改进学习。 举个栗子：郭靖跟洪七公学降龙十八掌的日记： Objective 客观： 关于今天的课程, 你记得什么? 今天学习了第二式 飞龙在天。 完成了什么? 今天是学习的第三天，终于学会了第二招，飞龙在天。 Reflective 感受 你要如何形容今天的情绪。 非常高兴，终于学会了。 今天的高峰是什么? 第一次成功时。气走督脉，跃起半空，提气丹田，放松肌骨，居高下击，打碎大石，一气合成，喜悦之情难以言表。 今天的低点是什么? 上午练了半天，还是记不住“等真气上升之后，放松肌骨，存想玉枕穴间”，觉得自己太笨了，要是蓉儿，早就会了。有些灰心。 Interpretive 解释反思 我们今天学到了什么? 今天学到了降龙十八掌的第二招，飞龙在天。完整口诀记录如下： 气走督脉 行手阳明大肠经商阳，二间，三间，合谷，阳溪，偏历，温溜，下廉，上廉，手三里，曲池，肘髎，手五里，臂臑，肩髃，巨骨，天鼎，扶突，口和髎，迎香._ 此式跃起凌空，居高下击，先声夺人! 以一飞冲天之式上跃双膝微曲，提气丹田，待觉真气上升，放松肌骨，存想玉枕穴间,急发掌劲取敌首,肩,胸上三路。_ 训练中的大坑：真气上升后，不放松，直接发力，则功力只能发挥一成。一定要等真气上升后，再放松肌骨，存想玉枕穴间，再发力。 今天一个重要的领悟是什么? 我虽然笨，但是只要肯花时间刻意练习，不断练习，迟早会学会。 Decisional 决定行动 我们会如何用一句话形容今天的工作 功夫不负有心人。 有哪些工作需要明天继续努力? 明天要更有信心，相信自己绝对可以。继续学习第三招”见龙在田”。 ORID 升级版除了xdite老师列的提纲，大家还可以扩充如下内容：Objective ：全盘式的彻底扫描, 有哪些人、事、物 哪些场景让你印象深刻 你观察到什么 …… Reflective : 从上一层次扫描到的档案，提取自己的想法感受、有趣的，好玩的，怪异的，进一步整理自己的感觉 哪些内容什么让你觉得惊讶、意外？有趣好笑？ 哪些内容让你感受鼓舞？很受感动？ 什么时候让你沮丧？让你特别难过？ 你的直觉反应是什么？ 你记得事情怎么发生的？ 事情发生时你的感想是什么？ …… Interpretive : 提取我们的感官和反应的——意义和重要性。同时可以提出问题，进一步去思考，进一步获得自己内心深处的观点及想法，尝试从不同的角度看待问题。 有什么关键的转折点吗？ 自己到底在表达些什么？ 得到了什么新的知识？ 这里最有意义的是什么？ 为什么对我们很重要？ Decisional ——从众多想法萃取出一个结论， 最后呢？所以呢？打算怎么做？可以抛出结论式问题，或给一句话当作结论。促进自己内化或付诸行动。 解答在哪里？ 明天，你会有什么不同行动？ 有什么要改变的？ 一句话总结要解决的问题 总结提出的解法是什么 要改变的行动是为了什么 ORID 是一种很有效的方法，流程。 记录了12天ORID，我最大的感受是，那些编程学习中的愚蠢的错误，真的可以不再犯了。写下来，你会更加笃信，沿着计划的道路，坚定前行。","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"产品说明书","slug":"产品方法/产品说明书","date":"2019-05-31T02:51:26.000Z","updated":"2019-07-06T12:03:15.544Z","comments":true,"path":"undefined/产品方法/产品说明书/","link":"","permalink":"http://yoursite.com/undefined/产品方法/产品说明书/","excerpt":"","text":"一、简介你生活的方方面面，背后都有本说明书。你可能觉得，说明书不过是包装袋里调出来的一本小册子而已。其实不然，说明书不仅形式多样，甚至它还不是现代产物，它们已经存在了至少两个世纪。说明书不仅是本实用的指导手册，它还能披露当时的时代和社会面貌，说明书的演变过程也揭示了消费者的演变轨迹。手册借助用户的能力来弥补机器的不足，因此它可反映出当时机器和人的情况。 二、基本原则工业时代最早的一份使用说明是工程师瓦特（James Watt）制造的一部机器的说明，但不是蒸汽机，而是办公用复印机。瓦特发现他经常需要制作信件副本，于是发明了一部机器，将墨迹还未干的信纸复印到另一张纸上，制成一个副本。产品说明简单明了：取一张纸，放到另一张纸上，将原稿放在上面，通过滚筒。2009 年 BBC 的一部纪录片《如何撰写说明书》里就提到：瓦特非常务实，所以使用说明不是本小册子，而是贴在机器上的一张纸，这样你就不会弄丢了，现在的制造商也该好好效仿。这个小故事其实已经体现了一本好的说明书的基本原则： 首先是「好找」，方便用户找到所需信息，以及内容能为用户设身处地，预见用户可能遇到的问题和处理方法。 其次是通俗易懂，语言和设计都要简单明了。 最后是「开门见山」，这是说要确保用户在问题解决之后知道下一步要做什么，无论是发现其他问题或是继续使用产品。三、重要贴士不过并非所有说明书都是瓦特的这种形式。现在的制造商们开始将使用说明附着在产品上，譬如：在发电机侧面贴上写有使用说明的大标签，或是在发电机的控制板上设置一个弹出式的帮助文件。另一个早期说明书的范例属于一款早期相机，柯达 Box Brownie。除了详细介绍相机操作方法外，这本说明书还讲解了如何拍摄优秀照片，包括如何捕捉最佳人像、如何考虑天气因素影响（艳阳天、阴云天），甚至室内墙壁颜色的明暗等。现代品牌哈里剃须刀也采用了同样方法，不止告诉顾客如何使用产品，还说明了如何获得最佳效果——对哈里剃须刀而言是完美剃须的小秘方。 ![](https://cdn.nlark.com/yuque/0/2019/jpeg/350999/1559271099596-7e97a07e-027d-4e21-bdee-1e2f33a99734.jpeg#align=left&amp;display=inline&amp;height=405&amp;originHeight=405&amp;originWidth=720&amp;size=0&amp;status=done&amp;width=720) &lt;br /&gt;**通过说明书建立更个人化的联系很有商业意义。**消费者如果对产品感觉良好，日后对该品牌会更有购买倾向。 四、视觉阅读有些说明书完全摒弃了文字，譬如：瑞典家具巨头宜家。有些人认为宜家这种无文字说明令组装家具非常简单，有些则被那些象形图搞得晕头转向。但至少，图片说明帮公司节省了文字翻译成本。宜家的说明书获得了国际认可，2015 年赢得保罗•米森纳设计功能组别大奖 （Paul Mijksenaar Design for Function Award）。该奖项的策划人视觉设计专家米森纳（Paul Mijksenaar）这样评价： 宜家创造了一套无与伦比、风格一致、精美绝伦的说明书作品集，不仅辨识度高，而且 30多年来都证明实用有效。 那我们为何有时看不明白宜家说明书呢？并不是因为说明书不好，而是产品设计得太复杂。宜家的说明书都是以产品为基础，最不受欢迎的说明书是因为该产品本身设计有不足。宜家说明书采用黑白平面插图的做法也促使产品本身提升设计质量，务求能简便组装。 宜家获奖的说明书完全不使用文字不过现在，机器的能力已经大大提升，用户不太需要说明也能使用，而且很多说明也能在真正使用时由机器提供。很多产品没有说明书，有些是因为设计优良完全不需要，有些则是因为不允许。譬如 iPhone 就专门设计得难以维修。说明书短期内不会消失的一个原因是它目前必须包含健康及安全指引，有些用户觉得这些指引非常多余，但它们体现了制造商对用户使用产品时的安全负责。另一个影响说明书演变的因素是全球化，公司需要将产品运送至世界各地，有时需要将说明翻译成几十种语言，稍有不慎就会给用户造成疑惑和困扰，有损品牌形象。消费者使用说明书的方式也发生了改变，过往说明书只是依附于产品的参考指南，但现在人们会在购买前阅读说明书了解产品的技术性能，因此说明书进入到购买的环节。 五、说明书的形式也在变化 它可以是介绍越野车各项性能的一段YouTube视频； 也可以是一个专门网站，帮助企业了解新出的复杂电话系统； 还可以是用户在网上发布的指南，用来解决智能手机问题。 近年来网站科技还让用户可以自行创建并分享使用说明，譬如：Ifixit.com 就是个“任何人都可以参与编写维修任何东西的免费指南”。 六、未来发展数据库和 XML 标记语言（可由人自定义并被计算机理解的标记符号）已经广泛用于说明书的模块式编写和管理当中，也可以使用二维码来快速获取相关说明。AI、AR、VR 等技术也开始被采用，AI 可以预测用户遇到的问题，更快找到相关信息。随着人工智能逐步理解用户行为，它很可能会广泛取代计算机元数据和卷标。AR、VR 可以将说明层次化，用户可以在学习使用产品的同时与它互动。无论使用说明未来是什么样子，它应该都不会消失，人们在购买复杂产品时的基本需求没有改变，产品本身与用户预期也总会有差别，需要说明填补。作者：Aceyclee链接：https://zhuanlan.zhihu.com/p/36213733本文由 @Aceyclee 授权发布于人人都是产品经理题图来自Unsplash，基于CC0协议","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"","slug":"tools/GAP模型","date":"2019-05-12T13:55:53.295Z","updated":"2019-05-12T13:55:53.295Z","comments":true,"path":"undefined/tools/GAP模型/","link":"","permalink":"http://yoursite.com/undefined/tools/GAP模型/","excerpt":"","text":"方法名称5GAP（服务质量差距模型）方法介绍服务质量差距模型是20世纪80年代中期到90年代初，美国营销学家帕拉休拉曼（A.Parasuraman）,赞瑟姆（ Valarie A Zeithamal）和贝利（Leonard L. Berry）等人提出的,5GAP模型是专门用来分析质量问题的根源。顾客差距（差距5）即顾客期望与顾客感知的服务之间的差距——这是差距模型的核心。要弥合这一差距，就要对以下四个差距进行弥合：差距1 ——不了解顾客的期望；差距2——未选择正确的服务设计和标准；差距3——未按标准提供服务；差距4——服务传递与对外承诺不相匹配。 将这个模型套用在产品设计领域中，则可将其引申为了解用户流失的原因，如下图所示 认知缺口 产品经理不知道用户想要的是什么。若出现了认知缺口，则首先是让产品经理清楚知道用户流失的真正原因。 执行缺口 产品经理知道用户想要什么，但实际做出来的产品与设计中的不一致。若出现了执行缺口，则要了解具体哪个执行步骤出现问题，是资源的欠缺还是技术难以实现。 传递缺口 产品的宣传和指引不能让用户对产品真正认知了解若出现了传递缺口则要了解用户现在的感知是怎么样的，在哪些宣传和指引上出现了问题。 流失缺口 用户体验到的产品和期望的不一样。产品阶段产品规划、产品设计、产品运营产品层面战略层、范围层、结构层、框架层、表现层适用市场现有市场、垂直市场、全新市场 方法目的调研目前产品与用户认知之前的差距，并进行优化改进 方法渠道5WHY、对比相关产品、行为分析方法类型 使用步骤**确定调研目的** 确认调研路径 设计调研路径 找出原因 深入追问 了解用户认知与实际的差距 设计改善措施 实践案例参考文献[1]用户流失原因调研四步经[2]服务质量差距模型- MBA智库百科","categories":[{"name":"tools","slug":"tools","permalink":"http://yoursite.com/categories/tools/"}],"tags":[]},{"title":"KANO 模型","slug":"产品方法/KANO 模型","date":"2019-05-12T13:37:14.000Z","updated":"2019-07-06T12:03:15.523Z","comments":true,"path":"undefined/产品方法/KANO 模型/","link":"","permalink":"http://yoursite.com/undefined/产品方法/KANO 模型/","excerpt":"","text":"是不是曾发生想到或用户提出了很多需求，但不知道怎么辨识真正有用的需求，或排期优先级怎么安排的情况？以下介绍一种定性研究，透过问卷调研的方式来了解需求属型与必要性。 一、KANO 模型简介KANO 卡诺模型是由日本狩野纪昭（Noriaki Kano）博士所提出，主要用途是了解需求实现与用户满意度之间的关系，作为产品需求分析与优先级排序的参考依据。KANO 模型定义了三个层次的顾客需求：基本型需求、期望型需求和兴奋型需求，这三种需求根据绩效指标分类就是基本因素、绩效因素和激励因素。在 KANO 模型中，将产品和服务的质量特性分为五种类型： 魅力属性：让用户意想不到，如果不提供此需求，用户满意度不会降低；当提供此需求，用户满意度会有很大的提升。 期望属性：当提供此需求，用户满意度会提升；当不提供此需求，用户满意度会降低。 必备属性：当提供此需求，用户满意度不会提升；当不提供此需求，用户满意度会大幅降低。 无差异属性：无论提供或不提供此需求，用户满意度都不会发生改变，用户根本不在意。 反向属性：用户根本没有此需求，提供后用户满意度反而会下降。 ![](https://cdn.nlark.com/yuque/0/2019/png/282324/1557668261320-d8d55125-2dc6-47ba-93b3-e2d39bf25f29.png#align=left&amp;display=inline&amp;height=1268&amp;originHeight=1268&amp;originWidth=1764&amp;size=0&amp;status=done&amp;width=1764) 二、KANO 模型分析法的基本步骤 步骤一：设计问卷调查表，实施有效的问卷调查KANO 模型的问卷问法，是对每个质量特性都由正向和负向两个问题构成，分别测量用户在面对存在或不存在某项质量特性时的反应。问卷中的问题答案采用五级选项分别是： 我很喜欢：让你感到满意、开心、惊喜。 理应如此：你觉得是应该且必备的功能。 无所谓：你不会特别在意，但还可以接受。 勉强接受：你不喜欢，但可以接受。 我很不喜欢：让你感到不满意。 ![](https://cdn.nlark.com/yuque/0/2019/png/282324/1557668261325-156daeef-174d-4939-94d7-024acd9de900.png#align=left&amp;display=inline&amp;height=342&amp;originHeight=342&amp;originWidth=1460&amp;size=0&amp;status=done&amp;width=1460) &lt;br /&gt;（备注：可疑结果通常不会出现，除非用户理解错误） 步骤二：问卷结果整理，进行数据分析根据问卷结果进行 KANO 模型二维属性归属分析，可得出魅力属性、期望属性、必备属性、无差异属性、反向属性与可疑结果的功能属性归类百分比。除了对属性的归属探讨外，并通过百分比计算出 Better-Worse 系数，表示某功能可以增加满意或者消除很不喜欢的影响程度。 增加后的满意系数 Better/SI=(A+O)/(A+O+M+I) 消除后的不满意系数 Worse/DSI=-1*(O+M)/(A+O+M+I) Better 的数值通常为正，代表如果提供某种功能属性，用户满意度会提升；正值越大越接近 1，表示对用户满意度提升的影响效果越大，上升越快。Worse 的数值通常为负，代表如果不提供某种功能属性，用户的满意度会降低；值越负向越接近-1，表示对用户满意度降低的影响效果越大，下降越快。 因此，根据 better-worse 系数，对系数绝对分值较高的功能/服务需求应当优先实施。 根据 better-worse 系数值，将散点图划分为四个象限： 第一象限期望属性：表示 better 系数值高，worse 系数绝对值也很高的情况，产品提供此功能，用户满意度会提升，当不提供此功能，用户满意度就会降低，应尽力去满足用户的期望型需求。 第二象限魅力属性：表示 better 系数值高，worse 系数绝对值低的情况，不提供此功能，用户满意度不会降低，但当提供此功能，用户满意度和忠诚度会有很大提升。 第三象限无差异属性：表示 better 系数值低，worse 系数绝对值也低的情况，无论提供或不提供这些功能，用户满意度都不会有改变，这些功能点用户并不在意。 第四象限必备属性：表示 better 系数值低，worse 系数绝对值高的情况，当产品提供此功能，用户满意度不会提升，当不提供此功能，用户满意度会大幅降低，说明这些功能是最基本的需求，必须要实现。步骤三：数据解读，将结果落地实施KANO 模型是对功能需求的优先级进行探索，具体情况还需要和业务方进行讨论，结合实际情况后制定可行的产品功能开发优先级顺序，以将调研结果落地实施。三、实际操作案例说明以下以掌上运维APP的问卷调研题目与统计数据作为实例，详细描述数据统计的过程与方式。步骤一：设计问卷问题，发放问卷编制问卷的时候，对每个功能都要有正反两道题来测，正反问题之间的区别需注意强调，防止用户看错题意，功能的解释要能简单描述该功能点，确保用户理解。采用单选矩阵的形式提供作答，举例如下所式：题目：根据报警内容，“掌上运维”提供运维操作建议（如磁盘满了智能推荐执行日志清理等）。![](https://cdn.nlark.com/yuque/0/2019/png/282324/1557668261328-99473333-fee7-4c2f-9e4b-67991f970118.png#align=left&amp;display=inline&amp;height=370&amp;originHeight=370&amp;originWidth=1364&amp;size=0&amp;status=done&amp;width=1364) 步骤二：问卷统计，进行 KANO 模型二维属性归属分析回收问卷后需要先进行数据的清洗，去除非有效的作答数据，接著根据 KANO 模型计算方式进行统计，首先需人为进行答题结果的统计计算，如有用户正向答题很喜欢，负向答题很不喜欢，则统计数字就会交叉落在最右边的第一个格子中，数字加1，已此类推进行数量的统计。 接著统计每种可能下的用户人数占总人数的百分比，来填入下表；之后将下表中标 A、O、M、I、R、Q 的格子中百分比相加，即可得到五种属性对应的百分比。本调查结果可以得到A魅力属性占比为42.1%，O期望属性占比9%，M必备属性占比1.2%，I无差异属性占比38.9%，R反向属性占比1.8%，Q可疑结果占比7%。 步骤三：计算 Better-Worse 系数，明确功能落点象限依据六种属性的百分比，使用上方的计算公式来得出 Better-Worse 系数，Better系数为0.56，Worse系数为-0.11，并根据 better-worse 系数值，将散点图划分为四个象限，落点在于第二象限的魅力属性，发生于 better 系数值高，worse 系数绝对值低的情况，即表示不提供此功能，用户满意度不会降低，但当提供此功能，用户满意度和忠诚度会有很大提升。 步骤四：多个功能需求结果对比进行优先级排序当多个需求进行调研统计后，从需求优先级排序来说，应先满足M必备属性功能，接著是去除R反向属性功能，再满足O期望属性功能，最后满足A魅力属性功能，不过还是要根据业务当下的需求与情况来做调整判断。 四、参考资料 产品需求分析的方法论：https://www.jianshu.com/p/2fb77613286c 使用KANO模型进行需求分析的信息收集：https://www.jianshu.com/p/8c1bd4ba225a 教你一分钟通晓KANO模型分析法：http://www.chinacpda.com/jishu/6550.html","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"UML建模","slug":"tools/UML建模","date":"2019-05-12T11:56:24.000Z","updated":"2019-05-12T13:42:23.062Z","comments":true,"path":"undefined/tools/UML建模/","link":"","permalink":"http://yoursite.com/undefined/tools/UML建模/","excerpt":"","text":"文章内容来自CSDN的 学无止境–有分享有梦想 、http://developer.51cto.com/art/201006/207993.htm、https://mp.weixin.qq.com/s/mqUlXJ3lHVbK_r7z1vlJug等网站内容后续加以整理，如有侵犯版权请联系xiong_cx@outlook.com删除，谢谢。 简介 什么是UML UML这三个字母的全称是Unified Modeling Language，直接翻译就是统一建模语言，简单地说就是一种有特殊用途的语言。 你可能会问：这明明是一种图形，为什么说是语言呢?伟大的汉字还不是从图形(象形文字)开始的吗?语言是包括文字和图形的!其实有很多内容文字是无法表达的，你见过建筑设计图纸吗?里面还不是很多图形，光用文字能表达清楚建筑设计吗?在建筑界，有一套标准来描述设计，同样道理，在软件开发界，我们也需要一套标准来帮助我们做好软件开发的工作。UML就是其中的一种标准，注意这可不是唯一标准，只是UML是大家比较推崇的一种标准而已，说不定以后有一个更好的标准可能会取代它呢!UML并不是强制性标准，没有法律规定你在软件开发中一定要用UML，不能用其它的，我们的目标是善用包括UML在内的各种标准，来提高我们软件开发的水平。 UML有什么用? 有很多人认为，UML的主要用途就是软件设计!也有人认为，如果你不是开发人员，是难以理解UML的。 然而我第一次在实际工作中应用UML的却不是软件设计，而是软件需求分析!当时我们和客户面对面沟通调研需求的时候，直接用类图、顺序图、活动图、用例图等UML。我们并没有因此和客户无法沟通，反而是沟通得更加顺畅。客户在我们的引导下，很快就会读懂这些UML图，因为UML图，让我们和客户的沟通效率和效果更好!你可能觉得很神奇，在后续章节中，我将会为你逐一揭开神奇背后的“秘密”。 UML可帮助我们做软件需求分析和软件设计的工作，在我工作中大概各占了50%的比例，当然在你的实际工作中不一定是这样的比例。UML会让你的需求分析或者软件设计工作更上一层楼，本书将会介绍UML在需求分析方面的最佳实践。 告诉你一个秘密，UML应用于软件需求分析时，其学习门槛将会大大降低!语法复杂度会降低，而且你基本不需要掌握软件开发的知识。只要你对软件需求分析感兴趣，认真学习和应用UML，就很有机会成为软件需求分析高手。 UML的分类 UML分结构图和行为图。 结构型的图(Structure Diagram) 类图(Class Diagram) 对象图(Object Diagram) 构件图(Component Diagram) 部署图(Deployment Diagram) 包图(Package Diagram) 行为型的图(Behavior Diagram) 活动图(Activity Diagram) 状态机图(State Machine Diagram) 顺序图(Sequence Diagram) 通信图(Communication Diagram) 用例图(Use Case Diagram) 时序图(Timing Diagram) 结构是静态的，它描绘结构元素构成的系统或函数，显示结构或运行时体系结构的静态关系，比如类图、对象图、构件图、部署图、包图。行为是动态的，它描绘一个系统或业务过程的行为特征，显示动态模型的视图，比如活动图、状态图、顺序图、通信图、用例图、时序图。每种图形都是从需求或设计的不同层面来描述模型，通过各种模型描述系统的类、对象、关联、职责、行为、接口、用例、包、顺序、协作，以及状态，以便产品经理通过图形化的方式从各个角度了解产品，更好的表达思想，便于交流。常用的UML建模工具，后面章节会详细介绍ProcessOn、Enterprise Architect 、Visio、StarUML、OmniGraffle、ArgoUML。常见的UML建模场景，后面章节会详细介绍业务建模、需求模型、设计模型、实现模型、数据库模型。UML建模重点不在于如何画UML，而是如何运用UML思考方式去管理好一个产品。UML各种图都适用于不同的场景，可从不同角度诠释产品。 结构型的UML介绍及用法 1.类图(Class Diagram)请看下面这个类图：图 1.1 某模具系统类图此图截取自某模具管理系统的业务概念分析图，图中一个一个的矩形就是类，这些类之间有各种线条连接，这些线条表示类之间的关系。类图是分析业务概念的首选，类图可能是使用率最高的UML图。再看下面这个Person类图，这时软件设计时用到的一个图：图 1.2 Person类图该Person类有以下属性(Attribute)：Name(姓名),Sex(性别),Department(部门)等，有以下操作(Operation)：Work(工作)等。类有属性和操作，但用类图分析业务模型时，往往不需要使用操作，如图1.1中的类就只有属性。Attribute有特性、特征等译法，Operation也称作方法，但本书遵循UML中文术语标准，即Attribute为属性，Operation为操作。 2.对象图(Object Diagram)一般情况下只有在软件开发中才会使用到对象图，下面的内容以开发的角度来说明对象图，如果你没有开发经验，阅读起来可能有一点难度。图1.2中的Person类，用代码实例化如下：Person person = new Person();……类(Class)实例化后就是对象(Object)，对象person是类Person的实例，上述代码可以用对象图表示如下：图 1.3 Person类的对象图对象图和类图的样子很相似，对象是类的实例化，“person : Person”表示对象person是类Person的实例。对象图往往只在需要描述复杂算法时才会使用，画出来的对象图往往不会只有一个对象，该图只画了一个对象，其目的是尽量简化以便读者的理解什么是对象图。在需求分析工作中基本上不需要使用对象图，从严谨的角度来看某些情况下应该使用对象图，但我往往还是会用类图来处理，这样更加简便而且容易理解。我们将在类图一章再次讲解对象图。3.构件图(Component Diagram)构件图也叫组件图，两个名字均符合UML中文术语标准。一辆汽车由轮子、发动机等物理部件组成，一个软件往往也是由很多“物理部件”(如：控件、重用构件等)组成的，构件图就是用来描述软件内部物理组成的一种图。下图是某权限构件设计图：图 1.4 某权限构件设计图图1.4右上方有这样标志 的矩形表示一个构件，构件可以再包含构件。软件需求分析工作中，需要用到构件图的情况不是很多，以下情况除外：1. 待开发的系统需要与第三方的系统、原有系统、某些老系统等交互，这时可用构件图描述交互要求。2. 客户对软件设计有某些特殊要求，这时可用构件图来描述要求。构件图有时不会单独使用，还会和部署图一起结合使用。 4.部署图(Deployment Diagram)部署图是用来描述系统如何部署、本系统与其他系统是怎样的关系的一种图，如下图：图 1.5 某24小时便利店的管理系统部署图图中一个个立体的矩形是部署图的“节点”，一个节点表示一个物理的设备，节点之间的线条表示节点间的物理连接关系。大部分客户都会具备一定的IT基础环境(如具备局域网、一些服务器、某些软件平台等)，软件系统需要基于当前的IT基础环境来规划，这时我们可以使用部署图来做这个规划。分析系统的需求，不能忽略系统架构、部署、IT架构等方面的要求，我们要基于客户当前的IT基础环境，做一个最符合客户利益的规划。要活用构件图、部署图来分析需求，需要具备一定的IT基础架构知识和软件设计知识，如果你还不具备相关知识，那么可以考虑抓紧补充相关知识。不过需求分析工作更多的还是分析业务，提炼功能性需求，这部分工作能做好是相当不容易的事情。对于技术方面的非功能性需求分析，可交由有技术背景的专业人士负责。5.包图(Package Diagram)Package有“打包”的意思，包图的主要用途是“打包”类图。用类图描述业务概念时，很多时候会因为业务类太多，而导致类图非常庞大，不利于阅读，这时可以将某些类放入“包”中，通过包图来组织业务概念图。下图是包图的一个示例：图 1.6 包图图中好像文件夹样子的就是一个“包”，包之间的线条表示包之间的关系。 行为型的UML介绍及用法 1.活动图(Activity Diagram)我们将起床到出门上班这个过程画成活动图，可能是这样的：图 1.7 起床到出门上班的活动图 活动图中的一个圆边框框表示一个“活动”，多个活动之间的带箭头线条表示活动的先后顺序，该图只是表达了一个顺序流程，活动图还可以表达分支结构。如果你以前曾学过流程图的话，你会发现活动图和流程图很相似。活动图可能是三种能表示流程的UML图中最接近我们思维习惯的一种，下面来学习另外两种能表达流程的图。 2.状态机图(State Machine Diagram)状态机图又叫状态图，但状态图这个译名并没有译出Machine的意思。状态机图从某个物品的状态是如何变化的角度来展示流程，下图某请假条审批流程：图 1.8 请假处理流程整个请假审批流程是围绕“请假条”这个物体进行的，随着不同的审批阶段，请假条具备不同的状态。我们分析业务流程时会发现很多流程其实是围绕某个物品进行的，这时可考虑使用状态机图。3.顺序图(Sequence Diagram)你去餐厅吃饭，向服务员点餐到服务员送菜上来，这个过程用顺序图可表示如下：图 1.9 点菜的顺序图该图有三个“小人”，每个“小人”下面的文字说明(如：顾客)表示其代表的角色。角色与角色之间有一些线条链接，表示角色之间是如何交互的。该图表示的意思是：顾客向服务员点菜后，服务员将点菜信息传递给厨师，然后厨师做菜，最后再由服务员送菜给你。点菜过程涉及几个环节，每个环节均由不同的角色来负责，如果遇到类似的情况，你可以考虑使用顺序图来分析。用顺序图来分析的好处是能清晰表达整个过程所参与的角色，角色与角色之间的关系，各角色是如何被卷入这个过程当中的。 4.通信图(Communication Diagram)UML1.1时，该图英文名为Collaboration Diagram;UML2.x时，英文名为Communication Diagram。将英文名字直接翻译，原来的英文名字可译为协作图，而新的英文名字译为通信图。通信图是顺序图的另外一种画法，点菜的顺序图，如果用通信图来画可表示如下：图 1.10 点菜的通信图三个“小人”分表表示三种角色：顾客、服务员、厨师;角色之间有直线联系表示他们之间有关系;带序号的文字和箭头，表示角色之间传递的信息。顺序图更强调先后顺序，通信图更强调相互之间的关系。我觉得顺序图实用性更好一点，比通信图能表达更多的信息，更容易读懂，在需求分析工作中我基本不会使用通信图。 5.用例图(Use Case Diagram)下图是用例图的示意图：图 1.11 用例图用例图表达的是什么角色通过软件系统能做什么事情，我们可以使用用例图系统地表达软件系统的绝大部分需求。 6.时序图(Timing Diagram)时序图也叫时间图，时序图是UML中文术语标准的说法，而时间图不是标准的说法。时序图是表示某东西的状态随时间变化而变化的一种图，参见下图：图 1.12 灯的开关状态随时间变化图此图表示在0秒到30秒，灯的状态是关的，30-60秒灯的状态为开，60秒后状态为关。在实际工作中我基本上没有试用过时间图。下面通过这个表格来总结一下我在需求分析工作中应用各种UML图的情况：表 1.13 各种UML图实际应用情况 建模工具 UML建模工具Visio 、Rational Rose、PowerDesign的比较，Visio用得相对较多。 ROSE是直接从UML发展而诞生的设计工具，它的出现就是为了对UML建模的支持，ROSE一开始没有对数据库端建模的支持，但是在现在的版本中已经加入数据库建模的功能。ROSE主要是在开发过程中的各种语义、模块、对象以及流程，状态等描述比较好，主要体现在能够从各个方面和角度来分析和设计，使软件的开发蓝图更清晰，内部结构更加明朗（但是它的结构仅仅对那些对掌握UML的开发人员，也就是说对客户了解系统的功能和流程等并不一定很有效），对系统的代码框架生成有很好的支持。但对数据库的开发管理和数据库端的迭代不是很好。 PowerDesigner原来是对数据库建模而发展起来的一种数据库建模工具。直到7.0版才开始对面向对象的开发的支持，后来又引入了对UML的支持。但是由于PowerDesigner侧重不一样，所以它对数据库建模的支持很好，支持了能够看到的90%左右的数据库，对UML的建模使用到的各种图的支持比较滞后。但是在最近得到加强。所以使用它来进行UML开发的并不多，很多人都是用它来作为数据库的建模。如果使用UML分析，它的优点是生成代码时对Sybase的产品PowerBuilder的支持很好（其它UML建模工具则没有或者需要一定的插件），其他面向对象语言如 C++，Java，VB,C#等支持也不错。但是它好像继承了Sybase公司的一贯传统，对中国的市场不是很看看好，所以对中文的支持总是有这样或那样的问题。 UML建模工具Visio 原来仅仅是一种画图工具，能够用来描述各种图形（从电路图到房屋结构图），也是到VISIO2000才开始引进软件分析设计功能到代码生成的全部功能，它可以说是目前最能够用图形方式来表达各种商业图形用途的工具（对软件开发中的UML支持仅仅是其中很少的一部分）。它跟微软的office产品的能够很好兼容。能够把图形直接复制或者内嵌到WORD的文档中。但是对于代码的生成更多是支持微软的产品如VB,VC++,MS SQL Server 等（这也是微软的传统），所以它可以说用于图形语义的描述比较方便，但是用于软件开发过程的迭代开发则有点牵强。 UML建模工具Visio 、Rational Rose、PowerDesign三种建模工具应用最广：1. Rational Rose，它是ibm的 。2.Microsoft的 Microsoft Office Visio® 2003 3.Enterprise Architect。还有其他工具如PowerDesigner等1.Rational Rose是一种基于UML的建模工具。在面向对象应用程序开发领域，Rational Rose是影响其发展的一个重要因素。Rational Rose自推出以来就受到了业界的瞩目，并一直引领着可视化建模工具的发展。越来越多的软件公司和开发团队开始或者已经采用Rational Rose，用于大型项目开发的分析、建模与设计等方面。从使用的角度分析，Rational Rose易于使用，支持使用多种构件和多种语言的复杂系统建模；利用双向工程技术可以实现迭代式开发；团队管理特性支持大型、复杂的项目和大型而且通常队员分散在各个不同地方的开发团队。同时，Rational Rose与微软Visual Studio系列工具中GUI的完美结合所带来的方便性，使得它成为绝大多数开发人员首选建模工具；Rose还是市场上第一个提供对基于UML的数据建模和Web建模支持的工具。此外，Rose还为其他一些领域提供支持，如用户定制和产品性能改进。具体介绍可参看http://www.uml.org.cn/RequirementProject/200604043.htm2.UML建模工具Visio ® 2003的简介请看http://www.uml.org.cn/UMLTools/psf/Guide.dochttp://www.microsoft.com/china/office/xp/visio/default.asp3.Enterprise ArchitectEnterprise Architect是一个全功能的、基于UML的visual CASE工具，主要用于设计、编写、构建并管理以目标为导向的软件系统。它支持用户案例、商务流程模式以及动态的图表、分类、界面、协作、结构以及物理模型。此外，它还支持C++、Java、Visual Basic、Delphi、C#以及VB.Net。具体可看http://www.softwarechn.com/SparxSystems/sparxsystems_index.htm4.PowerDesigner工具简介请看http://www.uml.org.cn/UMLTools/powerDesigner/powerDesignerToolIntroduction.htm5.EA与Rose UML建模工具比较http://51cmm.csai.cn/casepanel/ST/No061.htm6.uml介绍请看uml中国官方网站，这里有很多关于uml建模和建模工具的介绍http://www.uml.org.cn 使用场景 UML除了用于软件设计，还能用于需求分析； 实际工作中UML是与客户沟通的良好桥梁，在项目需求分析工作中，可直接使用 UML图与客户沟通，并且给客户签署的需求规格说明书中含有大量的UML图； 产品经理角度用UML建模，用例图、状态图、活动图、时序图与类图相对较多。总结UML是Unified Modeling Language的简称，是软件开发界的一套标准，UML不仅可用于软件设计，也可以用于软件需求分析。但UML并不是强制标准，我们应该善用包括UML在内的各种标准来提高我们的水平。UML可分为两类：结构型、行为型，结构性的UML有：类图、对象图、构件图、部署图、包图，行为型的图有活动图、状态机图、顺序图、通信图、用例图、时间图。类图是业务概念模型分析的有利武器，也是面向对象分析能力的强有力训练工具。对象图在需求分析工作中并不常用。构件图、部署图是分析IT基础架构、软件架构等方面需求的有利分析工具，但需要你具备IT基础架构、软件设计方面的知识和经验。包图可用来组织类图，在需求分析工作中应用的机会不是很大。活动图、状态机图、顺序图是分析业务流程的强力武器。活动图的表达思路与流程图很类似，很容易掌握，而且大部分情况下都可以使用活动图来分析业务流程;某流程如果是围绕某个物品进行，该物品在流程中转换多种状态，那么使用状态机图来分析是首选;用顺序图来分析的好处是能清晰表达整个过程所参与的角色，角色与角色之间的关系，各角色是如何被卷入这个过程当中的。通信图可以看作是顺序图的另外一种表达形式，顺序图更强调先后顺序，通信图更强调相互之间的关系。而从我的工作经验看，顺序图更加实用一点。有人会将用例图称作“公仔图”，用例图表达的是什么角色通过软件系统能做什么事情，我们可以使用用例图系统地表达软件系统的绝大部分需求。时间图是表示某东西的状态随时间变化而变化的一种图，我在实际工作中很少有机会能用到这种图实践案例此推文很好的介绍了产品经理用的UML工具并结合具体实践案例进行分析https://mp.weixin.qq.com/s/mqUlXJ3lHVbK_r7z1vlJug","categories":[{"name":"tools","slug":"tools","permalink":"http://yoursite.com/categories/tools/"}],"tags":[]},{"title":"UML建模","slug":"产品方法/UML建模","date":"2019-05-12T11:56:24.000Z","updated":"2019-07-06T12:03:15.524Z","comments":true,"path":"undefined/产品方法/UML建模/","link":"","permalink":"http://yoursite.com/undefined/产品方法/UML建模/","excerpt":"","text":"文章内容来自CSDN的 学无止境–有分享有梦想 、http://developer.51cto.com/art/201006/207993.htm、https://mp.weixin.qq.com/s/mqUlXJ3lHVbK_r7z1vlJug等网站内容后续加以整理，如有侵犯版权请联系xiong_cx@outlook.com删除，谢谢。 简介 什么是UML UML这三个字母的全称是Unified Modeling Language，直接翻译就是统一建模语言，简单地说就是一种有特殊用途的语言。 你可能会问：这明明是一种图形，为什么说是语言呢?伟大的汉字还不是从图形(象形文字)开始的吗?语言是包括文字和图形的!其实有很多内容文字是无法表达的，你见过建筑设计图纸吗?里面还不是很多图形，光用文字能表达清楚建筑设计吗?在建筑界，有一套标准来描述设计，同样道理，在软件开发界，我们也需要一套标准来帮助我们做好软件开发的工作。UML就是其中的一种标准，注意这可不是唯一标准，只是UML是大家比较推崇的一种标准而已，说不定以后有一个更好的标准可能会取代它呢!UML并不是强制性标准，没有法律规定你在软件开发中一定要用UML，不能用其它的，我们的目标是善用包括UML在内的各种标准，来提高我们软件开发的水平。 UML有什么用? 有很多人认为，UML的主要用途就是软件设计!也有人认为，如果你不是开发人员，是难以理解UML的。 然而我第一次在实际工作中应用UML的却不是软件设计，而是软件需求分析!当时我们和客户面对面沟通调研需求的时候，直接用类图、顺序图、活动图、用例图等UML。我们并没有因此和客户无法沟通，反而是沟通得更加顺畅。客户在我们的引导下，很快就会读懂这些UML图，因为UML图，让我们和客户的沟通效率和效果更好!你可能觉得很神奇，在后续章节中，我将会为你逐一揭开神奇背后的“秘密”。 UML可帮助我们做软件需求分析和软件设计的工作，在我工作中大概各占了50%的比例，当然在你的实际工作中不一定是这样的比例。UML会让你的需求分析或者软件设计工作更上一层楼，本书将会介绍UML在需求分析方面的最佳实践。 告诉你一个秘密，UML应用于软件需求分析时，其学习门槛将会大大降低!语法复杂度会降低，而且你基本不需要掌握软件开发的知识。只要你对软件需求分析感兴趣，认真学习和应用UML，就很有机会成为软件需求分析高手。 UML的分类 UML分结构图和行为图。 结构型的图(Structure Diagram) 类图(Class Diagram) 对象图(Object Diagram) 构件图(Component Diagram) 部署图(Deployment Diagram) 包图(Package Diagram) 行为型的图(Behavior Diagram) 活动图(Activity Diagram) 状态机图(State Machine Diagram) 顺序图(Sequence Diagram) 通信图(Communication Diagram) 用例图(Use Case Diagram) 时序图(Timing Diagram) 结构是静态的，它描绘结构元素构成的系统或函数，显示结构或运行时体系结构的静态关系，比如类图、对象图、构件图、部署图、包图。行为是动态的，它描绘一个系统或业务过程的行为特征，显示动态模型的视图，比如活动图、状态图、顺序图、通信图、用例图、时序图。每种图形都是从需求或设计的不同层面来描述模型，通过各种模型描述系统的类、对象、关联、职责、行为、接口、用例、包、顺序、协作，以及状态，以便产品经理通过图形化的方式从各个角度了解产品，更好的表达思想，便于交流。常用的UML建模工具，后面章节会详细介绍ProcessOn、Enterprise Architect 、Visio、StarUML、OmniGraffle、ArgoUML。常见的UML建模场景，后面章节会详细介绍业务建模、需求模型、设计模型、实现模型、数据库模型。UML建模重点不在于如何画UML，而是如何运用UML思考方式去管理好一个产品。UML各种图都适用于不同的场景，可从不同角度诠释产品。 结构型的UML介绍及用法 1.类图(Class Diagram)请看下面这个类图：图 1.1 某模具系统类图此图截取自某模具管理系统的业务概念分析图，图中一个一个的矩形就是类，这些类之间有各种线条连接，这些线条表示类之间的关系。类图是分析业务概念的首选，类图可能是使用率最高的UML图。再看下面这个Person类图，这时软件设计时用到的一个图：图 1.2 Person类图该Person类有以下属性(Attribute)：Name(姓名),Sex(性别),Department(部门)等，有以下操作(Operation)：Work(工作)等。类有属性和操作，但用类图分析业务模型时，往往不需要使用操作，如图1.1中的类就只有属性。Attribute有特性、特征等译法，Operation也称作方法，但本书遵循UML中文术语标准，即Attribute为属性，Operation为操作。 2.对象图(Object Diagram)一般情况下只有在软件开发中才会使用到对象图，下面的内容以开发的角度来说明对象图，如果你没有开发经验，阅读起来可能有一点难度。图1.2中的Person类，用代码实例化如下：Person person = new Person();……类(Class)实例化后就是对象(Object)，对象person是类Person的实例，上述代码可以用对象图表示如下：图 1.3 Person类的对象图对象图和类图的样子很相似，对象是类的实例化，“person : Person”表示对象person是类Person的实例。对象图往往只在需要描述复杂算法时才会使用，画出来的对象图往往不会只有一个对象，该图只画了一个对象，其目的是尽量简化以便读者的理解什么是对象图。在需求分析工作中基本上不需要使用对象图，从严谨的角度来看某些情况下应该使用对象图，但我往往还是会用类图来处理，这样更加简便而且容易理解。我们将在类图一章再次讲解对象图。3.构件图(Component Diagram)构件图也叫组件图，两个名字均符合UML中文术语标准。一辆汽车由轮子、发动机等物理部件组成，一个软件往往也是由很多“物理部件”(如：控件、重用构件等)组成的，构件图就是用来描述软件内部物理组成的一种图。下图是某权限构件设计图：图 1.4 某权限构件设计图图1.4右上方有这样标志 的矩形表示一个构件，构件可以再包含构件。软件需求分析工作中，需要用到构件图的情况不是很多，以下情况除外：1. 待开发的系统需要与第三方的系统、原有系统、某些老系统等交互，这时可用构件图描述交互要求。2. 客户对软件设计有某些特殊要求，这时可用构件图来描述要求。构件图有时不会单独使用，还会和部署图一起结合使用。 4.部署图(Deployment Diagram)部署图是用来描述系统如何部署、本系统与其他系统是怎样的关系的一种图，如下图：图 1.5 某24小时便利店的管理系统部署图图中一个个立体的矩形是部署图的“节点”，一个节点表示一个物理的设备，节点之间的线条表示节点间的物理连接关系。大部分客户都会具备一定的IT基础环境(如具备局域网、一些服务器、某些软件平台等)，软件系统需要基于当前的IT基础环境来规划，这时我们可以使用部署图来做这个规划。分析系统的需求，不能忽略系统架构、部署、IT架构等方面的要求，我们要基于客户当前的IT基础环境，做一个最符合客户利益的规划。要活用构件图、部署图来分析需求，需要具备一定的IT基础架构知识和软件设计知识，如果你还不具备相关知识，那么可以考虑抓紧补充相关知识。不过需求分析工作更多的还是分析业务，提炼功能性需求，这部分工作能做好是相当不容易的事情。对于技术方面的非功能性需求分析，可交由有技术背景的专业人士负责。5.包图(Package Diagram)Package有“打包”的意思，包图的主要用途是“打包”类图。用类图描述业务概念时，很多时候会因为业务类太多，而导致类图非常庞大，不利于阅读，这时可以将某些类放入“包”中，通过包图来组织业务概念图。下图是包图的一个示例：图 1.6 包图图中好像文件夹样子的就是一个“包”，包之间的线条表示包之间的关系。 行为型的UML介绍及用法 1.活动图(Activity Diagram)我们将起床到出门上班这个过程画成活动图，可能是这样的：图 1.7 起床到出门上班的活动图 活动图中的一个圆边框框表示一个“活动”，多个活动之间的带箭头线条表示活动的先后顺序，该图只是表达了一个顺序流程，活动图还可以表达分支结构。如果你以前曾学过流程图的话，你会发现活动图和流程图很相似。活动图可能是三种能表示流程的UML图中最接近我们思维习惯的一种，下面来学习另外两种能表达流程的图。 2.状态机图(State Machine Diagram)状态机图又叫状态图，但状态图这个译名并没有译出Machine的意思。状态机图从某个物品的状态是如何变化的角度来展示流程，下图某请假条审批流程：图 1.8 请假处理流程整个请假审批流程是围绕“请假条”这个物体进行的，随着不同的审批阶段，请假条具备不同的状态。我们分析业务流程时会发现很多流程其实是围绕某个物品进行的，这时可考虑使用状态机图。3.顺序图(Sequence Diagram)你去餐厅吃饭，向服务员点餐到服务员送菜上来，这个过程用顺序图可表示如下：图 1.9 点菜的顺序图该图有三个“小人”，每个“小人”下面的文字说明(如：顾客)表示其代表的角色。角色与角色之间有一些线条链接，表示角色之间是如何交互的。该图表示的意思是：顾客向服务员点菜后，服务员将点菜信息传递给厨师，然后厨师做菜，最后再由服务员送菜给你。点菜过程涉及几个环节，每个环节均由不同的角色来负责，如果遇到类似的情况，你可以考虑使用顺序图来分析。用顺序图来分析的好处是能清晰表达整个过程所参与的角色，角色与角色之间的关系，各角色是如何被卷入这个过程当中的。 4.通信图(Communication Diagram)UML1.1时，该图英文名为Collaboration Diagram;UML2.x时，英文名为Communication Diagram。将英文名字直接翻译，原来的英文名字可译为协作图，而新的英文名字译为通信图。通信图是顺序图的另外一种画法，点菜的顺序图，如果用通信图来画可表示如下：图 1.10 点菜的通信图三个“小人”分表表示三种角色：顾客、服务员、厨师;角色之间有直线联系表示他们之间有关系;带序号的文字和箭头，表示角色之间传递的信息。顺序图更强调先后顺序，通信图更强调相互之间的关系。我觉得顺序图实用性更好一点，比通信图能表达更多的信息，更容易读懂，在需求分析工作中我基本不会使用通信图。 5.用例图(Use Case Diagram)下图是用例图的示意图：图 1.11 用例图用例图表达的是什么角色通过软件系统能做什么事情，我们可以使用用例图系统地表达软件系统的绝大部分需求。 6.时序图(Timing Diagram)时序图也叫时间图，时序图是UML中文术语标准的说法，而时间图不是标准的说法。时序图是表示某东西的状态随时间变化而变化的一种图，参见下图：图 1.12 灯的开关状态随时间变化图此图表示在0秒到30秒，灯的状态是关的，30-60秒灯的状态为开，60秒后状态为关。在实际工作中我基本上没有试用过时间图。下面通过这个表格来总结一下我在需求分析工作中应用各种UML图的情况：表 1.13 各种UML图实际应用情况 建模工具 UML建模工具Visio 、Rational Rose、PowerDesign的比较，Visio用得相对较多。 ROSE是直接从UML发展而诞生的设计工具，它的出现就是为了对UML建模的支持，ROSE一开始没有对数据库端建模的支持，但是在现在的版本中已经加入数据库建模的功能。ROSE主要是在开发过程中的各种语义、模块、对象以及流程，状态等描述比较好，主要体现在能够从各个方面和角度来分析和设计，使软件的开发蓝图更清晰，内部结构更加明朗（但是它的结构仅仅对那些对掌握UML的开发人员，也就是说对客户了解系统的功能和流程等并不一定很有效），对系统的代码框架生成有很好的支持。但对数据库的开发管理和数据库端的迭代不是很好。 PowerDesigner原来是对数据库建模而发展起来的一种数据库建模工具。直到7.0版才开始对面向对象的开发的支持，后来又引入了对UML的支持。但是由于PowerDesigner侧重不一样，所以它对数据库建模的支持很好，支持了能够看到的90%左右的数据库，对UML的建模使用到的各种图的支持比较滞后。但是在最近得到加强。所以使用它来进行UML开发的并不多，很多人都是用它来作为数据库的建模。如果使用UML分析，它的优点是生成代码时对Sybase的产品PowerBuilder的支持很好（其它UML建模工具则没有或者需要一定的插件），其他面向对象语言如 C++，Java，VB,C#等支持也不错。但是它好像继承了Sybase公司的一贯传统，对中国的市场不是很看看好，所以对中文的支持总是有这样或那样的问题。 UML建模工具Visio 原来仅仅是一种画图工具，能够用来描述各种图形（从电路图到房屋结构图），也是到VISIO2000才开始引进软件分析设计功能到代码生成的全部功能，它可以说是目前最能够用图形方式来表达各种商业图形用途的工具（对软件开发中的UML支持仅仅是其中很少的一部分）。它跟微软的office产品的能够很好兼容。能够把图形直接复制或者内嵌到WORD的文档中。但是对于代码的生成更多是支持微软的产品如VB,VC++,MS SQL Server 等（这也是微软的传统），所以它可以说用于图形语义的描述比较方便，但是用于软件开发过程的迭代开发则有点牵强。 UML建模工具Visio 、Rational Rose、PowerDesign三种建模工具应用最广：1. Rational Rose，它是ibm的 。2.Microsoft的 Microsoft Office Visio® 2003 3.Enterprise Architect。还有其他工具如PowerDesigner等1.Rational Rose是一种基于UML的建模工具。在面向对象应用程序开发领域，Rational Rose是影响其发展的一个重要因素。Rational Rose自推出以来就受到了业界的瞩目，并一直引领着可视化建模工具的发展。越来越多的软件公司和开发团队开始或者已经采用Rational Rose，用于大型项目开发的分析、建模与设计等方面。从使用的角度分析，Rational Rose易于使用，支持使用多种构件和多种语言的复杂系统建模；利用双向工程技术可以实现迭代式开发；团队管理特性支持大型、复杂的项目和大型而且通常队员分散在各个不同地方的开发团队。同时，Rational Rose与微软Visual Studio系列工具中GUI的完美结合所带来的方便性，使得它成为绝大多数开发人员首选建模工具；Rose还是市场上第一个提供对基于UML的数据建模和Web建模支持的工具。此外，Rose还为其他一些领域提供支持，如用户定制和产品性能改进。具体介绍可参看http://www.uml.org.cn/RequirementProject/200604043.htm2.UML建模工具Visio ® 2003的简介请看http://www.uml.org.cn/UMLTools/psf/Guide.dochttp://www.microsoft.com/china/office/xp/visio/default.asp3.Enterprise ArchitectEnterprise Architect是一个全功能的、基于UML的visual CASE工具，主要用于设计、编写、构建并管理以目标为导向的软件系统。它支持用户案例、商务流程模式以及动态的图表、分类、界面、协作、结构以及物理模型。此外，它还支持C++、Java、Visual Basic、Delphi、C#以及VB.Net。具体可看http://www.softwarechn.com/SparxSystems/sparxsystems_index.htm4.PowerDesigner工具简介请看http://www.uml.org.cn/UMLTools/powerDesigner/powerDesignerToolIntroduction.htm5.EA与Rose UML建模工具比较http://51cmm.csai.cn/casepanel/ST/No061.htm6.uml介绍请看uml中国官方网站，这里有很多关于uml建模和建模工具的介绍http://www.uml.org.cn 使用场景 UML除了用于软件设计，还能用于需求分析； 实际工作中UML是与客户沟通的良好桥梁，在项目需求分析工作中，可直接使用 UML图与客户沟通，并且给客户签署的需求规格说明书中含有大量的UML图； 产品经理角度用UML建模，用例图、状态图、活动图、时序图与类图相对较多。总结UML是Unified Modeling Language的简称，是软件开发界的一套标准，UML不仅可用于软件设计，也可以用于软件需求分析。但UML并不是强制标准，我们应该善用包括UML在内的各种标准来提高我们的水平。UML可分为两类：结构型、行为型，结构性的UML有：类图、对象图、构件图、部署图、包图，行为型的图有活动图、状态机图、顺序图、通信图、用例图、时间图。类图是业务概念模型分析的有利武器，也是面向对象分析能力的强有力训练工具。对象图在需求分析工作中并不常用。构件图、部署图是分析IT基础架构、软件架构等方面需求的有利分析工具，但需要你具备IT基础架构、软件设计方面的知识和经验。包图可用来组织类图，在需求分析工作中应用的机会不是很大。活动图、状态机图、顺序图是分析业务流程的强力武器。活动图的表达思路与流程图很类似，很容易掌握，而且大部分情况下都可以使用活动图来分析业务流程;某流程如果是围绕某个物品进行，该物品在流程中转换多种状态，那么使用状态机图来分析是首选;用顺序图来分析的好处是能清晰表达整个过程所参与的角色，角色与角色之间的关系，各角色是如何被卷入这个过程当中的。通信图可以看作是顺序图的另外一种表达形式，顺序图更强调先后顺序，通信图更强调相互之间的关系。而从我的工作经验看，顺序图更加实用一点。有人会将用例图称作“公仔图”，用例图表达的是什么角色通过软件系统能做什么事情，我们可以使用用例图系统地表达软件系统的绝大部分需求。时间图是表示某东西的状态随时间变化而变化的一种图，我在实际工作中很少有机会能用到这种图实践案例此推文很好的介绍了产品经理用的UML工具并结合具体实践案例进行分析https://mp.weixin.qq.com/s/mqUlXJ3lHVbK_r7z1vlJug","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]},{"title":"用户体验地图","slug":"tools/用户体验地图","date":"2019-05-11T08:30:10.000Z","updated":"2019-05-12T13:42:23.059Z","comments":true,"path":"undefined/tools/用户体验地图/","link":"","permalink":"http://yoursite.com/undefined/tools/用户体验地图/","excerpt":"","text":"方法名称用户体验地图 方法介绍用户体验地图是一个以可视化图形描述用户使用产品或接受服务的体验情况，以此发现用户在整个使用过程中的问题点和满意点，并从中提炼出产品或服务中的改进点和机会点。可采用专家评估判断或用户定性打分判断两种方式。 产品阶段产品需求、产品规划、产品设计、产品运营 产品层面战略层、范围层、结构层、框架层、表现层 适用市场现有市场、垂直市场、全新市场 方法目的 用户全流程体验的可视化 研究用户行为习惯，理解用户心理，发掘产品问题和产品机会点方法属性定性、行为方法渠道田野调查、方法评估、用户访谈方法类型创新方法使用步骤[设定场景任务，邀约用户] 根据需求或问题设定场景任务 邀约8- 10名用户，全新市场产品可邀请竞品用户 [观察与测试用户] 用户进行任务测试，设计师从一旁跟踪观察 分析用户在相应场景中的态度或观点，寻找接触点，定义他们的感情是正面的还是负面 可同时对比产品与竞品在接触点处的情绪差异 [用户满意度打分] 测试任务结束后，针对核心接触点，用户进行颗粒度从1-5的满意度打分 访谈用户打分背后的原因，提取使用过程中的“兴趣点”或痛点” [绘制情绪曲线图] 划分功能阶段:确定任务流程中各个功能阶段。按照-定的逻辑， 将体验拆分为几块 统计用户每一接触点打分的平均值， 体现在体验地图上,并给出相应的解释 参考模板实践案例咸鱼购买二手商品用户体验地图砍价活动用户体验地图","categories":[{"name":"tools","slug":"tools","permalink":"http://yoursite.com/categories/tools/"}],"tags":[]},{"title":"用户体验地图","slug":"产品方法/用户体验地图","date":"2019-05-11T08:30:10.000Z","updated":"2019-07-06T12:03:15.522Z","comments":true,"path":"undefined/产品方法/用户体验地图/","link":"","permalink":"http://yoursite.com/undefined/产品方法/用户体验地图/","excerpt":"","text":"一、方法名称用户体验地图 二、方法介绍用户体验地图是一个以可视化图形描述用户使用产品或接受服务的体验情况，以此发现用户在整个使用过程中的问题点和满意点，并从中提炼出产品或服务中的改进点和机会点。可采用专家评估判断或用户定性打分判断两种方式。 三、适用环境 产品阶段产品需求、产品规划、产品设计、产品运营 产品层面战略层、范围层、结构层、框架层、表现层 适用市场现有市场、垂直市场、全新市场 方法目的 用户全流程体验的可视化 研究用户行为习惯，理解用户心理，发掘产品问题和产品机会点方法属性定性、行为方法渠道田野调查、方法评估、用户访谈方法类型创新方法四、使用步骤[设定场景任务，邀约用户] 根据需求或问题设定场景任务 邀约8- 10名用户，全新市场产品可邀请竞品用户 [观察与测试用户] 用户进行任务测试，设计师从一旁跟踪观察 分析用户在相应场景中的态度或观点，寻找接触点，定义他们的感情是正面的还是负面 可同时对比产品与竞品在接触点处的情绪差异 [用户满意度打分] 测试任务结束后，针对核心接触点，用户进行颗粒度从1-5的满意度打分 访谈用户打分背后的原因，提取使用过程中的“兴趣点”或痛点” [绘制情绪曲线图] 划分功能阶段:确定任务流程中各个功能阶段。按照-定的逻辑， 将体验拆分为几块 统计用户每一接触点打分的平均值， 体现在体验地图上,并给出相应的解释 参考模板五、实践案例咸鱼购买二手商品用户体验地图砍价活动用户体验地图","categories":[{"name":"产品方法","slug":"产品方法","permalink":"http://yoursite.com/categories/产品方法/"}],"tags":[]}]}